//
var u = require('../utils');
var conj = 'seven';

// FIXME: seven - нужно бы уточнить список примеров, вдруг возможная последняя буква пропущена
// [ 'taYc', 'tfd', 'tfh', 'tvaYc', 'ud', 'hiMs', 'inD', 'Siz', 'und', 'ric', 'ruD', 'aYj', 'vic', 'vid', 'kzud', 'yuj', 'fYj', 'Buj', 'Cfd', 'Cid', 'BaYj', 'Bid', 'pfc', 'piz', 'ard', 'kft', 'Kid' ]
// ends : c,d,h,s(MS), D,z,j,t

var tests = {
    'ruD': { // obstruct
        'lat_par': ['रुणद्धि', 'रुणत्सि', 'रुणध्मि', 'रुन्द्धः', 'रुन्द्धः', 'रुन्ध्वः', 'रुन्धन्ति', 'रुन्द्ध', 'रुन्ध्मः'],
        'lat_atm': ['रुन्द्धे', 'रुन्त्से', 'रुन्धे', 'रुन्धाते', 'रुन्धाथे', 'रुन्ध्वहे', 'रुन्धते', 'रुन्द्ध्वे', 'रुन्ध्महे'],
        'lat_pas': ['रुध्यते', 'रुध्यसे', 'रुध्ये', 'रुध्येते', 'रुध्येथे', 'रुध्यावहे', 'रुध्यन्ते', 'रुध्यध्वे', 'रुध्यामहे'],
        'lan_par': ['अरुणत्', 'अरुणः', 'अरुणधम्', 'अरुन्द्धाम्', 'अरुन्द्धम्', 'अरुन्ध्व', 'अरुन्धन्', 'अरुन्द्ध', 'अरुन्ध्म'],
        'lan_atm': ['अरुन्द्ध', 'अरुन्द्धाः', 'अरुन्धि', 'अरुन्धाताम्', 'अरुन्धाथाम्', 'अरुन्ध्वहि', 'अरुन्धत', 'अरुन्द्ध्वम्', 'अरुन्ध्महि'],
        'lan_pas': ['अरुध्यत', 'अरुध्यथाः', 'अरुध्ये', 'अरुध्येताम्', 'अरुध्येथाम्', 'अरुध्यावहि', 'अरुध्यन्त', 'अरुध्यध्वम्', 'अरुध्यामहि'],
        'lot_par': ['रुणद्धु', 'रुन्द्धि', 'रुणधानि', 'रुन्द्धाम्', 'रुन्द्धम्', 'रुणधाव', 'रुन्धन्तु', 'रुन्द्ध', 'रुणधाम'],
        'lot_atm': ['रुन्द्धाम्', 'रुन्त्स्व', 'रुणधै', 'रुन्धाताम्', 'रुन्धाथाम्', 'रुणधावहै', 'रुन्धताम्', 'रुन्द्ध्वम्', 'रुणधामहै'],
        'lot_pas': ['रुध्यताम्', 'रुध्यस्व', 'रुध्यै', 'रुध्येताम्', 'रुध्येथाम्', 'रुध्यावहै', 'रुध्यन्ताम्', 'रुध्यध्वम्', 'रुध्यामहै'],
        'lit_par': ['रुरोध', 'रुरोधिथ', 'रुरोध', 'रुरुधतुः', 'रुरुधथुः', 'रुरुधिव', 'रुरुधुः', 'रुरुध', 'रुरुधिम'],
        'lit_atm': ['रुरुधे', 'रुरुधिषे', 'रुरुधे', 'रुरुधाते', 'रुरुधाथे', 'रुरुधिवहे', 'रुरुधिरे', 'रुरुधिध्वे', 'रुरुधिमहे'],
    },
    'yuj': { // join
        'lat_par': ['युनक्ति', 'युनक्षि', 'युनज्मि', 'युङ्क्तः', 'युङ्क्थः', 'युञ्ज्वः', 'युञ्जन्ति', 'युङ्क्थ', 'युञ्ज्मः'],
        'lat_atm': ['युङ्क्ते', 'युङ्क्षे', 'युञ्जे', 'युञ्जाते', 'युञ्जाथे', 'युञ्ज्वहे', 'युञ्जते', 'युङ्ग्ध्वे', 'युञ्ज्महे'],
        'lat_pas': ['युज्यते', 'युज्यसे', 'युज्ये', 'युज्येते', 'युज्येथे', 'युज्यावहे', 'युज्यन्ते', 'युज्यध्वे', 'युज्यामहे'],
        // FIXME: yuj_lan_par_atm sg.1 -k, легче вынести в terms?, W.692.a
        //'lan_par': ['अयुनक्', 'अयुनक्', 'अयुनजम्', 'अयुङ्क्ताम्', 'अयुङ्क्तम्', 'अयुञ्ज्व', 'अयुञ्जन्', 'अयुङ्क्त', 'अयुञ्ज्म'],
        //'lan_atm': ['अयुङ्क्त', 'अयुङ्क्थाः', 'अयुञ्जि', 'अयुञ्जाताम्', 'अयुञ्जाथाम्', 'अयुञ्ज्वहि', 'अयुञ्जत', 'अयुङ्ग्ध्वम्', 'अयुञ्ज्महि'],
        'lan_pas': ['अयुज्यत', 'अयुज्यथाः', 'अयुज्ये', 'अयुज्येताम्', 'अयुज्येथाम्', 'अयुज्यावहि', 'अयुज्यन्त', 'अयुज्यध्वम्', 'अयुज्यामहि'],
        'lot_par': ['युनक्तु', 'युङ्ग्धि', 'युनजानि', 'युङ्क्ताम्', 'युङ्क्तम्', 'युनजाव', 'युञ्जन्तु', 'युङ्क्त', 'युनजाम'],
        'lot_atm': ['युङ्क्ताम्', 'युङ्क्ष्व', 'युनजै', 'युञ्जाताम्', 'युञ्जाथाम्', 'युनजावहै', 'युञ्जताम्', 'युङ्ग्ध्वम्', 'युनजामहै'],
        'lot_pas': ['युज्यताम्', 'युज्यस्व', 'युज्यै', 'युज्येताम्', 'युज्येथाम्', 'युज्यावहै', 'युज्यन्ताम्', 'युज्यध्वम्', 'युज्यामहै'],
        'lit_par': ['युयोज', 'युयोजिथ', 'युयोज', 'युयुजतुः', 'युयुजथुः', 'युयुजिव', 'युयुजुः', 'युयुज', 'युयुजिम'],
        'lit_atm': ['युयुजे', 'युयुजिषे', 'युयुजे', 'युयुजाते', 'युयुजाथे', 'युयुजिवहे', 'युयुजिरे', 'युयुजिध्वे', 'युयुजिमहे'],
    },

    'Bid': { // destroy
        'lat_par': ['भिनत्ति', 'भिनत्सि', 'भिनद्मि', 'भिन्त्तः', 'भिन्त्थः', 'भिन्द्वः', 'भिन्दन्ति', 'भिन्त्थ', 'भिन्द्मः'],
        'lat_atm': ['भिन्त्ते', 'भिन्त्से', 'भिन्दे', 'भिन्दाते', 'भिन्दाथे', 'भिन्द्वहे', 'भिन्दते', 'भिन्द्ध्वे', 'भिन्द्महे'],
        'lat_pas': ['भिद्यते', 'भिद्यसे', 'भिद्ये', 'भिद्येते', 'भिद्येथे', 'भिद्यावहे', 'भिद्यन्ते', 'भिद्यध्वे', 'भिद्यामहे'],
        'lan_par': ['अभिनत्', 'अभिनः', 'अभिनदम्', 'अभिन्त्ताम्', 'अभिन्त्तम्', 'अभिन्द्व', 'अभिन्दन्', 'अभिन्त्त', 'अभिन्द्म'],
        'lan_atm': ['अभिन्त्त', 'अभिन्त्थाः', 'अभिन्दि', 'अभिन्दाताम्', 'अभिन्दाथाम्', 'अभिन्द्वहि', 'अभिन्दत', 'अभिन्द्ध्वम्', 'अभिन्द्महि'],
        'lan_pas': ['अभिद्यत', 'अभिद्यथाः', 'अभिद्ये', 'अभिद्येताम्', 'अभिद्येथाम्', 'अभिद्यावहि', 'अभिद्यन्त', 'अभिद्यध्वम्', 'अभिद्यामहि'],
        'lot_par': ['भिनत्तु', 'भिन्द्धि', 'भिनदानि', 'भिन्त्ताम्', 'भिन्त्तम्', 'भिनदाव', 'भिन्दन्तु', 'भिन्त्त', 'भिनदाम'],
        'lot_atm': ['भिन्त्ताम्', 'भिन्त्स्व', 'भिनदै', 'भिन्दाताम्', 'भिन्दाथाम्', 'भिनदावहै', 'भिन्दताम्', 'भिन्द्ध्वम्', 'भिनदामहै'],
        'lot_pas': ['भिद्यताम्', 'भिद्यस्व', 'भिद्यै', 'भिद्येताम्', 'भिद्येथाम्', 'भिद्यावहै', 'भिद्यन्ताम्', 'भिद्यध्वम्', 'भिद्यामहै'],
        'lit_par': ['बिभेद', 'बिभेदिथ', 'बिभेद', 'बिभिदतुः', 'बिभिदथुः', 'बिभिदिव', 'बिभिदुः', 'बिभिद', 'बिभिदिम'],
        'lit_atm': ['बिभिदे', 'बिभिदिषे', 'बिभिदे', 'बिभिदाते', 'बिभिदाथे', 'बिभिदिवहे', 'बिभिदिरे', 'बिभिदिध्वे', 'बिभिदिमहे'],
    },
    'piz': { // crush - पिष्
        // FIXME: errs lan_par, lot_par
        // FIXME: piz_lan_par_sg.2 flex.flex == sg.1, или добавить, что странно, или в terms,
        // или еще один, новый механизм размножения, если flex -d, (sg.3) - то добавить sg.2. Или это то же, что добавть flex?
        'lat_par': ['पिनष्टि', 'पिनक्षि', 'पिनष्मि', 'पिंष्टः', 'पिंष्ठः', 'पिंष्वः', 'पिंषन्ति', 'पिंष्ठ', 'पिंष्मः'],
        'lat_pas': ['पिष्यते', 'पिष्यसे', 'पिष्ये', 'पिष्येते', 'पिष्येथे', 'पिष्यावहे', 'पिष्यन्ते', 'पिष्यध्वे', 'पिष्यामहे'],
        'lan_par': ['अपिनट्', 'अपिनट्', 'अपिनषम्', 'अपिंष्टाम्', 'अपिंष्टम्', 'अपिंष्व', 'अपिंषन्', 'अपिंष्ट', 'अपिंष्म'],
        'lan_pas': ['अपिष्यत', 'अपिष्यथाः', 'अपिष्ये', 'अपिष्येताम्', 'अपिष्येथाम्', 'अपिष्यावहि', 'अपिष्यन्त', 'अपिष्यध्वम्', 'अपिष्यामहि'],
        'lot_par': ['पिनष्टु', 'पिण्ड्ढि', 'पिनषाणि', 'पिंष्टाम्', 'पिंष्टम्', 'पिनषाव', 'पिंषन्तु', 'पिंष्ट', 'पिनषाम'], // TODO: WTF?
        'lot_pas': ['पिष्यताम्', 'पिष्यस्व', 'पिष्यै', 'पिष्येताम्', 'पिष्येथाम्', 'पिष्यावहै', 'पिष्यन्ताम्', 'पिष्यध्वम्', 'पिष्यामहै'],
        'lit_par': ['पिपेष', 'पिपेषिथ', 'पिपेष', 'पिपिषतुः', 'पिपिषथुः', 'पिपिषिव', 'पिपिषुः', 'पिपिष', 'पिपिषिम'],
    },

    'hiMs': { // kill
        'lat_par': ['हिनस्ति', 'हिनःसि', 'हिनस्मि', 'हिंष्टः', 'हिंष्ठः', 'हिंष्वः', 'हिंसन्ति', 'हिंष्ठ', 'हिंष्मः'],
        // 'lat_pas': ['हिंस्यते', 'हिंस्यसे', 'हिंस्ये', 'हिंस्येते', 'हिंस्येथे', 'हिंस्यावहे', 'हिंस्यन्ते', 'हिंस्यध्वे', 'हिंस्यामहे'],
        // 'lan_par': ['अहिनत्', 'अहिनः-अहिंसत्', 'अहिनसम्', 'अहिंष्टाम्', 'अहिंष्टम्', 'अहिंष्व', 'अहिंसन्', 'अहिंष्ट', 'अहिंष्म'],
        // 'lan_pas': ['अहिंस्यत', 'अहिंस्यथाः', 'अहिंस्ये', 'अहिंस्येताम्', 'अहिंस्येथाम्', 'अहिंस्यावहि', 'अहिंस्यन्त', 'अहिंस्यध्वम्', 'अहिंस्यामहि'],
        'lot_par': ['होनस्तु', 'होंष्धि', 'होनसानि', 'होंष्टाम्', 'होंष्टम्', 'होनसाव', 'होंसन्तु', 'होंष्ट', 'होनसाम'],
        'lot_atm': ['होंष्टाम्', 'होंःष्व', 'होनसै', 'होंसाताम्', 'होंसाथाम्', 'होनसावहै', 'होंसताम्', 'होंष्ध्वम्', 'होनसामहै'],
        'lot_pas': ['होंस्यताम्', 'होंस्यस्व', 'होंस्यै', 'होंस्येताम्', 'होंस्येथाम्', 'होंस्यावहै', 'होंस्यन्ताम्', 'होंस्यध्वम्', 'होंस्यामहै'],
        'lit_par': ['जिहिंस', 'जिहिंसिथ', 'जिहिंस', 'जिहिंसतुः', 'जिहिंसथुः', 'जिहिंसिव', 'जिहिंसुः', 'जिहिंस', 'जिहिंसिम'],
    },
    // FIXME: ric_lan_par_sg.3,2 -k
    'ric': { // to empty - रिच्
        'lat_par': ['रिणक्ति', 'रिणक्षि', 'रिणच्मि', 'रिङ्क्तः', 'रिङ्क्थः', 'रिञ्च्वः', 'रिञ्चन्ति', 'रिङ्क्थ', 'रिञ्च्मः'],
        'lat_atm': ['रिङ्क्ते', 'रिङ्क्षे', 'रिञ्चे', 'रिञ्चाते', 'रिञ्चाथे', 'रिञ्च्वहे', 'रिञ्चते', 'रिङ्ग्ध्वे', 'रिञ्च्महे'], // WTF? रिङ्क्ते
        'lat_pas': ['रिच्यते', 'रिच्यसे', 'रिच्ये', 'रिच्येते', 'रिच्येथे', 'रिच्यावहे', 'रिच्यन्ते', 'रिच्यध्वे', 'रिच्यामहे'],
        'lan_par': ['अरिणक्', 'अरिणक्', 'अरिणचम्', 'अरिङ्क्ताम्', 'अरिङ्क्तम्', 'अरिञ्च्व', 'अरिञ्चन्', 'अरिङ्क्त', 'अरिञ्च्म'],
        'lan_atm': ['अरिङ्क्त', 'अरिङ्क्थाः', 'अरिञ्चि', 'अरिञ्चाताम्', 'अरिञ्चाथाम्', 'अरिञ्च्वहि', 'अरिञ्चत', 'अरिङ्ग्ध्वम्', 'अरिञ्च्महि'],
        'lan_pas': ['अरिच्यत', 'अरिच्यथाः', 'अरिच्ये', 'अरिच्येताम्', 'अरिच्येथाम्', 'अरिच्यावहि', 'अरिच्यन्त', 'अरिच्यध्वम्', 'अरिच्यामहि'],
        'lot_par': ['रिणक्तु', 'रिङ्ग्धि', 'रिणचानि', 'रिङ्क्ताम्', 'रिङ्क्तम्', 'रिणचाव', 'रिञ्चन्तु', 'रिङ्क्त', 'रिणचाम'],
        'lot_atm': ['रिङ्क्ताम्', 'रिङ्क्ष्व', 'रिणचै', 'रिञ्चाताम्', 'रिञ्चाथाम्', 'रिणचावहै', 'रिञ्चताम्', 'रिङ्ग्ध्वम्', 'रिणचामहै'],
        'lot_pas': ['रिच्यताम्', 'रिच्यस्व', 'रिच्यै', 'रिच्येताम्', 'रिच्येथाम्', 'रिच्यावहै', 'रिच्यन्ताम्', 'रिच्यध्वम्', 'रिच्यामहै'],
        'lit_par': ['रिरेच', 'रिरेचिथ', 'रिरेच', 'रिरिचतुः', 'रिरिचथुः', 'रिरिचिव', 'रिरिचुः', 'रिरिच', 'रिरिचिम'],
        'lit_atm': ['रिरिचे', 'रिरिचिषे', 'रिरिचे', 'रिरिचाते', 'रिरिचाथे', 'रिरिचिवहे', 'रिरिचिरे', 'रिरिचिध्वे', 'रिरिचिमहे'],
    },

    'Cid': { // cut FIXME: lan_pass
        'lat_par': ['छिनत्ति', 'छिनत्सि', 'छिनद्मि', 'छिन्त्तः', 'छिन्त्थः', 'छिन्द्वः', 'छिन्दन्ति', 'छिन्त्थ', 'छिन्द्मः'],
        'lat_atm': ['छिन्त्ते', 'छिन्त्से', 'छिन्दे', 'छिन्दाते', 'छिन्दाथे', 'छिन्द्वहे', 'छिन्दते', 'छिन्द्ध्वे', 'छिन्द्महे'],
        'lat_pas': ['छिद्यते', 'छिद्यसे', 'छिद्ये', 'छिद्येते', 'छिद्येथे', 'छिद्यावहे', 'छिद्यन्ते', 'छिद्यध्वे', 'छिद्यामहे'],
        'lan_par': ['अच्छिनत्', 'अच्छिनः', 'अच्छिनदम्', 'अच्छिन्त्ताम्', 'अच्छिन्त्तम्', 'अच्छिन्द्व', 'अच्छिन्दन्', 'अच्छिन्त्त', 'अच्छिन्द्म'],
        'lan_atm': ['अच्छिन्त्त', 'अच्छिन्त्थाः', 'अच्छिन्दि', 'अच्छिन्दाताम्', 'अच्छिन्दाथाम्', 'अच्छिन्द्वहि', 'अच्छिन्दत', 'अच्छिन्द्ध्वम्', 'अच्छिन्द्महि'],
        'lan_pas': ['अच्छिद्यत', 'अच्छिद्यथाः', 'अच्छिद्ये', 'अच्छिद्येताम्', 'अच्छिद्येथाम्', 'अच्छिद्यावहि', 'अच्छिद्यन्त', 'अच्छिद्यध्वम्', 'अच्छिद्यामहि'],
        'lot_par': ['छिनत्तु', 'छिन्द्धि', 'छिनदानि', 'छिन्त्ताम्', 'छिन्त्तम्', 'छिनदाव', 'छिन्दन्तु', 'छिन्त्त', 'छिनदाम'],
        'lot_atm': ['छिन्त्ताम्', 'छिन्त्स्व', 'छिनदै', 'छिन्दाताम्', 'छिन्दाथाम्', 'छिनदावहै', 'छिन्दताम्', 'छिन्द्ध्वम्', 'छिनदामहै'],
        'lot_pas': ['छिद्यताम्', 'छिद्यस्व', 'छिद्यै', 'छिद्येताम्', 'छिद्येथाम्', 'छिद्यावहै', 'छिद्यन्ताम्', 'छिद्यध्वम्', 'छिद्यामहै'],
        'lit_par': ['चिच्छेद', 'चिच्छेदिथ', 'चिच्छेद', 'चिच्छिदतुः', 'चिच्छिदथुः', 'चिच्छिदिव', 'चिच्छिदुः', 'चिच्छिद', 'चिच्छिदिम'],
        'lit_atm': ['चिच्छिदे', 'चिच्छिदिषे', 'चिच्छिदे', 'चिच्छिदाते', 'चिच्छिदाथे', 'चिच्छिदिवहे', 'चिच्छिदिरे', 'चिच्छिदिध्वे', 'चिच्छिदिमहे'],
    },

    'Buj': { // protect, A to eat, enjoy
        'lat_par': ['भुनक्ति', 'भुनक्षि', 'भुनज्मि', 'भुङ्क्तः', 'भुङ्क्थः', 'भुञ्ज्वः', 'भुञ्जन्ति', 'भुङ्क्थ', 'भुञ्ज्मः'],
        'lat_atm': ['भुङ्क्ते', 'भुङ्क्षे', 'भुञ्जे', 'भुञ्जाते', 'भुञ्जाथे', 'भुञ्ज्वहे', 'भुञ्जते', 'भुङ्ग्ध्वे', 'भुञ्ज्महे'],
        'lat_pas': ['भुज्यते', 'भुज्यसे', 'भुज्ये', 'भुज्येते', 'भुज्येथे', 'भुज्यावहे', 'भुज्यन्ते', 'भुज्यध्वे', 'भुज्यामहे'],
        'lan_par': ['अभुनक्', 'अभुनक्', 'अभुनजम्', 'अभुङ्क्ताम्', 'अभुङ्क्तम्', 'अभुञ्ज्व', 'अभुञ्जन्', 'अभुङ्क्त', 'अभुञ्ज्म'],
        'lan_atm': ['अभुङ्क्त', 'अभुङ्क्थाः', 'अभुञ्जि', 'अभुञ्जाताम्', 'अभुञ्जाथाम्', 'अभुञ्ज्वहि', 'अभुञ्जत', 'अभुङ्ग्ध्वम्', 'अभुञ्ज्महि'],
        'lan_pas': ['अभुज्यत', 'अभुज्यथाः', 'अभुज्ये', 'अभुज्येताम्', 'अभुज्येथाम्', 'अभुज्यावहि', 'अभुज्यन्त', 'अभुज्यध्वम्', 'अभुज्यामहि'],
        'lot_par': ['भुनक्तु', 'भुङ्ग्धि', 'भुनजानि', 'भुङ्क्ताम्', 'भुङ्क्तम्', 'भुनजाव', 'भुञ्जन्तु', 'भुङ्क्त', 'भुनजाम'],
        'lot_atm': ['भुङ्क्ताम्', 'भुङ्क्ष्व', 'भुनजै', 'भुञ्जाताम्', 'भुञ्जाथाम्', 'भुनजावहै', 'भुञ्जताम्', 'भुङ्ग्ध्वम्', 'भुनजामहै'],
        'lot_pas': ['भुज्यताम्', 'भुज्यस्व', 'भुज्यै', 'भुज्येताम्', 'भुज्येथाम्', 'भुज्यावहै', 'भुज्यन्ताम्', 'भुज्यध्वम्', 'भुज्यामहै'],
        'lit_par': ['बुभोज', 'बुभोजिथ', 'बुभोज', 'बुभुजतुः', 'बुभुजथुः', 'बुभुजिव', 'बुभुजुः', 'बुभुज', 'बुभुजिम'],
        'lit_atm': ['बुभुजे', 'बुभुजिषे', 'बुभुजे', 'बुभुजाते', 'बुभुजाथे', 'बुभुजिवहे', 'बुभुजिरे', 'बुभुजिध्वे', 'बुभुजिमहे'],
    },
    'pfc': { // mix
        'lat_par': ['पृणक्ति', 'पृणक्षि', 'पृणच्मि', 'पृङ्क्तः', 'पृङ्क्थः', 'पृञ्च्वः', 'पृञ्चन्ति', 'पृङ्क्थ', 'पृञ्च्मः'],
        'lat_pas': ['पृच्यते', 'पृच्यसे', 'पृच्ये', 'पृच्येते', 'पृच्येथे', 'पृच्यावहे', 'पृच्यन्ते', 'पृच्यध्वे', 'पृच्यामहे'],
        'lan_par': ['अपृणक्', 'अपृणक्', 'अपृणचम्', 'अपृङ्क्ताम्', 'अपृङ्क्तम्', 'अपृञ्च्व', 'अपृञ्चन्', 'अपृङ्क्त', 'अपृञ्च्म'],
        'lan_pas': ['अपृच्यत', 'अपृच्यथाः', 'अपृच्ये', 'अपृच्येताम्', 'अपृच्येथाम्', 'अपृच्यावहि', 'अपृच्यन्त', 'अपृच्यध्वम्', 'अपृच्यामहि'],
        'lot_par': ['पृणक्तु', 'पृङ्ग्धि', 'पृणचानि', 'पृङ्क्ताम्', 'पृङ्क्तम्', 'पृणचाव', 'पृञ्चन्तु', 'पृङ्क्त', 'पृणचाम'],
        'lot_pas': ['पृच्यताम्', 'पृच्यस्व', 'पृच्यै', 'पृच्येताम्', 'पृच्येथाम्', 'पृच्यावहै', 'पृच्यन्ताम्', 'पृच्यध्वम्', 'पृच्यामहै'],
        'lit_par': ['पपर्च', 'पपर्चिथ', 'पपर्च', 'पपृचतुः', 'पपृचथुः', 'पपृचिव', 'पपृचुः', 'पपृच', 'पपृचिम'],
    },

    'tfh': { // crush FIXME: дохренищща
        'lat_par': ['तृणाढि', 'तृणक्षि', 'तृणह्मि', 'तृण्ढः', 'तृण्ढः', 'तृंह्वः', 'तृंहन्ति', 'तृण्ढ', 'तृंह्मः'],
        'lat_atm': ['तृण्ढे', 'तृङ्क्षे', 'तृंहे', 'तृंहाते', 'तृंहाथे', 'तृंह्वहे', 'तृंहते', 'तृण्ढ्वे', 'तृंह्महे'],
        'lat_pas': ['तृह्यते', 'तृह्यसे', 'तृह्ये', 'तृह्येते', 'तृह्येथे', 'तृह्यावहे', 'तृह्यन्ते', 'तृह्यध्वे', 'तृह्यामहे'],
        'lan_par': ['अतृणट्', 'अतृणट्', 'अतृणहम्', 'अतृण्ढाम्', 'अतृण्ढम्', 'अतृंह्व', 'अतृंहन्', 'अतृण्ढ', 'अतृंह्म'],
        'lan_atm': ['अतृण्ढ', 'अतृण्ढाः', 'अतृंहि', 'अतृंहाताम्', 'अतृंहाथाम्', 'अतृंह्वहि', 'अतृंहत', 'अतृण्ढ्वम्', 'अतृंह्महि'],
        'lan_pas': ['अतृह्यत', 'अतृह्यथाः', 'अतृह्ये', 'अतृह्येताम्', 'अतृह्येथाम्', 'अतृह्यावहि', 'अतृह्यन्त', 'अतृह्यध्वम्', 'अतृह्यामहि'],
        'lot_par': ['तृणाढु', 'तृण्ढि', 'तृणहानि', 'तृण्ढाम्', 'तृण्ढम्', 'तृणहाव', 'तृंहन्तु', 'तृण्ढ', 'तृणहाम'],
        'lot_atm': ['तृण्ढाम्', 'तृङ्क्ष्व', 'तृणहै', 'तृंहाताम्', 'तृंहाथाम्', 'तृणहावहै', 'तृंहताम्', 'तृण्ढ्वम्', 'तृणहामहै'],
        'lot_pas': ['तृह्यताम्', 'तृह्यस्व', 'तृह्यै', 'तृह्येताम्', 'तृह्येथाम्', 'तृह्यावहै', 'तृह्यन्ताम्', 'तृह्यध्वम्', 'तृह्यामहै'],
        'lit_par': ['ततर्ह', 'ततर्हिथ', 'ततर्ह', 'ततृहतुः', 'ततृहथुः', 'ततृहिव', 'ततृहुः', 'ततृह', 'ततृहिम'],
        'lit_atm': ['ततृहे', 'ततृहिषे', 'ततृहे', 'ततृहाते', 'ततृहाथे', 'ततृहिवहे', 'ततृहिरे', 'ततृहिध्वे', 'ततृहिमहे'],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    u.fireTest(tests, conj);
});
