//
var utils = require('../utils');
var conj = 'four';

var tests = {
    'div': { // play, shine // FIXME: Irregularities of the ya-class, W.763
        'lat_par': ['दिव्यति', 'दिव्यसि', 'दिव्यामि', 'दिव्यतः', 'दिव्यथः', 'दिव्यावः', 'दिव्यन्ति', 'दिव्यथ', 'दिव्यामः'],
        'lat_atm': ['दिव्यते', 'दिव्यसे', 'दिव्ये', 'दिव्येते', 'दिव्येथे', 'दिव्यावहे', 'दिव्यन्ते', 'दिव्यध्वे', 'दिव्यामहे'],
        'lat_pas': ['दिव्यते', 'दिव्यसे', 'दिव्ये', 'दिव्येते', 'दिव्येथे', 'दिव्यावहे', 'दिव्यन्ते', 'दिव्यध्वे', 'दिव्यामहे'],
        'lan_par': ['अदिव्यत्', 'अदिव्यः', 'अदिव्यम्', 'अदिव्यताम्', 'अदिव्यतम्', 'अदिव्याव', 'अदिव्यन्', 'अदिव्यत', 'अदिव्याम'],
        'lan_atm': ['अदिव्यत', 'अदिव्यथाः', 'अदिव्ये', 'अदिव्येताम्', 'अदिव्येथाम्', 'अदिव्यावहि', 'अदिव्यन्त', 'अदिव्यध्वम्', 'अदिव्यामहि'],
        'lan_pas': ['अदिव्यत', 'अदिव्यथाः', 'अदिव्ये', 'अदिव्येताम्', 'अदिव्येथाम्', 'अदिव्यावहि', 'अदिव्यन्त', 'अदिव्यध्वम्', 'अदिव्यामहि'],
        'lot_par': ['दिव्यतु', 'दिव्य', 'दिव्यानि', 'दिव्यताम्', 'दिव्यतम्', 'दिव्याव', 'दिव्यन्तु', 'दिव्यत', 'दिव्याम'],
        'lot_atm': ['दिव्यताम्', 'दिव्यस्व', 'दिव्यै', 'दिव्येताम्', 'दिव्येथाम्', 'दिव्यावहै', 'दिव्यन्ताम्', 'दिव्यध्वम्', 'दिव्यामहै'],
        'lot_pas': ['दिव्यताम्', 'दिव्यस्व', 'दिव्यै', 'दिव्येताम्', 'दिव्येथाम्', 'दिव्यावहै', 'दिव्यन्ताम्', 'दिव्यध्वम्', 'दिव्यामहै'],
        'lit_par': ['दिदेव', 'दिदेविथ', 'दिदेव', 'दिदिवतुः', 'दिदिवथुः', 'दिदिविव', 'दिदिवुः', 'दिदिव', 'दिदिविम'],
        'lit_atm': ['दिदिवे', 'दिदिविषे', 'दिदिवे', 'दिदिवाते', 'दिदिवाथे', 'दिदिविवहे', 'दिदिविरे', 'दिदिविध्वे', 'दिदिविमहे'],
    },

    'naS': { // to be gone, go to nothing, dissapiar
        'lat_par': ['नश्यति', 'नश्यसि', 'नश्यामि', 'नश्यतः', 'नश्यथः', 'नश्यावः', 'नश्यन्ति', 'नश्यथ', 'नश्यामः'],
        'lat_pas': ['नश्यते', 'नश्यसे', 'नश्ये', 'नश्येते', 'नश्येथे', 'नश्यावहे', 'नश्यन्ते', 'नश्यध्वे', 'नश्यामहे'],
        'lan_par': ['अनश्यत्', 'अनश्यः', 'अनश्यम्', 'अनश्यताम्', 'अनश्यतम्', 'अनश्याव', 'अनश्यन्', 'अनश्यत', 'अनश्याम'],
        'lan_pas': ['अनश्यत', 'अनश्यथाः', 'अनश्ये', 'अनश्येताम्', 'अनश्येथाम्', 'अनश्यावहि', 'अनश्यन्त', 'अनश्यध्वम्', 'अनश्यामहि'],
        'lot_par': ['नश्यतु', 'नश्य', 'नश्यानि', 'नश्यताम्', 'नश्यतम्', 'नश्याव', 'नश्यन्तु', 'नश्यत', 'नश्याम'],
        'lot_pas': ['नश्यताम्', 'नश्यस्व', 'नश्यै', 'नश्येताम्', 'नश्येथाम्', 'नश्यावहै', 'नश्यन्ताम्', 'नश्यध्वम्', 'नश्यामहै'],
        'lit_par': ['ननाश', 'नेशिथ-ननष्ठ', 'ननाश-ननश', 'नेशतुः', 'नेशथुः', 'नेशिव', 'नेशुः', 'नेश', 'नेशिम'],
    },
    'kup': { // be angry
        'lat_par': ['कुप्यति', 'कुप्यसि', 'कुप्यामि', 'कुप्यतः', 'कुप्यथः', 'कुप्यावः', 'कुप्यन्ति', 'कुप्यथ', 'कुप्यामः'],
        'lat_pas': ['कुप्यते', 'कुप्यसे', 'कुप्ये', 'कुप्येते', 'कुप्येथे', 'कुप्यावहे', 'कुप्यन्ते', 'कुप्यध्वे', 'कुप्यामहे'],
        'lan_par': ['अकुप्यत्', 'अकुप्यः', 'अकुप्यम्', 'अकुप्यताम्', 'अकुप्यतम्', 'अकुप्याव', 'अकुप्यन्', 'अकुप्यत', 'अकुप्याम'],
        'lan_pas': ['अकुप्यत', 'अकुप्यथाः', 'अकुप्ये', 'अकुप्येताम्', 'अकुप्येथाम्', 'अकुप्यावहि', 'अकुप्यन्त', 'अकुप्यध्वम्', 'अकुप्यामहि'],
        'lot_par': ['कुप्यतु', 'कुप्य', 'कुप्यानि', 'कुप्यताम्', 'कुप्यतम्', 'कुप्याव', 'कुप्यन्तु', 'कुप्यत', 'कुप्याम'],
        'lot_pas': ['कुप्यताम्', 'कुप्यस्व', 'कुप्यै', 'कुप्येताम्', 'कुप्येथाम्', 'कुप्यावहै', 'कुप्यन्ताम्', 'कुप्यध्वम्', 'कुप्यामहै'],
        'lit_par': ['चुकोप', 'चुकोपिथ', 'चुकोप', 'चुकुपतुः', 'चुकुपथुः', 'चुकुपिव', 'चुकुपुः', 'चुकुप', 'चुकुपिम'],
    },

    'kruD': { // to become angry
        'lat_par': ['क्रुध्यति', 'क्रुध्यसि', 'क्रुध्यामि', 'क्रुध्यतः', 'क्रुध्यथः', 'क्रुध्यावः', 'क्रुध्यन्ति', 'क्रुध्यथ', 'क्रुध्यामः'],
        'lat_atm': ['क्रुध्यते', 'क्रुध्यसे', 'क्रुध्ये', 'क्रुध्येते', 'क्रुध्येथे', 'क्रुध्यावहे', 'क्रुध्यन्ते', 'क्रुध्यध्वे', 'क्रुध्यामहे'],
        'lat_pas': ['क्रुध्यते', 'क्रुध्यसे', 'क्रुध्ये', 'क्रुध्येते', 'क्रुध्येथे', 'क्रुध्यावहे', 'क्रुध्यन्ते', 'क्रुध्यध्वे', 'क्रुध्यामहे'],
        'lan_par': ['अक्रुध्यत्', 'अक्रुध्यः', 'अक्रुध्यम्', 'अक्रुध्यताम्', 'अक्रुध्यतम्', 'अक्रुध्याव', 'अक्रुध्यन्', 'अक्रुध्यत', 'अक्रुध्याम'],
        'lan_atm': ['अक्रुध्यत', 'अक्रुध्यथाः', 'अक्रुध्ये', 'अक्रुध्येताम्', 'अक्रुध्येथाम्', 'अक्रुध्यावहि', 'अक्रुध्यन्त', 'अक्रुध्यध्वम्', 'अक्रुध्यामहि'],
        'lan_pas': ['अक्रुध्यत', 'अक्रुध्यथाः', 'अक्रुध्ये', 'अक्रुध्येताम्', 'अक्रुध्येथाम्', 'अक्रुध्यावहि', 'अक्रुध्यन्त', 'अक्रुध्यध्वम्', 'अक्रुध्यामहि'],
        'lot_par': ['क्रुध्यतु', 'क्रुध्य', 'क्रुध्यानि', 'क्रुध्यताम्', 'क्रुध्यतम्', 'क्रुध्याव', 'क्रुध्यन्तु', 'क्रुध्यत', 'क्रुध्याम'],
        'lot_atm': ['क्रुध्यताम्', 'क्रुध्यस्व', 'क्रुध्यै', 'क्रुध्येताम्', 'क्रुध्येथाम्', 'क्रुध्यावहै', 'क्रुध्यन्ताम्', 'क्रुध्यध्वम्', 'क्रुध्यामहै'],
        'lot_pas': ['क्रुध्यताम्', 'क्रुध्यस्व', 'क्रुध्यै', 'क्रुध्येताम्', 'क्रुध्येथाम्', 'क्रुध्यावहै', 'क्रुध्यन्ताम्', 'क्रुध्यध्वम्', 'क्रुध्यामहै'],
        'lit_par': ['चुक्रोध', 'चुक्रोधिथ', 'चुक्रोध', 'चुक्रुधतुः', 'चुक्रुधथुः', 'चुक्रुधिव', 'चुक्रुधुः', 'चुक्रुध', 'चुक्रुधिम'],
        'lit_atm': ['चुक्रुधे', 'चुक्रुधिषे', 'चुक्रुधे', 'चुक्रुधाते', 'चुक्रुधाथे', 'चुक्रुधिवहे', 'चुक्रुधिरे', 'चुक्रुधिध्वे', 'चुक्रुधिमहे'],
    },
    'man': { // think
        'lat_par': ['मन्यति', 'मन्यसि', 'मन्यामि', 'मन्यतः', 'मन्यथः', 'मन्यावः', 'मन्यन्ति', 'मन्यथ', 'मन्यामः'],
        'lat_atm': ['मन्यते', 'मन्यसे', 'मन्ये', 'मन्येते', 'मन्येथे', 'मन्यावहे', 'मन्यन्ते', 'मन्यध्वे', 'मन्यामहे'],
        'lat_pas': ['मन्यते', 'मन्यसे', 'मन्ये', 'मन्येते', 'मन्येथे', 'मन्यावहे', 'मन्यन्ते', 'मन्यध्वे', 'मन्यामहे'],
        'lan_par': ['अमन्यत्', 'अमन्यः', 'अमन्यम्', 'अमन्यताम्', 'अमन्यतम्', 'अमन्याव', 'अमन्यन्', 'अमन्यत', 'अमन्याम'],
        'lan_atm': ['अमन्यत', 'अमन्यथाः', 'अमन्ये', 'अमन्येताम्', 'अमन्येथाम्', 'अमन्यावहि', 'अमन्यन्त', 'अमन्यध्वम्', 'अमन्यामहि'],
        'lan_pas': ['अमन्यत', 'अमन्यथाः', 'अमन्ये', 'अमन्येताम्', 'अमन्येथाम्', 'अमन्यावहि', 'अमन्यन्त', 'अमन्यध्वम्', 'अमन्यामहि'],
        'lot_par': ['मन्यतु', 'मन्य', 'मन्यानि', 'मन्यताम्', 'मन्यतम्', 'मन्याव', 'मन्यन्तु', 'मन्यत', 'मन्याम'],
        'lot_atm': ['मन्यताम्', 'मन्यस्व', 'मन्यै', 'मन्येताम्', 'मन्येथाम्', 'मन्यावहै', 'मन्यन्ताम्', 'मन्यध्वम्', 'मन्यामहै'],
        'lot_pas': ['मन्यताम्', 'मन्यस्व', 'मन्यै', 'मन्येताम्', 'मन्येथाम्', 'मन्यावहै', 'मन्यन्ताम्', 'मन्यध्वम्', 'मन्यामहै'],
        'lit_par': ['ममान', 'मेनिथ-ममन्थ', 'ममान-ममन', 'मेनतुः', 'मेनथुः', 'मेनिव', 'मेनुः', 'मेन', 'मेनिम'],
        'lit_atm': ['मेने', 'मेनिषे', 'मेने', 'मेनाते', 'मेनाथे', 'मेनिवहे', 'मेनिरे', 'मेनिध्वे', 'मेनिमहे'],
    },
    'nft': { // dance
        'lat_par': ['नृत्यति', 'नृत्यसि', 'नृत्यामि', 'नृत्यतः', 'नृत्यथः', 'नृत्यावः', 'नृत्यन्ति', 'नृत्यथ', 'नृत्यामः'],
        'lat_pas': ['नृत्यते', 'नृत्यसे', 'नृत्ये', 'नृत्येते', 'नृत्येथे', 'नृत्यावहे', 'नृत्यन्ते', 'नृत्यध्वे', 'नृत्यामहे'],
        'lan_par': ['अनृत्यत्', 'अनृत्यः', 'अनृत्यम्', 'अनृत्यताम्', 'अनृत्यतम्', 'अनृत्याव', 'अनृत्यन्', 'अनृत्यत', 'अनृत्याम'],
        'lan_pas': ['अनृत्यत', 'अनृत्यथाः', 'अनृत्ये', 'अनृत्येताम्', 'अनृत्येथाम्', 'अनृत्यावहि', 'अनृत्यन्त', 'अनृत्यध्वम्', 'अनृत्यामहि'],
        'lot_par': ['नृत्यतु', 'नृत्य', 'नृत्यानि', 'नृत्यताम्', 'नृत्यतम्', 'नृत्याव', 'नृत्यन्तु', 'नृत्यत', 'नृत्याम'],
        'lot_pas': ['नृत्यताम्', 'नृत्यस्व', 'नृत्यै', 'नृत्येताम्', 'नृत्येथाम्', 'नृत्यावहै', 'नृत्यन्ताम्', 'नृत्यध्वम्', 'नृत्यामहै'],
        'lit_par': ['ननर्त', 'ननर्तिथ', 'ननर्त', 'ननृततुः', 'ननृतथुः', 'ननृतिव', 'ननृतुः', 'ननृत', 'ननृतिम'],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
