//
var utils = require('../utils');
var conj = 'five'; // su-class, tan-class

var tests = {
    'su': { // press
        'lat_par': ['सुनोति', 'सुनोषि', 'सुनोमि', 'सुनुतः', 'सुनुथः', 'सुन्वः-सुनुवः', 'सुन्वन्ति', 'सुनुथ', 'सुन्मः-सुनुमः'],
        'lat_atm': ['सुनुते', 'सुनुषे', 'सुन्वे', 'सुन्वाते', 'सुन्वाथे', 'सुन्वहे-सुनुवहे', 'सुन्वते', 'सुनुध्वे', 'सुन्महे-सुनुमहे'],
        'lat_pas': ['सूयते', 'सूयसे', 'सूये', 'सूयेते', 'सूयेथे', 'सूयावहे', 'सूयन्ते', 'सूयध्वे', 'सूयामहे'],
        'lan_par': ['असुनोत्', 'असुनोः', 'असुनवम्', 'असुनुताम्', 'असुनुतम्', 'असुन्व-असुनुव', 'असुन्वन्', 'असुनुत', 'असुन्म-असुनुम'],
        'lan_atm': ['असुनुत', 'असुनुथाः', 'असुन्वि', 'असुन्वाताम्', 'असुन्वाथाम्', 'असुन्वहि-असुनुवहि', 'असुन्वत', 'असुनुध्वम्', 'असुन्महि-असुनुमहि'],
        'lan_pas': ['असूयत', 'असूयथाः', 'असूये', 'असूयेताम्', 'असूयेथाम्', 'असूयावहि', 'असूयन्त', 'असूयध्वम्', 'असूयामहि'],
        'lot_par': ['सुनोतु', 'सुनु', 'सुनवानि', 'सुनुताम्', 'सुनुतम्', 'सुनवाव', 'सुन्वन्तु', 'सुनुत', 'सुनवाम'],
        'lot_atm': ['सुनुताम्', 'सुनुष्व', 'सुनवै', 'सुन्वाताम्', 'सुन्वाथाम्', 'सुनवावहै', 'सुन्वताम्', 'सुनुध्वम्', 'सुनवामहै'],
        'lot_pas': ['सूयताम्', 'सूयस्व', 'सूयै', 'सूयेताम्', 'सूयेथाम्', 'सूयावहै', 'सूयन्ताम्', 'सूयध्वम्', 'सूयामहै'],

        // 'viDiliN_par': ['सुनुयात्', 'सुनुयाः', 'सुनुयाम्', 'सुनुयाताम्', 'सुनुयातम्', 'सुनुयाव', 'सुनुयुः', 'सुनुयात', 'सुनुयाम'],
        // 'viD_atm': ['सुन्वीत', 'सुन्वीथाः', 'सुन्वीय', 'सुन्वीयाताम्', 'सुन्वीयाथाम्', 'सुन्वीवहि', 'सुन्वीरन्', 'सुन्वीध्वम्', 'सुन्वीमहि'],
        // 'viD_pas': ['सूयेत', 'सूयेथाः', 'सूयेय', 'सूयेयाताम्', 'सूयेयाथाम्', 'सूयेवहि', 'सूयेरन्', 'सूयेध्वम्', 'सूयेमहि'],
        // 'rut_par': ['सोष्यति-सविष्यति', 'सोष्यसि-सविष्यसि', 'सोष्यामि-सविष्यामि', 'सोष्यतः-सविष्यतः', 'सोष्यथः-सविष्यथः', 'सोष्यावः-सविष्यावः', 'सोष्यन्ति-सविष्यन्ति', 'सोष्यथ-सविष्यथ', 'सोष्यामः-सविष्यामः'],
        // 'rut_atm': ['	सोष्यते-सविष्यते', 'सोष्यसे-सविष्यसे', 'सोष्ये-सविष्ये', 'सोष्येते-सविष्येते', 'सोष्येथे-सविष्येथे', 'सोष्यावहे-सविष्यावहे', 'सोष्यन्ते-सविष्यन्ते', 'सोष्यध्वे-सविष्यध्वे', 'सोष्यामहे-सविष्यामहे'],
        // 'lut_par': ['सोता-सविता', 'सोतासि-सवितासि', 'सोतास्मि-सवितास्मि', 'सोतारौ-सवितारौ', 'सोतास्थः-सवितास्थः', 'सोतास्वः-सवितास्वः', 'सोतारः-सवितारः', 'सोतास्थ-सवितास्थ', 'सोतास्मः-सवितास्मः'],
        // 'rut_par': ['', '', '', '', '', '', '', '', ''],
        // 'rut_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lut_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },

    'Ap': { // obtain
        'lat_par': ['आप्नोति', 'आप्नोषि', 'आप्नोमि', 'आप्नुतः', 'आप्नुथः', 'आप्नुवः', 'आप्नुवन्ति', 'आप्नुथ', 'आप्नुमः'],
        'lat_pas': ['आप्यते', 'आप्यसे', 'आप्ये', 'आप्येते', 'आप्येथे', 'आप्यावहे', 'आप्यन्ते', 'आप्यध्वे', 'आप्यामहे'],
        'lan_par': ['आप्नोत्', 'आप्नोः', 'आप्नवम्', 'आप्नुताम्', 'आप्नुतम्', 'आप्नुव', 'आप्नुवन्', 'आप्नुत', 'आप्नुम'],
        'lan_pas': ['आप्यत', 'आप्यथाः', 'आप्ये', 'आप्येताम्', 'आप्येथाम्', 'आप्यावहि', 'आप्यन्त', 'आप्यध्वम्', 'आप्यामहि'],
        'lot_par': ['आप्नोतु', 'आप्नुहि', 'आप्नवानि', 'आप्नुताम्', 'आप्नुतम्', 'आप्नवाव', 'आप्नुवन्तु', 'आप्नुत', 'आप्नवाम'],
        'lot_pas': ['आप्यताम्', 'आप्यस्व', 'आप्यै', 'आप्येताम्', 'आप्येथाम्', 'आप्यावहै', 'आप्यन्ताम्', 'आप्यध्वम्', 'आप्यामहै'],
        'lit_par': ['आप', 'आपिथ', 'आप', 'आपतुः', 'आपथुः', 'आपिव', 'आपुः', 'आप', 'आपिम'],
    },

    'Sak': { // to be able
        'lat_par': ['शक्नोति', 'शक्नोषि', 'शक्नोमि', 'शक्नुतः', 'शक्नुथः', 'शक्नुवः', 'शक्नुवन्ति', 'शक्नुथ', 'शक्नुमः'],
        'lat_pas': ['शक्यते', 'शक्यसे', 'शक्ये', 'शक्येते', 'शक्येथे', 'शक्यावहे', 'शक्यन्ते', 'शक्यध्वे', 'शक्यामहे'],
        'lan_par': ['अशक्नोत्', 'अशक्नोः', 'अशक्नवम्', 'अशक्नुताम्', 'अशक्नुतम्', 'अशक्नुव', 'अशक्नुवन्', 'अशक्नुत', 'अशक्नुम'],
        'lan_pas': ['अशक्यत', 'अशक्यथाः', 'अशक्ये', 'अशक्येताम्', 'अशक्येथाम्', 'अशक्यावहि', 'अशक्यन्त', 'अशक्यध्वम्', 'अशक्यामहि'],
        'lot_par': ['शक्नोतु', 'शक्नुहि', 'शक्नवानि', 'शक्नुताम्', 'शक्नुतम्', 'शक्नवाव', 'शक्नुवन्तु', 'शक्नुत', 'शक्नवाम'],
        'lot_pas': ['शक्यताम्', 'शक्यस्व', 'शक्यै', 'शक्येताम्', 'शक्येथाम्', 'शक्यावहै', 'शक्यन्ताम्', 'शक्यध्वम्', 'शक्यामहै'],
        'lit_par': ['शशाक', 'शेकिथ-शशक्थ', 'शशाक-शशक', 'शेकतुः', 'शेकथुः', 'शेकिव', 'शेकुः', 'शेक', 'शेकिम'],
    },

    'ci': { // collect
        'lat_par': ['चिनोति', 'चिनोषि', 'चिनोमि', 'चिनुतः', 'चिनुथः', 'चिन्वः-चिनुवः', 'चिन्वन्ति', 'चिनुथ', 'चिन्मः-चिनुमः'],
        'lat_atm': ['चिनुते', 'चिनुषे', 'चिन्वे', 'चिन्वाते', 'चिन्वाथे', 'चिन्वहे-चिनुवहे', 'चिन्वते', 'चिनुध्वे', 'चिन्महे-चिनुमहे'],
        'lat_pas': ['चीयते', 'चीयसे', 'चीये', 'चीयेते', 'चीयेथे', 'चीयावहे', 'चीयन्ते', 'चीयध्वे', 'चीयामहे'],
        'lan_par': ['अचिनोत्', 'अचिनोः', 'अचिनवम्', 'अचिनुताम्', 'अचिनुतम्', 'अचिन्व-अचिनुव', 'अचिन्वन्', 'अचिनुत', 'अचिन्म-अचिनुम'],
        'lan_atm': ['अचिनुत', 'अचिनुथाः', 'अचिन्वि', 'अचिन्वाताम्', 'अचिन्वाथाम्', 'अचिन्वहि-अचिनुवहि', 'अचिन्वत', 'अचिनुध्वम्', 'अचिन्महि-अचिनुमहि'],
        'lan_pas': ['अचीयत', 'अचीयथाः', 'अचीये', 'अचीयेताम्', 'अचीयेथाम्', 'अचीयावहि', 'अचीयन्त', 'अचीयध्वम्', 'अचीयामहि'],
        'lot_par': ['चिनोतु', 'चिनु', 'चिनवानि', 'चिनुताम्', 'चिनुतम्', 'चिनवाव', 'चिन्वन्तु', 'चिनुत', 'चिनवाम'],
        'lot_atm': ['चिनुताम्', 'चिनुष्व', 'चिनवै', 'चिन्वाताम्', 'चिन्वाथाम्', 'चिनवावहै', 'चिन्वताम्', 'चिनुध्वम्', 'चिनवामहै'],
        'lot_pas': ['चीयताम्', 'चीयस्व', 'चीयै', 'चीयेताम्', 'चीयेथाम्', 'चीयावहै', 'चीयन्ताम्', 'चीयध्वम्', 'चीयामहै'],
        'lit_par': ['चिकाय', 'चिकेथ-चिकयिथ', 'चिकाय-चिकय', 'चिक्यतुः', 'चिक्यथुः', 'चिक्यिव', 'चिक्युः', 'चिक्य', 'चिक्यिम'],
        'lit_atm': ['चिक्ये', 'चिक्यिषे', 'चिक्ये', 'चिक्याते', 'चिक्याथे', 'चिक्यिवहे', 'चिक्यिरे', 'चिक्यिध्वे', 'चिक्यिमहे'],
    },
    // FIXME: five_Sru_lot_par - много ошибок
    'Sru': { // listen, learn
        'lat_par': ['शृणोति', 'शृणोषि', 'शृणोमि', 'शृणुतः', 'शृणुथः', 'शृण्वः-शृणुवः', 'शृण्वन्ति', 'शृणुथ', 'शृण्मः-शृणुमः'],
        'lat_pas': ['श्रूयते', 'श्रूयसे', 'श्रूये', 'श्रूयेते', 'श्रूयेथे', 'श्रूयावहे', 'श्रूयन्ते', 'श्रूयध्वे', 'श्रूयामहे'],
        'lan_par': ['अशृणोत्', 'अशृणोः', 'अशृणवम्', 'अशृणुताम्', 'अशृणुतम्', 'अशृण्व-अशृणुव', 'अशृण्वन्', 'अशृणुत', 'अशृण्म-अशृणुम'],
        'lan_pas': ['अश्रूयत', 'अश्रूयथाः', 'अश्रूये', 'अश्रूयेताम्', 'अश्रूयेथाम्', 'अश्रूयावहि', 'अश्रूयन्त', 'अश्रूयध्वम्', 'अश्रूयामहि'],
        'lot_par': ['शृणोतु', 'श्रुधि-शृणु', 'शृणवानि', 'शृणुताम्', 'शृणुतम्', 'शृणवाव', 'शृण्वन्तु', 'शृणुत', 'शृणवाम'],
        'lot_pas': ['श्रूयताम्', 'श्रूयस्व', 'श्रूयै', 'श्रूयेताम्', 'श्रूयेथाम्', 'श्रूयावहै', 'श्रूयन्ताम्', 'श्रूयध्वम्', 'श्रूयामहै'],
        'lit_par': ['शुश्राव', 'शुश्रोथ', 'शुश्राव-शुश्रव', 'शुश्रुवतुः', 'शुश्रुवथुः', 'शुश्रुव', 'शुश्रुवुः', 'शुश्रुव', 'शुश्रुम'],
    },

    'aS': { // eat, enjoy
        'lat_atm': ['अश्नुते', 'अश्नुषे', 'अश्नुवे', 'अश्नुवाते', 'अश्नुवाथे', 'अश्नुवहे', 'अश्नुवते', 'अश्नुध्वे', 'अश्नुमहे'],
        'lat_pas': ['अश्यते', 'अश्यसे', 'अश्ये', 'अश्येते', 'अश्येथे', 'अश्यावहे', 'अश्यन्ते', 'अश्यध्वे', 'अश्यामहे'],
        'lan_atm': ['आश्नुत', 'आश्नुथाः', 'आश्नुवि', 'आश्नुवाताम्', 'आश्नुवाथाम्', 'आश्नुवहि', 'आश्नुवत', 'आश्नुध्वम्', 'आश्नुमहि'],
        'lan_pas': ['आश्यत', 'आश्यथाः', 'आश्ये', 'आश्येताम्', 'आश्येथाम्', 'आश्यावहि', 'आश्यन्त', 'आश्यध्वम्', 'आश्यामहि'],
        'lot_atm': ['अश्नुताम्', 'अश्नुष्व', 'अश्नवै', 'अश्नुवाताम्', 'अश्नुवाथाम्', 'अश्नवावहै', 'अश्नुवताम्', 'अश्नुध्वम्', 'अश्नवामहै'],
        'lot_pas': ['अश्यताम्', 'अश्यस्व', 'अश्यै', 'अश्येताम्', 'अश्येथाम्', 'अश्यावहै', 'अश्यन्ताम्', 'अश्यध्वम्', 'अश्यामहै'],
        //'lit_par': ['आनशे', 'आनशिषे', 'आनशे', 'आनशाते', 'आनशाथे', 'आनशिवहे', 'आनशिरे', 'आनशिध्वे', 'आनशिमहे'], // FIXME: inria.fr
        'lit_par': ['आश', 'आशिथ', 'आश', 'आशतुः', 'आशथुः', 'आशिव', 'आशुः', 'आश', 'आशिम'],

    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        //'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        //'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
