//
var utils = require('../utils');
var conj = 'nine';

var tests = {
    'krI': { // buy
        'lat_par': ['क्रीणाति', 'क्रीणासि', 'क्रीणामि', 'क्रीणीतः', 'क्रीणीथः', 'क्रीणीवः', 'क्रीणन्ति', 'क्रीणीथ', 'क्रीणीमः'],
        'lat_atm': ['क्रीणीते', 'क्रीणीषे', 'क्रीणे', 'क्रीणाते', 'क्रीणाथे', 'क्रीणीवहे', 'क्रीणते', 'क्रीणीध्वे', 'क्रीणीमहे'],
        'lat_pas': ['क्रीयते', 'क्रीयसे', 'क्रीये', 'क्रीयेते', 'क्रीयेथे', 'क्रीयावहे', 'क्रीयन्ते', 'क्रीयध्वे', 'क्रीयामहे'],
        'lan_par': ['अक्रीणात्', 'अक्रीणाः', 'अक्रीणाम्', 'अक्रीणीताम्', 'अक्रीणीतम्', 'अक्रीणीव', 'अक्रीणन्', 'अक्रीणीत', 'अक्रीणीम'],
        'lan_atm': ['अक्रीणीत', 'अक्रीणीथाः', 'अक्रीणि', 'अक्रीणाताम्', 'अक्रीणाथाम्', 'अक्रीणीवहि', 'अक्रीणत', 'अक्रीणीध्वम्', 'अक्रीणीमहि'],
        'lan_pas': ['अक्रीयत', 'अक्रीयथाः', 'अक्रीये', 'अक्रीयेताम्', 'अक्रीयेथाम्', 'अक्रीयावहि', 'अक्रीयन्त', 'अक्रीयध्वम्', 'अक्रीयामहि'],
        'lot_par': ['क्रीणातु', 'क्रीणीहि', 'क्रीणानि', 'क्रीणीताम्', 'क्रीणीतम्', 'क्रीणाव', 'क्रीणन्तु', 'क्रीणीत', 'क्रीणाम'],
        'lot_atm': ['क्रीणीताम्', 'क्रीणीष्व', 'क्रीणै', 'क्रीणाताम्', 'क्रीणाथाम्', 'क्रीणावहै', 'क्रीणताम्', 'क्रीणीध्वम्', 'क्रीणामहै'],
        'lot_pas': ['क्रीयताम्', 'क्रीयस्व', 'क्रीयै', 'क्रीयेताम्', 'क्रीयेथाम्', 'क्रीयावहै', 'क्रीयन्ताम्', 'क्रीयध्वम्', 'क्रीयामहै'],
        'lit_par': ['चिक्राय', 'चिक्रेथ-चिक्रयिथ', 'चिक्राय-चिक्रय', 'चिक्रियतुः', 'चिक्रियथुः', 'चिक्रियिव', 'चिक्रियुः', 'चिक्रिय', 'चिक्रियिम'],
        'lit_atm': ['चिक्रिये', 'चिक्रियिषे', 'चिक्रिये', 'चिक्रियाते', 'चिक्रियाथे', 'चिक्रियिवहे', 'चिक्रियिरे', 'चिक्रियिध्वे', 'चिक्रियिमहे'],
    },
    // jA - to know - нет в MW, FIXME:, есть, это jYA !
    'pU': { // clarify
        'lat_par': ['पुनाति', 'पुनासि', 'पुनामि', 'पुनीतः', 'पुनीथः', 'पुनीवः', 'पुनन्ति', 'पुनीथ', 'पुनीमः'],
        'lat_atm': ['पुनीते', 'पुनीषे', 'पुने', 'पुनाते', 'पुनाथे', 'पुनीवहे', 'पुनते', 'पुनीध्वे', 'पुनीमहे'],
        'lat_pas': ['पूयते', 'पूयसे', 'पूये', 'पूयेते', 'पूयेथे', 'पूयावहे', 'पूयन्ते', 'पूयध्वे', 'पूयामहे'],
        'lan_par': ['अपुनात्', 'अपुनाः', 'अपुनाम्', 'अपुनीताम्', 'अपुनीतम्', 'अपुनीव', 'अपुनन्', 'अपुनीत', 'अपुनीम'],
        'lan_atm': ['अपुनीत', 'अपुनीथाः', 'अपुनि', 'अपुनाताम्', 'अपुनाथाम्', 'अपुनीवहि', 'अपुनत', 'अपुनीध्वम्', 'अपुनीमहि'],
        'lan_pas': ['अपूयत', 'अपूयथाः', 'अपूये', 'अपूयेताम्', 'अपूयेथाम्', 'अपूयावहि', 'अपूयन्त', 'अपूयध्वम्', 'अपूयामहि'],
        'lot_par': ['पुनातु', 'पुनीहि', 'पुनानि', 'पुनीताम्', 'पुनीतम्', 'पुनाव', 'पुनन्तु', 'पुनीत', 'पुनाम'],
        'lot_atm': ['पुनीताम्', 'पुनीष्व', 'पुनै', 'पुनाताम्', 'पुनाथाम्', 'पुनावहै', 'पुनताम्', 'पुनीध्वम्', 'पुनामहै'],
        'lot_pas': ['पूयताम्', 'पूयस्व', 'पूयै', 'पूयेताम्', 'पूयेथाम्', 'पूयावहै', 'पूयन्ताम्', 'पूयध्वम्', 'पूयामहै'],
        'lit_par': ['पुपाव', 'पुपोथ-पुपविथ', 'पुपाव-पुपव', 'पुपुवतुः', 'पुपुवथुः', 'पुपुव', 'पुपुवुः', 'पुपुव', 'पुपुम'],
        'lit_atm': ['पुपुवे', 'पुपुषे', 'पुपुवे', 'पुपुवाते', 'पुपुवाथे', 'पुपुवहे', 'पुपुविरे', 'पुपुध्वे', 'पुपुमहे'],
    },
    // gfh - нет значения MW
    'banD': { // bind
        'lat_par': ['बध्नाति', 'बध्नासि', 'बध्नामि', 'बध्नीतः', 'बध्नीथः', 'बध्नीवः', 'बध्नन्ति', 'बध्नीथ', 'बध्नीमः'],
        'lat_pas': ['बध्यते', 'बध्यसे', 'बध्ये', 'बध्येते', 'बध्येथे', 'बध्यावहे', 'बध्यन्ते', 'बध्यध्वे', 'बध्यामहे'],
        'lan_par': ['अबध्नात्', 'अबध्नाः', 'अबध्नाम्', 'अबध्नीताम्', 'अबध्नीतम्', 'अबध्नीव', 'अबध्नन्', 'अबध्नीत', 'अबध्नीम'],
        'lan_pas': ['अबध्यत', 'अबध्यथाः', 'अबध्ये', 'अबध्येताम्', 'अबध्येथाम्', 'अबध्यावहि', 'अबध्यन्त', 'अबध्यध्वम्', 'अबध्यामहि'],
        'lot_par': ['बध्नातु', 'बधान', 'बध्नानि', 'बध्नीताम्', 'बध्नीतम्', 'बध्नाव', 'बध्नन्तु', 'बध्नीत', 'बध्नाम'],
        'lot_pas': ['बध्यताम्', 'बध्यस्व', 'बध्यै', 'बध्येताम्', 'बध्येथाम्', 'बध्यावहै', 'बध्यन्ताम्', 'बध्यध्वम्', 'बध्यामहै'],
        'lit_par': ['बबन्ध', 'बबन्धिथ', 'बबन्ध', 'बबन्धतुः', 'बबन्धथुः', 'बबन्धिव', 'बबन्धुः', 'बबन्ध', 'बबन्धिम'],
    },

    // FIXME: manT - churn, hurt - нет значения MW, важно - все forms
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
