//
var utils = require('../utils');
var conj = 'two';

// ad, i-go, As-sit, dviS-hate, duh-milk, lih-lick, rud-cry, vac-speak,
// irreg - W.621: yA, pA-protect, BhA
// W.626 ends in u - sTu, kṣṇu, yu, su-impel
// mfj, çī
//  īḍ and īç insert a union-vowel i
// rud weep, svap sleep, an breathe, and çvas blow insert a union-vowel i

var tests = {
    'ad': { // to eat
        'lat_par': ['अत्ति', 'अत्सि', 'अद्मि', 'अत्तः', 'अत्थः', 'अद्वः', 'अदन्ति', 'अत्थ', 'अद्मः'],
        'lat_pas': ['अद्यते', 'अद्यसे', 'अद्ये', 'अद्येते', 'अद्येथे', 'अद्यावहे', 'अद्यन्ते', 'अद्यध्वे', 'अद्यामहे'],
        'lan_par': ['आदत्', 'आदः', 'आदम्', 'आत्ताम्', 'आत्तम्', 'आद्व', 'आदन्', 'आत्त', 'आद्म'],
        'lan_pas': ['आद्यत', 'आद्यथाः', 'आद्ये', 'आद्येताम्', 'आद्येथाम्', 'आद्यावहि', 'आद्यन्त', 'आद्यध्वम्', 'आद्यामहि'],
        'lot_par': ['अत्तु', 'अद्धि', 'अदानि', 'अत्ताम्', 'अत्तम्', 'अदाव', 'अदन्तु', 'अत्त', 'अदाम'],
        'lot_pas': ['अद्यताम्', 'अद्यस्व', 'अद्यै', 'अद्येताम्', 'अद्येथाम्', 'अद्यावहै', 'अद्यन्ताम्', 'अद्यध्वम्', 'अद्यामहै'],
        'lit_par': ['आद', 'आदिथ', 'आद', 'आदतुः', 'आदथुः', 'आदिव', 'आदुः', 'आद', 'आदिम'],
    },
    'rud': { // cry
        'lat_par': ['रोदिति', 'रोदिषि', 'रोदिमि', 'रुदितः', 'रुदिथः', 'रुदिवः', 'रुदन्ति', 'रुदिथ', 'रुदिमः'],
        'lat_pas': ['रुद्यते', 'रुद्यसे', 'रुद्ये', 'रुद्येते', 'रुद्येथे', 'रुद्यावहे', 'रुद्यन्ते', 'रुद्यध्वे', 'रुद्यामहे'],
        'lan_par': ['अरोदीत्-अरोदत्', 'अरोदीः-अरोदः', 'अरोदम्', 'अरुदिताम्', 'अरुदितम्', 'अरुदिव', 'अरुदन्', 'अरुदित', 'अरुदिम'],
        'lan_pas': ['अरुद्यत', 'अरुद्यथाः', 'अरुद्ये', 'अरुद्येताम्', 'अरुद्येथाम्', 'अरुद्यावहि', 'अरुद्यन्त', 'अरुद्यध्वम्', 'अरुद्यामहि'],
        'lot_par': ['रोदितु', 'रुदिहि', 'रोदानि', 'रुदिताम्', 'रुदितम्', 'रोदाव', 'रुदन्तु', 'रुदित', 'रोदाम'],
        'lot_pas': ['रुद्यताम्', 'रुद्यस्व', 'रुद्यै', 'रुद्येताम्', 'रुद्येथाम्', 'रुद्यावहै', 'रुद्यन्ताम्', 'रुद्यध्वम्', 'रुद्यामहै'],
        'lit_par': ['रुरोद', 'रुरोदिथ', 'रुरोद', 'रुरुदतुः', 'रुरुदथुः', 'रुरुदिव', 'रुरुदुः', 'रुरुद', 'रुरुदिम'],
    },

    'vac': { // speak
        'lat_par': ['वक्ति', 'वक्षि', 'वच्मि', 'वक्तः', 'वक्थः', 'वच्वः', 'वचन्ति', 'वक्थ', 'वच्मः'],
        'lat_atm': ['वष्टे', 'वक्षे', 'वशे', 'वशाते', 'वशाथे', 'वश्वहे', 'वशते', 'वड्ढ्वे', 'वश्महे'],
        'lat_pas': ['उच्यते', 'उच्यसे', 'उच्ये', 'उच्येते', 'उच्येथे', 'उच्यावहे', 'उच्यन्ते', 'उच्यध्वे', 'उच्यामहे'],
        'lan_par': ['अवक्', 'अवक्', 'अवचम्', 'अवक्ताम्', 'अवक्तम्', 'अवच्व', 'अवचन्', 'अवक्त', 'अवच्म'],
        'lan_pas': ['औच्यत', 'औच्यथाः', 'औच्ये', 'औच्येताम्', 'औच्येथाम्', 'औच्यावहि', 'औच्यन्त', 'औच्यध्वम्', 'औच्यामहि'],
        'lot_par': ['वोचतु-वक्तु', 'वोचि-वग्धि', 'वचानि', 'वक्ताम्', 'वक्तम्', 'वचाव', 'वचन्तु', 'वक्त', 'वचाम'],
        //'lot_atm': ['', '', '', '', '', '', '', '', ''],
        'lot_pas': ['उच्यताम्', 'उच्यस्व', 'उच्यै', 'उच्येताम्', 'उच्येथाम्', 'उच्यावहै', 'उच्यन्ताम्', 'उच्यध्वम्', 'उच्यामहै'],
        'lit_par': ['उवाच', 'उवचिथ-उवक्थ', 'उवाच-उवच', 'ऊचतुः', 'ऊचथुः', 'ऊचिव', 'ऊचुः', 'ऊच', 'ऊचिम'],
    },

    'duh': { // to milk
        'lat_par': ['दोग्धि', 'दोक्षि', 'दोह्मि', 'दुग्धः', 'दुग्धः', 'दुह्वः', 'दुहन्ति', 'दुग्ध', 'दुह्मः'],
        'lat_atm': ['दुग्धे', 'दुक्षे', 'दुहे', 'दुहाते', 'दुहाथे', 'दुह्वहे', 'दुहते', 'दुग्ध्वे', 'दुह्महे'], // atm sg.3 = 'धुक्षे' = WTF?
        'lat_pas': ['दुह्यते', 'दुह्यसे', 'दुह्ये', 'दुह्येते', 'दुह्येथे', 'दुह्यावहे', 'दुह्यन्ते', 'दुह्यध्वे', 'दुह्यामहे'],
        'lan_par': ['अधोक्', 'अधोक्', 'अदोहम्', 'अदुग्धाम्', 'अदुग्धम्', 'अदुह्व', 'अदुहन्', 'अदुग्ध', 'अदुह्म'],
        'lan_atm': ['अदुग्ध', 'अदुग्धाः', 'अदुहि', 'अदुहाताम्', 'अदुहाथाम्', 'अदुह्वहि', 'अदुह्र-अदुहत', 'अदुग्ध्वम्', 'अदुह्महि'],
        'lan_pas': ['अदुह्यत', 'अदुह्यथाः', 'अदुह्ये', 'अदुह्येताम्', 'अदुह्येथाम्', 'अदुह्यावहि', 'अदुह्यन्त', 'अदुह्यध्वम्', 'अदुह्यामहि'],
        'lot_par': ['दोग्धु', 'दुग्धि', 'दोहानि', 'दुग्धाम्', 'दुग्धम्', 'दोहाव', 'दुहन्तु', 'दुग्ध', 'दोहाम'],
        'lot_atm': ['दुग्धाम्', 'धुक्ष्व', 'दोहै', 'दुहाताम्', 'दुहाथाम्', 'दोहावहै', 'दुहताम्', 'दुग्ध्वम्', 'दोहामहै'],
        'lot_pas': ['दुह्यताम्', 'दुह्यस्व', 'दुह्यै', 'दुह्येताम्', 'दुह्येथाम्', 'दुह्यावहै', 'दुह्यन्ताम्', 'दुह्यध्वम्', 'दुह्यामहै'],
        'lit_par': ['दुदोह', 'दुदोहिथ', 'दुदोह', 'दुदुहतुः', 'दुदुहथुः', 'दुदुहिव', 'दुदुहुः', 'दुदुह', 'दुदुहिम'],
        'lit_atm': ['दुदुहे', 'दुदुहिषे', 'दुदुहे', 'दुदुहाते', 'दुदुहाथे', 'दुदुहिवहे', 'दुदुहिरे', 'दुदुहिध्वे', 'दुदुहिमहे'],
    },

    'As': { // sit
        'lat_atm': ['आस्ते', 'आस्से', 'आसे', 'आसाते', 'आसाथे', 'आस्वहे', 'आसते', 'आस्ध्वे-आस्द्ध्वे', 'आस्महे'],
        'lat_pas': ['आस्यते', 'आस्यसे', 'आस्ये', 'आस्येते', 'आस्येथे', 'आस्यावहे', 'आस्यन्ते', 'आस्यध्वे', 'आस्यामहे'],
        'lan_atm': ['आस्त', 'आस्थाः', 'आसि', 'आसाताम्', 'आसाथाम्', 'आस्वहि', 'आसत', 'आस्ध्वम्-आस्द्ध्वम्', 'आस्महि'],
        'lan_pas': ['आस्यत', 'आस्यथाः', 'आस्ये', 'आस्येताम्', 'आस्येथाम्', 'आस्यावहि', 'आस्यन्त', 'आस्यध्वम्', 'आस्यामहि'],
        'lot_atm': ['आस्ताम्', 'आस्स्व', 'आसै', 'आसाताम्', 'आसाथाम्', 'आसावहै', 'आसताम्', 'आस्ध्वम्-आस्द्ध्वम्', 'आसामहै'],
        'lot_pas': ['आस्यताम्', 'आस्यस्व', 'आस्यै', 'आस्येताम्', 'आस्येथाम्', 'आस्यावहै', 'आस्यन्ताम्', 'आस्यध्वम्', 'आस्यामहै'],
        'lit_atm': ['आसे', 'आसिषे', 'आसे', 'आसाते', 'आसाथे', 'आसिवहे', 'आसिरे', 'आसिध्वे', 'आसिमहे'],
    },
    // == NOW
    'pA': { // protect W.621.
        'lat_par': ['पाति', 'पासि', 'पामि', 'पातः', 'पाथः', 'पावः', 'पान्ति', 'पाथ', 'पामः'],
        'lan_par': ['अपात्', 'अपाः', 'अपाम्', 'अपाताम्', 'अपातम्', 'अपाव', 'अपान्', 'अपात', 'अपाम'],
        'lot_par': ['पातु', 'पाहि', 'पानि', 'पाताम्', 'पातम्', 'पाव', 'पान्तु', 'पात', 'पाम'],
        'lit_par': ['पपौ', 'पपिथ-पपाथ', 'पपौ', 'पपतुः', 'पपथुः', 'पपिव', 'पपुः', 'पप', 'पपिम'],
    },

    'yA': { // go
        'lat_par': ['याति', 'यासि', 'यामि', 'यातः', 'याथः', 'यावः', 'यान्ति', 'याथ', 'यामः'],
        'lat_pas': ['ईयते', 'ईयसे', 'ईये', 'ईयेते', 'ईयेथे', 'ईयावहे', 'ईयन्ते', 'ईयध्वे', 'ईयामहे'],
        'lan_par': ['अयात्', 'अयाः', 'अयाम्', 'अयाताम्', 'अयातम्', 'अयाव', 'अयान्', 'अयात', 'अयाम'],
        'lan_pas': ['ऐयत', 'ऐयथाः', 'ऐये', 'ऐयेताम्', 'ऐयेथाम्', 'ऐयावहि', 'ऐयन्त', 'ऐयध्वम्', 'ऐयामहि'],
        'lot_par': ['यातु', 'याहि', 'यानि', 'याताम्', 'यातम्', 'याव', 'यान्तु', 'यात', 'याम'],
        'lot_pas': ['ईयताम्', 'ईयस्व', 'ईयै', 'ईयेताम्', 'ईयेथाम्', 'ईयावहै', 'ईयन्ताम्', 'ईयध्वम्', 'ईयामहै'],
        'lit_par': ['ययौ', 'ययिथ-ययाथ', 'ययौ', 'ययतुः', 'ययथुः', 'ययिव', 'ययुः', 'यय', 'ययिम'],
    },

    'lih': { // lick
        'lat_par': ['लेढि', 'लेक्षि', 'लेह्मि', 'लीढः', 'लीढः', 'लिह्वः', 'लिहन्ति', 'लीढ', 'लिह्मः'],
        'lat_atm': ['लीढे', 'लिक्षे', 'लिहे', 'लिहाते', 'लिहाथे', 'लिह्वहे', 'लिहते', 'लीढ्वे', 'लिह्महे'],
        'lat_pas': ['लिह्यते', 'लिह्यसे', 'लिह्ये', 'लिह्येते', 'लिह्येथे', 'लिह्यावहे', 'लिह्यन्ते', 'लिह्यध्वे', 'लिह्यामहे'],
        'lan_par': ['अलेट्', 'अलेट्', 'अलेहम्', 'अलीढाम्', 'अलीढम्', 'अलिह्व', 'अलिहन्', 'अलीढ', 'अलिह्म'],
        'lan_atm': ['अलीढ', 'अलीढाः', 'अलिहि', 'अलिहाताम्', 'अलिहाथाम्', 'अलिह्वहि', 'अलिहत', 'अलीढ्वम्', 'अलिह्महि'],
        'lan_pas': ['अलिह्यत', 'अलिह्यथाः', 'अलिह्ये', 'अलिह्येताम्', 'अलिह्येथाम्', 'अलिह्यावहि', 'अलिह्यन्त', 'अलिह्यध्वम्', 'अलिह्यामहि'],
        'lot_par': ['लेढु', 'लीढि', 'लेहानि', 'लीढाम्', 'लीढम्', 'लेहाव', 'लिहन्तु', 'लीढ', 'लेहाम'],
        'lot_atm': ['लीढाम्', 'लिक्ष्व', 'लेहै', 'लिहाताम्', 'लिहाथाम्', 'लेहावहै', 'लिहताम्', 'लीढ्वम्', 'लेहामहै'],
        'lot_pas': ['लिह्यताम्', 'लिह्यस्व', 'लिह्यै', 'लिह्येताम्', 'लिह्येथाम्', 'लिह्यावहै', 'लिह्यन्ताम्', 'लिह्यध्वम्', 'लिह्यामहै'],
        'lit_par': ['लिलेह', 'लिलेहिथ', 'लिलेह', 'लिलिहतुः', 'लिलिहथुः', 'लिलिहिव', 'लिलिहुः', 'लिलिह', 'लिलिहिम'],
        'lit_atm': ['लिलिहे', 'लिलिहिषे', 'लिलिहे', 'लिलिहाते', 'लिलिहाथे', 'लिलिहिवहे', 'लिलिहिरे', 'लिलिहिध्वे', 'लिलिहिमहे'],
    },
    'nu': { // praise
        'lat_par': ['नौति', 'नौषि', 'नौमि', 'नुतः', 'नुथः', 'नुवः', 'नुवन्ति', 'नुथ', 'नुमः'],
        'lat_atm': ['नुते', 'नुषे', 'नुवे', 'नुवाते', 'नुवाथे', 'नुवहे', 'नुवते', 'नुध्वे', 'नुमहे'],
        'lat_pas': ['नूयते', 'नूयसे', 'नूये', 'नूयेते', 'नूयेथे', 'नूयावहे', 'नूयन्ते', 'नूयध्वे', 'नूयामहे'],
        'lan_par': ['अनौत्', 'अनौः', 'अनवम्', 'अनुताम्', 'अनुतम्', 'अनुव', 'अनुवन्', 'अनुत', 'अनुम'],
        'lan_atm': ['अनुत', 'अनुथाः', 'अनुवि', 'अनुवाताम्', 'अनुवाथाम्', 'अनुवहि', 'अनुवत', 'अनुध्वम्', 'अनुमहि'],
        'lan_pas': ['अनूयत', 'अनूयथाः', 'अनूये', 'अनूयेताम्', 'अनूयेथाम्', 'अनूयावहि', 'अनूयन्त', 'अनूयध्वम्', 'अनूयामहि'],
        'lot_par': ['नौतु', 'नुहि', 'नवानि', 'नुताम्', 'नुतम्', 'नवाव', 'नुवन्तु', 'नुत', 'नवाम'],
        'lot_atm': ['नुताम्', 'नुष्व', 'नवै', 'नुवाताम्', 'नुवाथाम्', 'नवावहै', 'नुवताम्', 'नुध्वम्', 'नवामहै'],
        'lot_pas': ['नूयताम्', 'नूयस्व', 'नूयै', 'नूयेताम्', 'नूयेथाम्', 'नूयावहै', 'नूयन्ताम्', 'नूयध्वम्', 'नूयामहै'],
        'lit_par': ['नुनाव', 'नुनोथ-नुनविथ', 'नुनाव-नुनव', 'नुनुवतुः', 'नुनुवथुः', 'नुनुव', 'नुनुवुः', 'नुनुव', 'नुनुम'],
        'lit_atm': ['नुनुवे', 'नुनुषे', 'नुनुवे', 'नुनुवाते', 'नुनुवाथे', 'नुनुवहे', 'नुनुविरे', 'नुनुध्वे', 'नुनुमहे'],
    },

    'vid': { // know
        'lat_par': ['वेत्ति', 'वेत्सि', 'वेद्मि', 'वित्तः', 'वित्थः', 'विद्वः', 'विदन्ति', 'वित्थ', 'विद्मः'],
        'lat_pas': ['विद्यते', 'विद्यसे', 'विद्ये', 'विद्येते', 'विद्येथे', 'विद्यावहे', 'विद्यन्ते', 'विद्यध्वे', 'विद्यामहे'],
        'lan_par': ['अवेत्', 'अवेत्', 'अवेदम्', 'अवित्ताम्', 'अवित्तम्', 'अविद्व', 'अविदन्', 'अवित्त', 'अविद्म'],
        'lan_pas': ['अविद्यत', 'अविद्यथाः', 'अविद्ये', 'अविद्येताम्', 'अविद्येथाम्', 'अविद्यावहि', 'अविद्यन्त', 'अविद्यध्वम्', 'अविद्यामहि'],
        'lot_par': ['वेत्तु', 'विद्धि', 'वेदानि', 'वित्ताम्', 'वित्तम्', 'वेदाव', 'विदन्तु', 'वित्त', 'वेदाम'],
        'lot_pas': ['विद्यताम्', 'विद्यस्व', 'विद्यै', 'विद्येताम्', 'विद्येथाम्', 'विद्यावहै', 'विद्यन्ताम्', 'विद्यध्वम्', 'विद्यामहै'],
        'lit_par': ['वेद', 'वेत्थ', 'वेद', 'वित्तुः', 'वित्थुः', 'विद्व', 'विदुः', 'विद', 'विद्म'],
    },
    'i': { // go
        'lat_par': ['एति', 'एषि', 'एमि', 'इतः', 'इथः', 'इवः', 'यन्ति', 'इथ', 'इमः'],
        'lat_atm': ['इते', 'इषे', 'इये', 'इयाते', 'इयाथे', 'इवहे', 'इयते', 'इध्वे', 'इमहे'],
        'lat_pas': ['ईयते', 'ईयसे', 'ईये', 'ईयेते', 'ईयेथे', 'ईयावहे', 'ईयन्ते', 'ईयध्वे', 'ईयामहे'],
        'lan_par': ['ऐत्', 'ऐः', 'आयम्', 'ऐताम्', 'ऐतम्', 'ऐव', 'आयन्', 'ऐत', 'ऐम'],
        'lan_atm': ['ऐत', 'ऐथाः', 'ऐयि', 'अयाताम्', 'अयाथाम्', 'ऐवहि', 'ऐयत', 'ऐध्वम्', 'ऐमहि'],
        'lan_pas': ['ऐयत', 'ऐयथाः', 'ऐये', 'ऐयेताम्', 'ऐयेथाम्', 'ऐयावहि', 'ऐयन्त', 'ऐयध्वम्', 'ऐयामहि'],
        'lot_par': ['एतु', 'इहि', 'अयानि', 'इताम्', 'इतम्', 'अयाव', 'यन्तु', 'इत', 'अयाम'],
        'lot_atm': ['इताम्', 'इष्व', 'अयै', 'याताम्', 'याथाम्', 'अयावहै', 'यताम्', 'इध्वम्', 'अयामहै'],
        'lot_pas': ['ईयताम्', 'ईयस्व', 'ईयै', 'ईयेताम्', 'ईयेथाम्', 'ईयावहै', 'ईयन्ताम्', 'ईयध्वम्', 'ईयामहै'],
        'lit_par': ['इयाय', 'इयेथ-इययिथ', 'इयाय-इयय', 'ईयतुः', 'ईयथुः', 'ईय्व', 'ईयुः', 'ईय', 'ईय्म'],
        'lit_atm': ['ईये', 'ईय्से', 'ईये', 'ईयाते', 'ईयाथे', 'ईय्वहे', 'ईयिरे', 'ईय्ध्वे', 'ईय्महे'],
    },

    'svap': { // sleep
        'lat_par': ['स्वपिति', 'स्वपिषि', 'स्वपिमि', 'स्वपितः', 'स्वपिथः', 'स्वपिवः', 'स्वपन्ति', 'स्वपिथ', 'स्वपिमः'],
        'lat_pas': ['सुप्यते', 'सुप्यसे', 'सुप्ये', 'सुप्येते', 'सुप्येथे', 'सुप्यावहे', 'सुप्यन्ते', 'सुप्यध्वे', 'सुप्यामहे'],
        'lan_par': ['अस्वपीत्-अस्वपत्', 'अस्वपीः-अस्वपः', 'अस्वपम्', 'अस्वपिताम्', 'अस्वपितम्', 'अस्वपिव', 'अस्वपन्', 'अस्वपित', 'अस्वपिम'],
        'lan_pas': ['असुप्यत', 'असुप्यथाः', 'असुप्ये', 'असुप्येताम्', 'असुप्येथाम्', 'असुप्यावहि', 'असुप्यन्त', 'असुप्यध्वम्', 'असुप्यामहि'],
        'lot_par': ['स्वपितु', 'स्वपिहि', 'स्वपानि', 'स्वपिताम्', 'स्वपितम्', 'स्वपाव', 'स्वपन्तु', 'स्वपित', 'स्वपाम'],
        'lot_pas': ['सुप्यताम्', 'सुप्यस्व', 'सुप्यै', 'सुप्येताम्', 'सुप्येथाम्', 'सुप्यावहै', 'सुप्यन्ताम्', 'सुप्यध्वम्', 'सुप्यामहै'],
        'lit_par': ['सुष्वाप', 'सुष्वपिथ', 'सुष्वाप-सुष्वप', 'सुषुपतुः', 'सुषुपथुः', 'सुषुपिव', 'सुषुपुः', 'सुषुप', 'सुषुपिम'],
    },
    // 'as': { // be - FIXME: в terms?
    //     'lat_par': ['अस्ति', 'असि', 'अस्मि', 'स्तः', 'स्थः', 'स्वः', 'सन्ति', 'स्थ', 'स्मः'],
    //     'lat_atm': ['स्ते', 'से', 'हे', 'साते', 'साथे', 'स्वहे', 'सते', 'ध्वे', 'स्महे'],
    //     'lan_par': ['आसीत्', 'आसीः', 'आसम्', 'आस्ताम्', 'आस्तम्', 'आस्व', 'आसन्', 'आस्त', 'आस्म'],
    //     'lot_par': ['अस्तु', 'एधि', 'असानि', 'स्ताम्', 'स्तम्', 'असाव', 'सन्तु', 'स्त', 'असाम'],
    //     'lit_par': ['आस', 'आसिथ', 'आस', 'आसतुः', 'आसथुः', 'आसिव', 'आसुः', 'आस', 'आसिम'],
    // },

    // brU-ब्रू-speak;
    'brU': { // speak
        'lat_par': ['ब्रवीति', 'ब्रवीषि', 'ब्रूमि-ब्रवीमि', 'ब्रूतः', 'ब्रूथः', 'ब्रूवः', 'ब्रुवन्ति', 'ब्रूथ', 'ब्रूमः'],
        'lat_atm': ['ब्रूते', 'ब्रूषे', 'ब्रुवे', 'ब्रुवाते', 'ब्रुवाथे', 'ब्रूवहे', 'ब्रुवते', 'ब्रूध्वे', 'ब्रूमहे'],
        'lat_pas': ['ब्रूयते', 'ब्रूयसे', 'ब्रूये', 'ब्रूयेते', 'ब्रूयेथे', 'ब्रूयावहे', 'ब्रूयन्ते', 'ब्रूयध्वे', 'ब्रूयामहे'],
        'lan_par': ['अब्रवीत्', 'अब्रवीः', 'अब्रुवम्-अब्रवम्', 'अब्रूताम्', 'अब्रूतम्', 'अब्रूव', 'अब्रूवन्-अब्रुवन्', 'अब्रूत', 'अब्रूम'],
        'lan_atm': ['अब्रूत', 'अब्रूथाः', 'अब्रुवि', 'अब्रुवाताम्', 'अब्रुवाथाम्', 'अब्रूवहि', 'अब्रुवत', 'अब्रूध्वम्', 'अब्रूमहि'],
        'lan_pas': ['अब्रूयत', 'अब्रूयथाः', 'अब्रूये', 'अब्रूयेताम्', 'अब्रूयेथाम्', 'अब्रूयावहि', 'अब्रूयन्त', 'अब्रूयध्वम्', 'अब्रूयामहि'],
        'lot_par': ['ब्रवीतु', 'ब्रूहि-ब्रवीहि', 'ब्रवाणि', 'ब्रूताम्', 'ब्रूतम्', 'ब्रवाव', 'ब्रुवन्तु', 'ब्रूत', 'ब्रवाम'],
        'lot_atm': ['ब्रूताम्', 'ब्रूष्व', 'ब्रवै', 'ब्रुवाताम्', 'ब्रुवाथाम्', 'ब्रवावहै', 'ब्रुवताम्', 'ब्रूध्वम्', 'ब्रवामहै'],
        'lot_pas': ['ब्रूयताम्', 'ब्रूयस्व', 'ब्रूयै', 'ब्रूयेताम्', 'ब्रूयेथाम्', 'ब्रूयावहै', 'ब्रूयन्ताम्', 'ब्रूयध्वम्', 'ब्रूयामहै'], // остальных форм нет
        // 'lit_par': ['', '', '', '', '', '', '', '', ''], нет
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },

    '': { // han-हन्-kill
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
