//
var utils = require('../utils');
var gana = 'one';

/*
  lat - present
  lan - imperfect
  lot - imperative
  lit - perfect
*/
var tests = {
    'BU': { // be
        'lat_par': ['भवति', 'भवसि', 'भवामि', 'भवतः', 'भवथः', 'भवावः', 'भवन्ति', 'भवथ', 'भवामः'],
        'lat_pas': ['भूयते', 'भूयसे', 'भूये', 'भूयेते', 'भूयेथे', 'भूयावहे', 'भूयन्ते', 'भूयध्वे', 'भूयामहे'],
        'lan_par': ['अभवत्', 'अभवः', 'अभवम्', 'अभवताम्', 'अभवतम्', 'अभवाव', 'अभवन्', 'अभवत', 'अभवाम'],
        'lan_pas': ['अभूयत', 'अभूयथाः', 'अभूये', 'अभूयेताम्', 'अभूयेथाम्', 'अभूयावहि', 'अभूयन्त', 'अभूयध्वम्', 'अभूयामहि'],
        'lot_par': ['भवतु', 'भव', 'भवानि', 'भवताम्', 'भवतम्', 'भवाव', 'भवन्तु', 'भवत', 'भवाम'],
        'lot_pas': ['भूयताम्', 'भूयस्व', 'भूयै', 'भूयेताम्', 'भूयेथाम्', 'भूयावहै', 'भूयन्ताम्', 'भूयध्वम्', 'भूयामहै'],
        'lit_par': ['बभूव', 'बभूविथ-बभूथ', 'बभूव', 'बभूवतुः', 'बभूवथुः', 'बभूविव', 'बभूवुः', 'बभूव', 'बभूविम'],
    },
    'buD': { // to know, cl.1,4 FIXME buD_lat_atm_sg.1_buDye - g.4
        'lat_par': ['बोधति', 'बोधसि', 'बोधामि', 'बोधतः', 'बोधथः', 'बोधावः', 'बोधन्ति', 'बोधथ', 'बोधामः'],
        'lat_pas': ['बुध्यते', 'बुध्यसे', 'बुध्ये', 'बुध्येते', 'बुध्येथे', 'बुध्यावहे', 'बुध्यन्ते', 'बुध्यध्वे', 'बुध्यामहे'],
        'lit_par': ['बुबोध', 'बुबोधिथ', 'बुबोध', 'बुबुधतुः', 'बुबुधथुः', 'बुबुधिव', 'बुबुधुः', 'बुबुध', 'बुबुधिम'],
        'lit_pas': ['बुबुधे', 'बुबुधिषे', 'बुबुधे', 'बुबुधाते', 'बुबुधाथे', 'बुबुधिवहे', 'बुबुधिरे', 'बुबुधिध्वे', 'बुबुधिमहे'],
    },

    'smf': { // remember
        'lat_par': ['स्मरति', 'स्मरसि', 'स्मरामि', 'स्मरतः', 'स्मरथः', 'स्मरावः', 'स्मरन्ति', 'स्मरथ', 'स्मरामः'],
        'lat_pas': ['स्मर्यते', 'स्मर्यसे', 'स्मर्ये', 'स्मर्येते', 'स्मर्येथे', 'स्मर्यावहे', 'स्मर्यन्ते', 'स्मर्यध्वे', 'स्मर्यामहे'],
        'lan_par': ['अस्मरत्', 'अस्मरः', 'अस्मरम्', 'अस्मरताम्', 'अस्मरतम्', 'अस्मराव', 'अस्मरन्', 'अस्मरत', 'अस्मराम'],
        'lan_pas': ['अस्मर्यत', 'अस्मर्यथाः', 'अस्मर्ये', 'अस्मर्येताम्', 'अस्मर्येथाम्', 'अस्मर्यावहि', 'अस्मर्यन्त', 'अस्मर्यध्वम्', 'अस्मर्यामहि'],
        'lot_par': ['स्मरतु', 'स्मर', 'स्मराणि', 'स्मरताम्', 'स्मरतम्', 'स्मराव', 'स्मरन्तु', 'स्मरत', 'स्मराम'],
        'lot_pas': ['स्मर्यताम्', 'स्मर्यस्व', 'स्मर्यै', 'स्मर्येताम्', 'स्मर्येथाम्', 'स्मर्यावहै', 'स्मर्यन्ताम्', 'स्मर्यध्वम्', 'स्मर्यामहै'],
        'lit_par': ['सस्मार', 'सस्मरिथ', 'सस्मार-सस्मर', 'सस्मरतुः', 'सस्मरथुः', 'सस्मरिव', 'सस्मरुः', 'सस्मर', 'सस्मरिम'],
    },
    'nI': { // lead
        'lat_par': ['नयति', 'नयसि', 'नयामि', 'नयतः', 'नयथः', 'नयावः', 'नयन्ति', 'नयथ', 'नयामः'],
        'lat_atm': ['नयते', 'नयसे', 'नये', 'नयेते', 'नयेथे', 'नयावहे', 'नयन्ते', 'नयध्वे', 'नयामहे'],
        'lat_pas': ['नीयते', 'नीयसे', 'नीये', 'नीयेते', 'नीयेथे', 'नीयावहे', 'नीयन्ते', 'नीयध्वे', 'नीयामहे'],
        'lan_par': ['अनयत्', 'अनयः', 'अनयम्', 'अनयताम्', 'अनयतम्', 'अनयाव', 'अनयन्', 'अनयत', 'अनयाम'],
        'lan_atm': ['अनयत', 'अनयथाः', 'अनये', 'अनयेताम्', 'अनयेथाम्', 'अनयावहि', 'अनयन्त', 'अनयध्वम्', 'अनयामहि'],
        'lan_pas': ['अनीयत', 'अनीयथाः', 'अनीये', 'अनीयेताम्', 'अनीयेथाम्', 'अनीयावहि', 'अनीयन्त', 'अनीयध्वम्', 'अनीयामहि'],
        'lot_par': ['नयतु', 'नय', 'नयानि', 'नयताम्', 'नयतम्', 'नयाव', 'नयन्तु', 'नयत', 'नयाम'],
        'lot_atm': ['नयताम्', 'नयस्व', 'नयै', 'नयेताम्', 'नयेथाम्', 'नयावहै', 'नयन्ताम्', 'नयध्वम्', 'नयामहै'],
        'lot_pas': ['नीयताम्', 'नीयस्व', 'नीयै', 'नीयेताम्', 'नीयेथाम्', 'नीयावहै', 'नीयन्ताम्', 'नीयध्वम्', 'नीयामहै'],
        'lit_par': ['निनाय', 'निनेथ-निनयिथ', 'निनाय-निनय', 'निन्यतुः', 'निन्यथुः', 'निन्यिव', 'निन्युः', 'निन्य', 'निन्यिम'],
        'lit_atm': ['निन्ये', 'निन्यिषे', 'निन्ये', 'निन्याते', 'निन्याथे', 'निन्यिवहे', 'निन्यिरे', 'निन्यिध्वे', 'निन्यिमहे'],
    },

    'ruh': { // climb
        'lat_par': ['रोहति', 'रोहसि', 'रोहामि', 'रोहतः', 'रोहथः', 'रोहावः', 'रोहन्ति', 'रोहथ', 'रोहामः'],
        'lat_atm': ['रोहते', 'रोहसे', 'रोहे', 'रोहेते', 'रोहेथे', 'रोहावहे', 'रोहन्ते', 'रोहध्वे', 'रोहामहे'],
        'lat_pas': ['रुह्यते', 'रुह्यसे', 'रुह्ये', 'रुह्येते', 'रुह्येथे', 'रुह्यावहे', 'रुह्यन्ते', 'रुह्यध्वे', 'रुह्यामहे'],
        'lan_par': ['अरोहत्', 'अरोहः', 'अरोहम्', 'अरोहताम्', 'अरोहतम्', 'अरोहाव', 'अरोहन्', 'अरोहत', 'अरोहाम'],
        'lan_atm': ['अरोहत', 'अरोहथाः', 'अरोहे', 'अरोहेताम्', 'अरोहेथाम्', 'अरोहावहि', 'अरोहन्त', 'अरोहध्वम्', 'अरोहामहि'],
        'lan_pas': ['अरुह्यत', 'अरुह्यथाः', 'अरुह्ये', 'अरुह्येताम्', 'अरुह्येथाम्', 'अरुह्यावहि', 'अरुह्यन्त', 'अरुह्यध्वम्', 'अरुह्यामहि'],
        'lot_par': ['रोहतु', 'रोह', 'रोहाणि', 'रोहताम्', 'रोहतम्', 'रोहाव', 'रोहन्तु', 'रोहत', 'रोहाम'],
        'lot_atm': ['रोहताम्', 'रोहस्व', 'रोहै', 'रोहेताम्', 'रोहेथाम्', 'रोहावहै', 'रोहन्ताम्', 'रोहध्वम्', 'रोहामहै'],
        'lot_pas': ['रुह्यताम्', 'रुह्यस्व', 'रुह्यै', 'रुह्येताम्', 'रुह्येथाम्', 'रुह्यावहै', 'रुह्यन्ताम्', 'रुह्यध्वम्', 'रुह्यामहै'],
        'lit_par': ['रुरोह', 'रुरोहिथ', 'रुरोह', 'रुरुहतुः', 'रुरुहथुः', 'रुरुहिव', 'रुरुहुः', 'रुरुह', 'रुरुहिम'],
        'lit_atm': ['रुरुहे', 'रुरुहिषे', 'रुरुहे', 'रुरुहाते', 'रुरुहाथे', 'रुरुहिवहे', 'रुरुहिरे', 'रुरुहिध्वे', 'रुरुहिमहे'],
    },
    'vfD': { // grow
        'lat_par': ['वर्धति', 'वर्धसि', 'वर्धामि', 'वर्धतः', 'वर्धथः', 'वर्धावः', 'वर्धन्ति', 'वर्धथ', 'वर्धामः'],
        'lat_atm': ['वर्धते', 'वर्धसे', 'वर्धे', 'वर्धेते', 'वर्धेथे', 'वर्धावहे', 'वर्धन्ते', 'वर्धध्वे', 'वर्धामहे'],
        'lat_pas': ['वृध्यते', 'वृध्यसे', 'वृध्ये', 'वृध्येते', 'वृध्येथे', 'वृध्यावहे', 'वृध्यन्ते', 'वृध्यध्वे', 'वृध्यामहे'],
        'lan_par': ['अवर्धत्', 'अवर्धः', 'अवर्धम्', 'अवर्धताम्', 'अवर्धतम्', 'अवर्धाव', 'अवर्धन्', 'अवर्धत', 'अवर्धाम'],
        'lan_atm': ['अवर्धत', 'अवर्धथाः', 'अवर्धे', 'अवर्धेताम्', 'अवर्धेथाम्', 'अवर्धावहि', 'अवर्धन्त', 'अवर्धध्वम्', 'अवर्धामहि'],
        'lan_pas': ['अवृध्यत', 'अवृध्यथाः', 'अवृध्ये', 'अवृध्येताम्', 'अवृध्येथाम्', 'अवृध्यावहि', 'अवृध्यन्त', 'अवृध्यध्वम्', 'अवृध्यामहि'],
        'lot_par': ['वर्धतु', 'वर्ध', 'वर्धानि', 'वर्धताम्', 'वर्धतम्', 'वर्धाव', 'वर्धन्तु', 'वर्धत', 'वर्धाम'],
        'lot_atm': ['वर्धताम्', 'वर्धस्व', 'वर्धै', 'वर्धेताम्', 'वर्धेथाम्', 'वर्धावहै', 'वर्धन्ताम्', 'वर्धध्वम्', 'वर्धामहै'],
        'lot_pas': ['वृध्यताम्', 'वृध्यस्व', 'वृध्यै', 'वृध्येताम्', 'वृध्येथाम्', 'वृध्यावहै', 'वृध्यन्ताम्', 'वृध्यध्वम्', 'वृध्यामहै'],
        'lit_par': ['ववर्ध', 'ववर्धिथ', 'ववर्ध', 'ववृधतुः', 'ववृधथुः', 'ववृधिव', 'ववृधुः', 'ववृध', 'ववृधिम'],
        'lit_atm': ['ववृधे', 'ववृधिषे', 'ववृधे', 'ववृधाते', 'ववृधाथे', 'ववृधिवहे', 'ववृधिरे', 'ववृधिध्वे', 'ववृधिमहे'],
    },

    'gam': { // go
        'lat_par': ['गच्छति', 'गच्छसि', 'गच्छामि', 'गच्छतः', 'गच्छथः', 'गच्छावः', 'गच्छन्ति', 'गच्छथ', 'गच्छामः'],
        'lat_atm': ['गच्छते', 'गच्छसे', 'गच्छे', 'गच्छेते', 'गच्छेथे', 'गच्छावहे', 'गच्छन्ते', 'गच्छध्वे', 'गच्छामहे'],
        'lat_pas': ['गम्यते', 'गम्यसे', 'गम्ये', 'गम्येते', 'गम्येथे', 'गम्यावहे', 'गम्यन्ते', 'गम्यध्वे', 'गम्यामहे'],
        'lan_par': ['अगच्छत्', 'अगच्छः', 'अगच्छम्', 'अगच्छताम्', 'अगच्छतम्', 'अगच्छाव', 'अगच्छन्', 'अगच्छत', 'अगच्छाम'],
        'lan_atm': ['अगच्छत', 'अगच्छथाः', 'अगच्छे', 'अगच्छेताम्', 'अगच्छेथाम्', 'अगच्छावहि', 'अगच्छन्त', 'अगच्छध्वम्', 'अगच्छामहि'],
        'lan_pas': ['अगम्यत', 'अगम्यथाः', 'अगम्ये', 'अगम्येताम्', 'अगम्येथाम्', 'अगम्यावहि', 'अगम्यन्त', 'अगम्यध्वम्', 'अगम्यामहि'],
        'lot_par': ['गच्छतु', 'गच्छ', 'गच्छानि', 'गच्छताम्', 'गच्छतम्', 'गच्छाव', 'गच्छन्तु', 'गच्छत', 'गच्छाम'],
        'lot_atm': ['गच्छताम्', 'गच्छस्व', 'गच्छै', 'गच्छेताम्', 'गच्छेथाम्', 'गच्छावहै', 'गच्छन्ताम्', 'गच्छध्वम्', 'गच्छामहै'],
        'lot_pas': ['गम्यताम्', 'गम्यस्व', 'गम्यै', 'गम्येताम्', 'गम्येथाम्', 'गम्यावहै', 'गम्यन्ताम्', 'गम्यध्वम्', 'गम्यामहै'],
        'lit_par': ['जगाम', 'जगमिथ-जगन्थ', 'जगाम-जगम', 'जग्मतुः', 'जग्मथुः', 'जग्मिव', 'जग्मुः', 'जग्म', 'जग्मिम'],
        'lit_atm': ['जग्मे', 'जग्मिषे', 'जग्मे', 'जग्माते', 'जग्माथे', 'जग्मिवहे', 'जग्मिरे', 'जग्मिध्वे', 'जग्मिमहे'],
    },
    'sad': { // sit
        'lat_par': ['सीदति', 'सीदसि', 'सीदामि', 'सीदतः', 'सीदथः', 'सीदावः', 'सीदन्ति', 'सीदथ', 'सीदामः'],
        'lat_pas': ['सद्यते', 'सद्यसे', 'सद्ये', 'सद्येते', 'सद्येथे', 'सद्यावहे', 'सद्यन्ते', 'सद्यध्वे', 'सद्यामहे'],
        'lan_par': ['असीदत्', 'असीदः', 'असीदम्', 'असीदताम्', 'असीदतम्', 'असीदाव', 'असीदन्', 'असीदत', 'असीदाम'],
        'lan_pas': ['असद्यत', 'असद्यथाः', 'असद्ये', 'असद्येताम्', 'असद्येथाम्', 'असद्यावहि', 'असद्यन्त', 'असद्यध्वम्', 'असद्यामहि'],
        'lot_par': ['सीदतु', 'सीद', 'सीदानि', 'सीदताम्', 'सीदतम्', 'सीदाव', 'सीदन्तु', 'सीदत', 'सीदाम'],
        'lot_pas': ['सद्यताम्', 'सद्यस्व', 'सद्यै', 'सद्येताम्', 'सद्येथाम्', 'सद्यावहै', 'सद्यन्ताम्', 'सद्यध्वम्', 'सद्यामहै'],
        'lit_par': ['ससाद', 'सेदिथ-ससत्थ', 'ससाद-ससद', 'सेदतुः', 'सेदथुः', 'सेदिव', 'सेदुः', 'सेद', 'सेदिम'],
    },

    // dfS - не определился словарь, оч. много вариантов, есть darSayati, но нет dfSati
    'sTA': { // stand
        'lat_par': ['तिष्ठति', 'तिष्ठसि', 'तिष्ठामि', 'तिष्ठतः', 'तिष्ठथः', 'तिष्ठावः', 'तिष्ठन्ति', 'तिष्ठथ', 'तिष्ठामः'],
        'lat_pas': ['स्थीयते', 'स्थीयसे', 'स्थीये', 'स्थीयेते', 'स्थीयेथे', 'स्थीयावहे', 'स्थीयन्ते', 'स्थीयध्वे', 'स्थीयामहे'],
        'lan_par': ['अतिष्ठत्', 'अतिष्ठः', 'अतिष्ठम्', 'अतिष्ठताम्', 'अतिष्ठतम्', 'अतिष्ठाव', 'अतिष्ठन्', 'अतिष्ठत', 'अतिष्ठाम'],
        'lan_pas': ['अस्थीयत', 'अस्थीयथाः', 'अस्थीये', 'अस्थीयेताम्', 'अस्थीयेथाम्', 'अस्थीयावहि', 'अस्थीयन्त', 'अस्थीयध्वम्', 'अस्थीयामहि'],
        'lot_par': ['तिष्ठतु', 'तिष्ठ', 'तिष्ठानि', 'तिष्ठताम्', 'तिष्ठतम्', 'तिष्ठाव', 'तिष्ठन्तु', 'तिष्ठत', 'तिष्ठाम'],
        'lot_pas': ['स्थीयताम्', 'स्थीयस्व', 'स्थीयै', 'स्थीयेताम्', 'स्थीयेथाम्', 'स्थीयावहै', 'स्थीयन्ताम्', 'स्थीयध्वम्', 'स्थीयामहै'],
        'lit_par': ['तस्थौ', 'तस्थिथ-तस्थाथ', 'तस्थौ', 'तस्थतुः', 'तस्थथुः', 'तस्थिव', 'तस्थुः', 'तस्थ', 'तस्थिम'],
    },
    'pA': { // drink
        'lat_par': ['पिबति', 'पिबसि', 'पिबामि', 'पिबतः', 'पिबथः', 'पिबावः', 'पिबन्ति', 'पिबथ', 'पिबामः'],
        'lat_pas': ['पीयते', 'पीयसे', 'पीये', 'पीयेते', 'पीयेथे', 'पीयावहे', 'पीयन्ते', 'पीयध्वे', 'पीयामहे'],
        'lan_par': ['अपिबत्', 'अपिबः', 'अपिबम्', 'अपिबताम्', 'अपिबतम्', 'अपिबाव', 'अपिबन्', 'अपिबत', 'अपिबाम'],
        'lan_pas': ['अपीयत', 'अपीयथाः', 'अपीये', 'अपीयेताम्', 'अपीयेथाम्', 'अपीयावहि', 'अपीयन्त', 'अपीयध्वम्', 'अपीयामहि'],
        'lot_par': ['पिबतु', 'पिब', 'पिबानि', 'पिबताम्', 'पिबतम्', 'पिबाव', 'पिबन्तु', 'पिबत', 'पिबाम'],
        'lot_pas': ['पीयताम्', 'पीयस्व', 'पीयै', 'पीयेताम्', 'पीयेथाम्', 'पीयावहै', 'पीयन्ताम्', 'पीयध्वम्', 'पीयामहै'],
        'lit_par': ['पपौ', 'पपिथ-पपाथ', 'पपौ', 'पपतुः', 'पपथुः', 'पपिव', 'पपुः', 'पप', 'पपिम'],
    },

    'iz': { // seek
        'lat_par': ['एषति', 'एषसि', 'एषामि', 'एषतः', 'एषथः', 'एषावः', 'एषन्ति', 'एषथ', 'एषामः'],
        'lat_atm': ['एषते', 'एषसे', 'एषे', 'एषेते', 'एषेथे', 'एषावहे', 'एषन्ते', 'एषध्वे', 'एषामहे'],
        'lat_pas': ['इष्यते', 'इष्यसे', 'इष्ये', 'इष्येते', 'इष्येथे', 'इष्यावहे', 'इष्यन्ते', 'इष्यध्वे', 'इष्यामहे'],
        'lan_par': ['ऐषत्', 'ऐषः', 'ऐषम्', 'ऐषताम्', 'ऐषतम्', 'ऐषाव', 'ऐषन्', 'ऐषत', 'ऐषाम'],
        'lan_atm': ['ऐषत', 'ऐषथाः', 'ऐषे', 'ऐषेताम्', 'ऐषेथाम्', 'ऐषावहि', 'ऐषन्त', 'ऐषध्वम्', 'ऐषामहि'],
        'lan_pas': ['ऐष्यत', 'ऐष्यथाः', 'ऐष्ये', 'ऐष्येताम्', 'ऐष्येथाम्', 'ऐष्यावहि', 'ऐष्यन्त', 'ऐष्यध्वम्', 'ऐष्यामहि'],
        'lot_par': ['एषतु', 'एष', 'एषाणि', 'एषताम्', 'एषतम्', 'एषाव', 'एषन्तु', 'एषत', 'एषाम'],
        'lot_atm': ['एषताम्', 'एषस्व', 'एषै', 'एषेताम्', 'एषेथाम्', 'एषावहै', 'एषन्ताम्', 'एषध्वम्', 'एषामहै'],
        'lot_pas': ['इष्यताम्', 'इष्यस्व', 'इष्यै', 'इष्येताम्', 'इष्येथाम्', 'इष्यावहै', 'इष्यन्ताम्', 'इष्यध्वम्', 'इष्यामहै'],
        'lit_par': ['इयेष', 'इयेषिथ', 'इयेष', 'ईषतुः', 'ईषथुः', 'ईषिव', 'ईषुः', 'ईष', 'ईषिम'],
        'lit_atm': ['ईषे', 'ईषिषे', 'ईषे', 'ईषाते', 'ईषाथे', 'ईषिवहे', 'ईषिरे', 'ईषिध्वे', 'ईषिमहे'],
    },
    'gE': { // sing
        'lat_par': ['गायति', 'गायसि', 'गायामि', 'गायतः', 'गायथः', 'गायावः', 'गायन्ति', 'गायथ', 'गायामः'],
        'lat_atm': ['गायते', 'गायसे', 'गाये', 'गायेते', 'गायेथे', 'गायावहे', 'गायन्ते', 'गायध्वे', 'गायामहे'],
        'lat_pas': ['गीयते', 'गीयसे', 'गीये', 'गीयेते', 'गीयेथे', 'गीयावहे', 'गीयन्ते', 'गीयध्वे', 'गीयामहे'],
        'lan_par': ['अगायत्', 'अगायः', 'अगायम्', 'अगायताम्', 'अगायतम्', 'अगायाव', 'अगायन्', 'अगायत', 'अगायाम'],
        'lan_atm': ['अगायत', 'अगायथाः', 'अगाये', 'अगायेताम्', 'अगायेथाम्', 'अगायावहि', 'अगायन्त', 'अगायध्वम्', 'अगायामहि'],
        'lan_pas': ['अगीयत', 'अगीयथाः', 'अगीये', 'अगीयेताम्', 'अगीयेथाम्', 'अगीयावहि', 'अगीयन्त', 'अगीयध्वम्', 'अगीयामहि'],
        'lot_par': ['गायतु', 'गाय', 'गायानि', 'गायताम्', 'गायतम्', 'गायाव', 'गायन्तु', 'गायत', 'गायाम'],
        'lot_atm': ['गायताम्', 'गायस्व', 'गायै', 'गायेताम्', 'गायेथाम्', 'गायावहै', 'गायन्ताम्', 'गायध्वम्', 'गायामहै'],
        'lot_pas': ['गीयताम्', 'गीयस्व', 'गीयै', 'गीयेताम्', 'गीयेथाम्', 'गीयावहै', 'गीयन्ताम्', 'गीयध्वम्', 'गीयामहै'],
        'lit_par': ['जगौ', 'जगिथ-जगाथ', 'जगौ', 'जगतुः', 'जगथुः', 'जगिव', 'जगुः', 'जग', 'जगिम'],
        'lit_atm': ['जगे', 'जगिषे', 'जगे', 'जगाते', 'जगाथे', 'जगिवहे', 'जगिरे', 'जगिध्वे', 'जगिमहे'],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },

}

describe(gana, function() {
    utils.fireTest(tests, gana);
});
