//
var utils = require('../utils');
var conj = 'ten';

var tests = {
    'cur': { // to steal // FIXME: _pass
        'lat_par': ['चोरयति', 'चोरयसि', 'चोरयामि', 'चोरयतः', 'चोरयथः', 'चोरयावः', 'चोरयन्ति', 'चोरयथ', 'चोरयामः'],
        'lat_atm': ['चोरयते', 'चोरयसे', 'चोरये', 'चोरयेते', 'चोरयेथे', 'चोरयावहे', 'चोरयन्ते', 'चोरयध्वे', 'चोरयामहे'],
        'lat_pas': ['चोर्यते', 'चोर्यसे', 'चोर्ये', 'चोर्येते', 'चोर्येथे', 'चोर्यावहे', 'चोर्यन्ते', 'चोर्यध्वे', 'चोर्यामहे'],
        'lan_par': ['अचोरयत्', 'अचोरयः', 'अचोरयम्', 'अचोरयताम्', 'अचोरयतम्', 'अचोरयाव', 'अचोरयन्', 'अचोरयत', 'अचोरयाम'],
        'lan_atm': ['अचोरयत', 'अचोरयथाः', 'अचोरये', 'अचोरयेताम्', 'अचोरयेथाम्', 'अचोरयावहि', 'अचोरयन्त', 'अचोरयध्वम्', 'अचोरयामहि'],
        'lan_pas': ['अचोर्यत', 'अचोर्यथाः', 'अचोर्ये', 'अचोर्येताम्', 'अचोर्येथाम्', 'अचोर्यावहि', 'अचोर्यन्त', 'अचोर्यध्वम्', 'अचोर्यामहि'],
        'lot_par': ['चोरयतु', 'चोरय', 'चोरयाणि', 'चोरयताम्', 'चोरयतम्', 'चोरयाव', 'चोरयन्तु', 'चोरयत', 'चोरयाम'],
        'lot_atm': ['चोरयताम्', 'चोरयस्व', 'चोरयै', 'चोरयेताम्', 'चोरयेथाम्', 'चोरयावहै', 'चोरयन्ताम्', 'चोरयध्वम्', 'चोरयामहै'],
        'lot_pas': ['चोर्यताम्', 'चोर्यस्व', 'चोर्यै', 'चोर्येताम्', 'चोर्येथाम्', 'चोर्यावहै', 'चोर्यन्ताम्', 'चोर्यध्वम्', 'चोर्यामहै'],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''], // почему-то на inria.fr нет lit
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    'cint': { // think
        'lat_par': ['चिन्तयति', 'चिन्तयसि', 'चिन्तयामि', 'चिन्तयतः', 'चिन्तयथः', 'चिन्तयावः', 'चिन्तयन्ति', 'चिन्तयथ', 'चिन्तयामः'],
        'lat_atm': ['चिन्तयते', 'चिन्तयसे', 'चिन्तये', 'चिन्तयेते', 'चिन्तयेथे', 'चिन्तयावहे', 'चिन्तयन्ते', 'चिन्तयध्वे', 'चिन्तयामहे'],
        'lat_pas': ['चिन्त्यते', 'चिन्त्यसे', 'चिन्त्ये', 'चिन्त्येते', 'चिन्त्येथे', 'चिन्त्यावहे', 'चिन्त्यन्ते', 'चिन्त्यध्वे', 'चिन्त्यामहे'],
        'lan_par': ['अचिन्तयत्', 'अचिन्तयः', 'अचिन्तयम्', 'अचिन्तयताम्', 'अचिन्तयतम्', 'अचिन्तयाव', 'अचिन्तयन्', 'अचिन्तयत', 'अचिन्तयाम'],
        'lan_atm': ['अचिन्तयत', 'अचिन्तयथाः', 'अचिन्तये', 'अचिन्तयेताम्', 'अचिन्तयेथाम्', 'अचिन्तयावहि', 'अचिन्तयन्त', 'अचिन्तयध्वम्', 'अचिन्तयामहि'],
        'lan_pas': ['अचिन्त्यत', 'अचिन्त्यथाः', 'अचिन्त्ये', 'अचिन्त्येताम्', 'अचिन्त्येथाम्', 'अचिन्त्यावहि', 'अचिन्त्यन्त', 'अचिन्त्यध्वम्', 'अचिन्त्यामहि'],
        'lot_par': ['चिन्तयतु', 'चिन्तय', 'चिन्तयानि', 'चिन्तयताम्', 'चिन्तयतम्', 'चिन्तयाव', 'चिन्तयन्तु', 'चिन्तयत', 'चिन्तयाम'],
        'lot_atm': ['चिन्तयताम्', 'चिन्तयस्व', 'चिन्तयै', 'चिन्तयेताम्', 'चिन्तयेथाम्', 'चिन्तयावहै', 'चिन्तयन्ताम्', 'चिन्तयध्वम्', 'चिन्तयामहै'],
        'lot_pas': ['चिन्त्यताम्', 'चिन्त्यस्व', 'चिन्त्यै', 'चिन्त्येताम्', 'चिन्त्येथाम्', 'चिन्त्यावहै', 'चिन्त्यन्ताम्', 'चिन्त्यध्वम्', 'चिन्त्यामहै'],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''], // нет
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
