//
var utils = require('../utils');
var conj = 'three';

// FIXME в третьей гане нет lit
// еще сделать pf,

var tests = {
    'hu': { // sacrifice // FIXME: three_hu_lot_par_pl.3_juhvatu, а флексия -ntu
        'lat_par': ['जुहोति', 'जुहोषि', 'जुहोमि', 'जुहुतः', 'जुहुथः', 'जुहुवः', 'जुह्वति', 'जुहुथ', 'जुहुमः'],
        'lat_pas': ['हूयते', 'हूयसे', 'हूये', 'हूयेते', 'हूयेथे', 'हूयावहे', 'हूयन्ते', 'हूयध्वे', 'हूयामहे'],
        'lan_par': ['अजुहोत्', 'अजुहोः', 'अजुहवम्', 'अजुहुताम्', 'अजुहुतम्', 'अजुहुव', 'अजुहवुः', 'अजुहुत', 'अजुहुम'], // errERR pl.3 H=>must be an
        'lan_pas': ['अहूयत', 'अहूयथाः', 'अहूये', 'अहूयेताम्', 'अहूयेथाम्', 'अहूयावहि', 'अहूयन्त', 'अहूयध्वम्', 'अहूयामहि'],
        'lot_par': ['जुहोतु', 'जुहुधि', 'जुहवानि', 'जुहुताम्', 'जुहुतम्', 'जुहवाव', 'जुह्वतु', 'जुहुत', 'जुहवाम'],
        'lot_pas': ['हूयताम्', 'हूयस्व', 'हूयै', 'हूयेताम्', 'हूयेथाम्', 'हूयावहै', 'हूयन्ताम्', 'हूयध्वम्', 'हूयामहै'],
        'lit_par': ['जुहाव', 'जुहोथ-जुहविथ', 'जुहाव-जुहव', 'जुहुवतुः', 'जुहुवथुः', 'जुहुव', 'जुहुवुः', 'जुहुव', 'जुहुम'],
    },
    'BI': { // fear // FIXME: lan_atm_sg.1_abiBI
        'lat_par': ['बिभेति', 'बिभेषि', 'बिभेमि', 'बिभितः', 'बिभिथः', 'बिभिवः', 'बिभ्यति', 'बिभिथ', 'बिभिमः'],
        'lat_atm': ['बिभिते', 'बिभिषे', 'बिभ्ये', 'बिभ्याते', 'बिभ्याथे', 'बिभिवहे', 'बिभ्यते', 'बिभिध्वे', 'बिभिमहे'],
        'lat_pas': ['भीयते', 'भीयसे', 'भीये', 'भीयेते', 'भीयेथे', 'भीयावहे', 'भीयन्ते', 'भीयध्वे', 'भीयामहे'],
        'lan_par': ['अबिभेत्', 'अबिभेः', 'अबिभयम्', 'अबिभिताम्', 'अबिभितम्', 'अबिभिव', 'अबिभयुः', 'अबिभित', 'अबिभिम'],
        'lan_atm': ['अबिभित', 'अबिभिथाः', 'अबिभी', 'अबिभ्याताम्', 'अबिभ्याथाम्', 'अबिभिवहि', 'अबिभ्यत', 'अबिभिध्वम्', 'अबिभिमहि'],
        'lan_pas': ['अभीयत', 'अभीयथाः', 'अभीये', 'अभीयेताम्', 'अभीयेथाम्', 'अभीयावहि', 'अभीयन्त', 'अभीयध्वम्', 'अभीयामहि'],
        'lot_par': ['बिभेतु', 'बिभीहि', 'बिभयानि', 'बिभीताम्', 'बिभीतम्', 'बिभयाव', 'बिभ्यतु', 'बिभीत', 'बिभयाम'],
        'lot_pas': ['भीयताम्', 'भीयस्व', 'भीयै', 'भीयेताम्', 'भीयेथाम्', 'भीयावहै', 'भीयन्ताम्', 'भीयध्वम्', 'भीयामहै'],
        'lit_par': ['बिभाय', 'बिभेथ-बिभयिथ', 'बिभाय-बिभय', 'बिभ्यतुः', 'बिभ्यथुः', 'बिभ्यिव', 'बिभ्युः', 'बिभ्य', 'बिभ्यिम'],
    },

    'dA': { // give
        'lat_par': ['ददाति', 'ददासि', 'ददामि', 'दत्तः', 'दत्थः', 'दद्वः', 'ददति', 'दत्थ', 'दद्मः'],
        'lat_atm': ['दत्ते', 'दत्से', 'ददे', 'ददाते', 'ददाथे', 'दद्वहे', 'ददते', 'दद्ध्वे', 'दद्महे'],
        'lat_pas': ['दीयते', 'दीयसे', 'दीये', 'दीयेते', 'दीयेथे', 'दीयावहे', 'दीयन्ते', 'दीयध्वे', 'दीयामहे'],
        'lan_par': ['अददात्', 'अददाः', 'अददाम्', 'अदत्ताम्', 'अदत्तम्', 'अदद्व', 'अददुः', 'अदत्त', 'अदद्म'],
        'lan_atm': ['अदत्त', 'अदत्थाः', 'अददि', 'अददाताम्', 'अददाथाम्', 'अदद्वहि', 'अददत', 'अदद्ध्वम्', 'अदद्महि'],
        'lan_pas': ['अदीयत', 'अदीयथाः', 'अदीये', 'अदीयेताम्', 'अदीयेथाम्', 'अदीयावहि', 'अदीयन्त', 'अदीयध्वम्', 'अदीयामहि'],
        'lot_par': ['ददातु', 'देहि', 'ददानि', 'दत्ताम्', 'दत्तम्', 'ददाव', 'ददतु', 'दत्त', 'ददाम'],
        'lot_atm': ['दत्ताम्', 'दत्स्व', 'ददै', 'ददाताम्', 'ददाथाम्', 'ददावहै', 'ददताम्', 'दद्ध्वम्', 'ददामहै'],
        'lot_pas': ['दीयताम्', 'दीयस्व', 'दीयै', 'दीयेताम्', 'दीयेथाम्', 'दीयावहै', 'दीयन्ताम्', 'दीयध्वम्', 'दीयामहै'],
        'lit_par': ['ददौ', 'ददिथ-ददाथ', 'ददौ', 'ददतुः', 'ददथुः', 'ददिव', 'ददुः', 'दद', 'ददिम'],
        'lit_atm': ['ददे', 'ददिषे', 'ददे', 'ददाते', 'ददाथे', 'ददिवहे', 'ददिरे', 'ददिध्वे', 'ददिमहे'],
    },
    'DA': { // place, put
        'lat_par': ['दधाति', 'दधासि', 'दधामि', 'धत्तः', 'धत्थः', 'दध्वः', 'दधति', 'धत्थ', 'दध्मः'],
        'lat_atm': ['धत्ते', 'धत्से', 'दधे', 'दधाते', 'दधाथे', 'दध्वहे', 'दधते', 'धद्ध्वे', 'दध्महे'],
        'lat_pas': ['धीयते', 'धीयसे', 'धीये', 'धीयेते', 'धीयेथे', 'धीयावहे', 'धीयन्ते', 'धीयध्वे', 'धीयामहे'],
        'lan_par': ['अदधात्', 'अदधाः', 'अदधाम्', 'अधत्ताम्', 'अधत्तम्', 'अदध्व', 'अदधुः', 'अधत्त', 'अदध्म'],
        'lan_atm': ['अधत्त', 'अधत्थाः', 'अदधि', 'अदधाताम्', 'अदधाथाम्', 'अदध्वहि', 'अदधत', 'अधद्ध्वम्', 'अदध्महि'],
        'lan_pas': ['अधीयत', 'अधीयथाः', 'अधीये', 'अधीयेताम्', 'अधीयेथाम्', 'अधीयावहि', 'अधीयन्त', 'अधीयध्वम्', 'अधीयामहि'],
        'lot_par': ['दधातु', 'धेहि', 'दधानि', 'धत्ताम्', 'धत्तम्', 'दधाव', 'दधतु', 'धत्त', 'दधाम'],
        'lot_atm': ['धत्ताम्', 'धत्स्व', 'दधै', 'दधाताम्', 'दधाथाम्', 'दधावहै', 'दधताम्', 'धद्ध्वम्', 'दधामहै'],
        'lot_pas': ['धीयताम्', 'धीयस्व', 'धीयै', 'धीयेताम्', 'धीयेथाम्', 'धीयावहै', 'धीयन्ताम्', 'धीयध्वम्', 'धीयामहै'],
        'lit_par': ['दधौ', 'दधिथ-दधाथ', 'दधौ', 'दधतुः', 'दधथुः', 'दधिव', 'दधुः', 'दध', 'दधिम'],
        'lit_atm': ['दधे', 'दधिषे', 'दधे', 'दधाते', 'दधाथे', 'दधिवहे', 'दधिरे', 'दधिध्वे', 'दधिमहे'],
    },

    'mA': { // measure
        'lat_atm': ['मिमीते', 'मिमीषे', 'मिमे', 'मिमाते', 'मिमाथे', 'मिमीवहे', 'मिमते', 'मिमीध्वे', 'मिमीमहे'],
        'lat_pas': ['मीयते', 'मीयसे', 'मीये', 'मीयेते', 'मीयेथे', 'मीयावहे', 'मीयन्ते', 'मीयध्वे', 'मीयामहे'],
        'lan_atm': ['अमिमीत', 'अमिमीथाः', 'अमिमि', 'अमिमाताम्', 'अमिमाथाम्', 'अमिमीवहि', 'अमिमत', 'अमिमीध्वम्', 'अमिमीमहि'],
        'lan_pas': ['अमीयत', 'अमीयथाः', 'अमीये', 'अमीयेताम्', 'अमीयेथाम्', 'अमीयावहि', 'अमीयन्त', 'अमीयध्वम्', 'अमीयामहि'],
        'lot_atm': ['मिमीताम्', 'मिमीष्व', 'मिमै', 'मिमाताम्', 'मिमाथाम्', 'मिमावहै', 'मिमताम्', 'मिमीध्वम्', 'मिमामहै'],
        'lot_pas': ['मीयताम्', 'मीयस्व', 'मीयै', 'मीयेताम्', 'मीयेथाम्', 'मीयावहै', 'मीयन्ताम्', 'मीयध्वम्', 'मीयामहै'],
        'lit_par': ['ममौ', 'ममिथ-ममाथ', 'ममौ', 'ममतुः', 'ममथुः', 'ममिव', 'ममुः', 'मम', 'ममिम'],
        'lit_atm': ['ममे', 'ममिषे', 'ममे', 'ममाते', 'ममाथे', 'ममिवहे', 'ममिरे', 'ममिध्वे', 'ममिमहे'],
    },
    'hA': { // leave, abandon  -- // FIXME: pass - hI
        'lat_par': ['जहाति', 'जहासि', 'जहामि', 'जहीतः-जहितः', 'जहीथः-जहिथः', 'जहीवः-जहिवः', 'जहति', 'जहीथ-जहिथ', 'जहीमः-जहिमः'],
        'lat_pas': ['हीयते', 'हीयसे', 'हीये', 'हीयेते', 'हीयेथे', 'हीयावहे', 'हीयन्ते', 'हीयध्वे', 'हीयामहे'],
        'lan_par': ['अजहित्-अजहात्', 'अजहिः-अजहाः', 'अजहाम्', 'अजहीताम्-अजहिताम्', 'अजहीतम्-अजहितम्', 'अजहीव-अजहिव', 'अजहुः', 'अजहीत-अजहित', 'अजहीम-अजहिम'],
        'lan_pas': ['अहीयत', 'अहीयथाः', 'अहीये', 'अहीयेताम्', 'अहीयेथाम्', 'अहीयावहि', 'अहीयन्त', 'अहीयध्वम्', 'अहीयामहि'],
        'lot_par': ['जहितु-जहातु', 'जहीहि-जहिहि-जहाहि', 'जहानि', 'जहीताम्-जहिताम्', 'जहीतम्-जहितम्', 'जहाव', 'जहतु', 'जहीत-जहित', 'जहाम'],
        'lot_pas': ['हीयताम्', 'हीयस्व', 'हीयै', 'हीयेताम्', 'हीयेथाम्', 'हीयावहै', 'हीयन्ताम्', 'हीयध्वम्', 'हीयामहै'],
        'lit_par': ['जहौ', 'जहिथ-जहाथ', 'जहौ', 'जहतुः', 'जहथुः', 'जहिव', 'जहुः', 'जह', 'जहिम'],
    },

    'cit': { // to perceive  - FIXME: MW - cIhetati, lat_atm_pl.2_cicidDve
        'lat_par': ['चिचेत्ति', 'चिचेत्सि', 'चिचेत्मि', 'चिचित्तः', 'चिचित्थः', 'चिचित्वः', 'चिचितति', 'चिचित्थ', 'चिचित्मः'],
        'lat_atm': ['चिचित्ते', 'चिचित्से', 'चिचिते', 'चिचिताते', 'चिचिताथे', 'चिचित्वहे', 'चिचितते', 'चिचिद्ध्वे', 'चिचित्महे'],
        'lat_pas': ['चित्यते', 'चित्यसे', 'चित्ये', 'चित्येते', 'चित्येथे', 'चित्यावहे', 'चित्यन्ते', 'चित्यध्वे', 'चित्यामहे'],
        'lan_par': ['अचिचेत्', 'अचिचेत्', 'अचिचेतम्', 'अचिचित्ताम्', 'अचिचित्तम्', 'अचिचित्व', 'अचिचेतुः', 'अचिचित्त', 'अचिचित्म'],
        'lan_atm': ['अचिचित्त', 'अचिचित्थाः', 'अचिचिति', 'अचिचिताताम्', 'अचिचिताथाम्', 'अचिचित्वहि', 'अचिचितत', 'अचिचिद्ध्वम्', 'अचिचित्महि'],
        'lan_pas': ['अचित्यत', 'अचित्यथाः', 'अचित्ये', 'अचित्येताम्', 'अचित्येथाम्', 'अचित्यावहि', 'अचित्यन्त', 'अचित्यध्वम्', 'अचित्यामहि'],
        'lot_par': ['चिचेत्तु', 'चिचिद्धि', 'चिचेतानि', 'चिचित्ताम्', 'चिचित्तम्', 'चिचेताव', 'चिचिततु', 'चिचित्त', 'चिचेताम'],
        'lot_atm': ['चिचित्ताम्', 'चिचित्स्व', 'चिचेतै', 'चिचिताताम्', 'चिचिताथाम्', 'चिचेतावहै', 'चिचितताम्', 'चिचिद्ध्वम्', 'चिचेतामहै'],
        'lot_pas': ['चित्यताम्', 'चित्यस्व', 'चित्यै', 'चित्येताम्', 'चित्येथाम्', 'चित्यावहै', 'चित्यन्ताम्', 'चित्यध्वम्', 'चित्यामहै'],
        'lit_par': ['चिचेत', 'चिचेतिथ', 'चिचेत', 'चिचिततुः', 'चिचितथुः', 'चिचितिव', 'चिचितुः', 'चिचित', 'चिचितिम'],
        'lit_atm': ['चिचिते', 'चिचितिषे', 'चिचिते', 'चिचिताते', 'चिचिताथे', 'चिचितिवहे', 'चिचितिरे', 'चिचितिध्वे', 'चिचितिमहे'],
    },
    // FIXME: добавить еще трехбуквенных корней
    'Bf': { // carry, bear // FIXME: pass Briya...
        'lat_par': ['बिभर्ति', 'बिभर्षि', 'बिभर्मि', 'बिभृतः', 'बिभृथः', 'बिभृवः', 'बिभ्रति', 'बिभृथ', 'बिभृमः'],
        'lat_atm': ['बिभृते', 'बिभृषे', 'बिभ्रे', 'बिभ्राते', 'बिभ्राथे', 'बिभृवहे', 'बिभ्रते', 'बिभृध्वे', 'बिभृमहे'],
        'lat_pas': ['भ्रियते', 'भ्रियसे', 'भ्रिये', 'भ्रियेते', 'भ्रियेथे', 'भ्रियावहे', 'भ्रियन्ते', 'भ्रियध्वे', 'भ्रियामहे'],
        'lan_par': ['अबिभः', 'अबिभः', 'अबिभरम्', 'अबिभृताम्', 'अबिभृतम्', 'अबिभृव', 'अबिभरुः', 'अबिभृत', 'अबिभृम'],
        'lan_atm': ['अबिभृत', 'अबिभृथाः', 'अबिभ्रि', 'अबिभ्राताम्', 'अबिभ्राथाम्', 'अबिभृवहि', 'अबिभ्रत', 'अबिभृध्वम्', 'अबिभृमहि'],
        'lan_pas': ['अभ्रियत', 'अभ्रियथाः', 'अभ्रिये', 'अभ्रियेताम्', 'अभ्रियेथाम्', 'अभ्रियावहि', 'अभ्रियन्त', 'अभ्रियध्वम्', 'अभ्रियामहि'],
        'lot_par': ['बिभर्तु', 'बिभृहि', 'बिभराणि', 'बिभृताम्', 'बिभृतम्', 'बिभराव', 'बिभ्रतु', 'बिभृत', 'बिभराम'],
        'lot_atm': ['बिभृताम्', 'बिभृष्व', 'बिभरै', 'बिभ्राताम्', 'बिभ्राथाम्', 'बिभरावहै', 'बिभ्रताम्', 'बिभृध्वम्', 'बिभरामहै'],
        'lot_pas': ['भ्रियताम्', 'भ्रियस्व', 'भ्रियै', 'भ्रियेताम्', 'भ्रियेथाम्', 'भ्रियावहै', 'भ्रियन्तुभ्रियन्ताम्', 'भ्रियध्वम्', 'भ्रियामहै'],
        'lit_par': ['बभार', 'बभर्थ', 'बभार-बभर', 'बभ्रतुः', 'बभ्रथुः', 'बभृव', 'बभ्रुः', 'बभ्र', 'बभृम'],
        'lit_atm': ['बभ्रे', 'बभृषे', 'बभ्रे', 'बभ्राते', 'बभ्राथे', 'बभृवहे', 'बभ्रिरे', 'बभृध्वे', 'बभृमहे'],
    },
    'pfc': { // mix // FIXME: pfc_lan_par_sg.3_apipark
        'lat_par': ['पिपर्क्ति', 'पिपर्क्षि', 'पिपर्च्मि', 'पिपृक्तः', 'पिपृक्थः', 'पिपृच्वः', 'पिपृचति', 'पिपृक्थ', 'पिपृच्मः'],
        'lat_pas': ['पृच्यते', 'पृच्यसे', 'पृच्ये', 'पृच्येते', 'पृच्येथे', 'पृच्यावहे', 'पृच्यन्ते', 'पृच्यध्वे', 'पृच्यामहे'],
        'lan_par': ['अपिपर्क्', 'अपिपर्क्', 'अपिपर्चम्', 'अपिपृक्ताम्', 'अपिपृक्तम्', 'अपिपृच्व', 'अपिपर्चुः', 'अपिपृक्त', 'अपिपृच्म'],
        'lan_pas': ['अपृच्यत', 'अपृच्यथाः', 'अपृच्ये', 'अपृच्येताम्', 'अपृच्येथाम्', 'अपृच्यावहि', 'अपृच्यन्त', 'अपृच्यध्वम्', 'अपृच्यामहि'],
        'lot_par': ['पिपर्क्तु', 'पिपृग्धि', 'पिपर्चानि', 'पिपृक्ताम्', 'पिपृक्तम्', 'पिपर्चाव', 'पिपृचतु', 'पिपृक्त', 'पिपर्चाम'],
        'lot_pas': ['पृच्यताम्', 'पृच्यस्व', 'पृच्यै', 'पृच्येताम्', 'पृच्येथाम्', 'पृच्यावहै', 'पृच्यन्ताम्', 'पृच्यध्वम्', 'पृच्यामहै'],
        'lit_par': ['पपर्च', 'पपर्चिथ', 'पपर्च', 'पपृचतुः', 'पपृचथुः', 'पपृचिव', 'पपृचुः', 'पपृच', 'पपृचिम'],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
