//
var utils = require('../utils');
var conj = 'six';

var tests = { // by stem
    'tud': { // strike तुद्
        'lat_par': ['तुदति', 'तुदसि', 'तुदामि', 'तुदतः', 'तुदथः', 'तुदावः', 'तुदन्ति', 'तुदथ', 'तुदामः'],
        'lat_atm': ['तुदते', 'तुदसे', 'तुदे', 'तुदेते', 'तुदेथे', 'तुदावहे', 'तुदन्ते', 'तुदध्वे', 'तुदामहे'],
        'lat_pas': ['तुद्यते', 'तुद्यसे', 'तुद्ये', 'तुद्येते', 'तुद्येथे', 'तुद्यावहे', 'तुद्यन्ते', 'तुद्यध्वे', 'तुद्यामहे'],
        'lan_par': ['अतुदत्', 'अतुदः', 'अतुदम्', 'अतुदताम्', 'अतुदतम्', 'अतुदाव', 'अतुदन्', 'अतुदत', 'अतुदाम'],
        'lan_atm': ['अतुदत', 'अतुदथाः', 'अतुदे', 'अतुदेताम्', 'अतुदेथाम्', 'अतुदावहि', 'अतुदन्त', 'अतुदध्वम्', 'अतुदामहि'],
        'lan_pas': ['अतुद्यत', 'अतुद्यथाः', 'अतुद्ये', 'अतुद्येताम्', 'अतुद्येथाम्', 'अतुद्यावहि', 'अतुद्यन्त', 'अतुद्यध्वम्', 'अतुद्यामहि'],
        'lot_par': ['तुदतु', 'तुद', 'तुदानि', 'तुदताम्', 'तुदतम्', 'तुदाव', 'तुदन्तु', 'तुदत', 'तुदाम'],
        'lot_atm': ['तुदताम्', 'तुदस्व', 'तुदै', 'तुदेताम्', 'तुदेथाम्', 'तुदावहै', 'तुदन्ताम्', 'तुदध्वम्', 'तुदामहै'],
        'lot_pas': ['तुद्यताम्', 'तुद्यस्व', 'तुद्यै', 'तुद्येताम्', 'तुद्येथाम्', 'तुद्यावहै', 'तुद्यन्ताम्', 'तुद्यध्वम्', 'तुद्यामहै'],
        'lit_par': ['तुतोद', 'तुतोदिथ', 'तुतोद', 'तुतुदतुः', 'तुतुदथुः', 'तुतुदिव', 'तुतुदुः', 'तुतुद', 'तुतुदिम'],
        'lit_atm': ['तुतुदे', 'तुतुदिषे', 'तुतुदे', 'तुतुदाते', 'तुतुदाथे', 'तुतुदिवहे', 'तुतुदिरे', 'तुतुदिध्वे', 'तुतुदिमहे'],
    },
    'pac': { // cook
        'lat_par': ['पचति', 'पचसि', 'पचामि', 'पचतः', 'पचथः', 'पचावः', 'पचन्ति', 'पचथ', 'पचामः'],
        'lat_atm': ['पचते', 'पचसे', 'पचे', 'पचेते', 'पचेथे', 'पचावहे', 'पचन्ते', 'पचध्वे', 'पचामहे'],
        'lat_pas': ['पच्यते', 'पच्यसे', 'पच्ये', 'पच्येते', 'पच्येथे', 'पच्यावहे', 'पच्यन्ते', 'पच्यध्वे', 'पच्यामहे'],
        'lan_par': ['अपचत्', 'अपचः', 'अपचम्', 'अपचताम्', 'अपचतम्', 'अपचाव', 'अपचन्', 'अपचत', 'अपचाम'],
        'lan_atm': ['अपचत', 'अपचथाः', 'अपचे', 'अपचेताम्', 'अपचेथाम्', 'अपचावहि', 'अपचन्त', 'अपचध्वम्', 'अपचामहि'],
        'lan_pas': ['अपच्यत', 'अपच्यथाः', 'अपच्ये', 'अपच्येताम्', 'अपच्येथाम्', 'अपच्यावहि', 'अपच्यन्त', 'अपच्यध्वम्', 'अपच्यामहि'],
        'lot_par': ['पचतु', 'पच', 'पचानि', 'पचताम्', 'पचतम्', 'पचाव', 'पचन्तु', 'पचत', 'पचाम'],
        'lot_atm': ['पचताम्', 'पचस्व', 'पचै', 'पचेताम्', 'पचेथाम्', 'पचावहै', 'पचन्ताम्', 'पचध्वम्', 'पचामहै'],
        'lot_pas': ['पच्यताम्', 'पच्यस्व', 'पच्यै', 'पच्येताम्', 'पच्येथाम्', 'पच्यावहै', 'पच्यन्ताम्', 'पच्यध्वम्', 'पच्यामहै'],
        'lit_par': ['पपाच', 'पेचिथ | पपक्थ', 'पपाच | पपच', 'पेचतुः', 'पेचथुः', 'पेचिव', 'पेचुः', 'पेच', 'पेचिम'],
        'lit_atm': ['पेचे', 'पेचिषे', 'पेचे', 'पेचाते', 'पेचाथे', 'पेचिवहे', 'पेचिरे', 'पेचिध्वे', 'पेचिमहे'],
    },

    'muc': { // release - मुच्
        'lat_par': ['मुञ्चति', 'मुञ्चसि', 'मुञ्चामि', 'मुञ्चतः', 'मुञ्चथः', 'मुञ्चावः', 'मुञ्चन्ति', 'मुञ्चथ', 'मुञ्चामः'],
        'lat_atm': ['मुञ्चते', 'मुञ्चसे', 'मुञ्चे', 'मुञ्चेते', 'मुञ्चेथे', 'मुञ्चावहे', 'मुञ्चन्ते', 'मुञ्चध्वे', 'मुञ्चामहे'],
        'lat_pas': ['मुच्यते', 'मुच्यसे', 'मुच्ये', 'मुच्येते', 'मुच्येथे', 'मुच्यावहे', 'मुच्यन्ते', 'मुच्यध्वे', 'मुच्यामहे'],
        'lan_par': ['अमुञ्चत्', 'अमुञ्चः', 'अमुञ्चम्', 'अमुञ्चताम्', 'अमुञ्चतम्', 'अमुञ्चाव', 'अमुञ्चन्', 'अमुञ्चत', 'अमुञ्चाम'],
        'lan_atm': ['अमुञ्चत', 'अमुञ्चथाः', 'अमुञ्चे', 'अमुञ्चेताम्', 'अमुञ्चेथाम्', 'अमुञ्चावहि', 'अमुञ्चन्त', 'अमुञ्चध्वम्', 'अमुञ्चामहि'],
        'lan_pas': ['अमुच्यत', 'अमुच्यथाः', 'अमुच्ये', 'अमुच्येताम्', 'अमुच्येथाम्', 'अमुच्यावहि', 'अमुच्यन्त', 'अमुच्यध्वम्', 'अमुच्यामहि'],
        'lot_par': ['मुञ्चतु', 'मुञ्च', 'मुञ्चानि', 'मुञ्चताम्', 'मुञ्चतम्', 'मुञ्चाव', 'मुञ्चन्तु', 'मुञ्चत', 'मुञ्चाम'],
        'lot_atm': ['मुञ्चताम्', 'मुञ्चस्व', 'मुञ्चै', 'मुञ्चेताम्', 'मुञ्चेथाम्', 'मुञ्चावहै', 'मुञ्चन्ताम्', 'मुञ्चध्वम्', 'मुञ्चामहै'],
        'lot_pas': ['मुच्यताम्', 'मुच्यस्व', 'मुच्यै', 'मुच्येताम्', 'मुच्येथाम्', 'मुच्यावहै', 'मुच्यन्ताम्', 'मुच्यध्वम्', 'मुच्यामहै'],
        'lit_par': ['मुमोच', 'मुमोचिथ', 'मुमोच', 'मुमुचतुः', 'मुमुचथुः', 'मुमुचिव', 'मुमुचुः', 'मुमुच', 'मुमुचिम'],
        'lit_atm': ['मुमुचे', 'मुमुचिषे', 'मुमुचे', 'मुमुचाते', 'मुमुचाथे', 'मुमुचिवहे', 'मुमुचिरे', 'मुमुचिध्वे', 'मुमुचिमहे'],
    },

    'vid': { // find, learn - विद्
        'lat_par': ['विन्दति', 'विन्दसि', 'विन्दामि', 'विन्दतः', 'विन्दथः', 'विन्दावः', 'विन्दन्ति', 'विन्दथ', 'विन्दामः'],
        'lat_atm': ['विन्दते', 'विन्दसे', 'विन्दे', 'विन्देते', 'विन्देथे', 'विन्दावहे', 'विन्दन्ते', 'विन्दध्वे', 'विन्दामहे'],
        'lat_pas': ['विद्यते', 'विद्यसे', 'विद्ये', 'विद्येते', 'विद्येथे', 'विद्यावहे', 'विद्यन्ते', 'विद्यध्वे', 'विद्यामहे'],
        'lan_par': ['अविन्दत्', 'अविन्दः', 'अविन्दम्', 'अविन्दताम्', 'अविन्दतम्', 'अविन्दाव', 'अविन्दन्', 'अविन्दत', 'अविन्दाम'],
        'lan_atm': ['अविन्दत', 'अविन्दथाः', 'अविन्दे', 'अविन्देताम्', 'अविन्देथाम्', 'अविन्दावहि', 'अविन्दन्त', 'अविन्दध्वम्', 'अविन्दामहि'],
        'lan_pas': ['अविद्यत', 'अविद्यथाः', 'अविद्ये', 'अविद्येताम्', 'अविद्येथाम्', 'अविद्यावहि', 'अविद्यन्त', 'अविद्यध्वम्', 'अविद्यामहि'],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },

    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],

        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        //'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
