//
var utils = require('../utils');
var lakara = 'vidhilin';

var ganaOne = {
    'BU': { // be
        'lin_par': ['भवेत्', 'भवेः', 'भवेयम्', 'भवेताम्', 'भवेतम्', 'भवेव', 'भवेयुः', 'भवेत', 'भवेम'],
        'lin_pas': ['भूयेत', 'भूयेथाः', 'भूयेय', 'भूयेयाताम्', 'भूयेयाथाम्', 'भूयेवहि', 'भूयेरन्', 'भूयेध्वम्', 'भूयेमहि'],
    },

    'buD': { // to know
        'lin_par': ['बोधेत्', 'बोधेः', 'बोधेयम्', 'बोधेताम्', 'बोधेतम्', 'बोधेव', 'बोधेयुः', 'बोधेत', 'बोधेम'],
        'lin_pas': ['बुध्येत', 'बुध्येथाः', 'बुध्येय', 'बुध्येयाताम्', 'बुध्येयाथाम्', 'बुध्येवहि', 'बुध्येरन्', 'बुध्येध्वम्', 'बुध्येमहि'],
    },

    'smf': { // remember
        'lin_par': ['स्मरेत्', 'स्मरेः', 'स्मरेयम्', 'स्मरेताम्', 'स्मरेतम्', 'स्मरेव', 'स्मरेयुः', 'स्मरेत', 'स्मरेम'],
        'lin_pas': ['स्मर्येत', 'स्मर्येथाः', 'स्मर्येय', 'स्मर्येयाताम्', 'स्मर्येयाथाम्', 'स्मर्येवहि', 'स्मर्येरन्', 'स्मर्येध्वम्', 'स्मर्येमहि'],
    },

    'nI': { // lead
        'lin_par': ['नयेत्', 'नयेः', 'नयेयम्', 'नयेताम्', 'नयेतम्', 'नयेव', 'नयेयुः', 'नयेत', 'नयेम'],
        'lin_atm': ['नयेत', 'नयेथाः', 'नयेय', 'नयेयाताम्', 'नयेयाथाम्', 'नयेवहि', 'नयेरन्', 'नयेध्वम्', 'नयेमहि'],
        'lin_pas': ['नीयेत', 'नीयेथाः', 'नीयेय', 'नीयेयाताम्', 'नीयेयाथाम्', 'नीयेवहि', 'नीयेरन्', 'नीयेध्वम्', 'नीयेमहि'],
    },

    'ruh': { // climb
        'lin_par': ['रोहेत्', 'रोहेः', 'रोहेयम्', 'रोहेताम्', 'रोहेतम्', 'रोहेव', 'रोहेयुः', 'रोहेत', 'रोहेम'],
        'lin_atm': ['रोहेत', 'रोहेथाः', 'रोहेय', 'रोहेयाताम्', 'रोहेयाथाम्', 'रोहेवहि', 'रोहेरन्', 'रोहेध्वम्', 'रोहेमहि'],
        'lin_pas': ['रुह्येत', 'रुह्येथाः', 'रुह्येय', 'रुह्येयाताम्', 'रुह्येयाथाम्', 'रुह्येवहि', 'रुह्येरन्', 'रुह्येध्वम्', 'रुह्येमहि'],
    },

    'vfD': { // grow
        'lin_par': ['वर्धेत्', 'वर्धेः', 'वर्धेयम्', 'वर्धेताम्', 'वर्धेतम्', 'वर्धेव', 'वर्धेयुः', 'वर्धेत', 'वर्धेम'],
        'lin_atm': ['वर्धेत', 'वर्धेथाः', 'वर्धेय', 'वर्धेयाताम्', 'वर्धेयाथाम्', 'वर्धेवहि', 'वर्धेरन्', 'वर्धेध्वम्', 'वर्धेमहि'],
        'lin_pas': ['वृध्येत', 'वृध्येथाः', 'वृध्येय', 'वृध्येयाताम्', 'वृध्येयाथाम्', 'वृध्येवहि', 'वृध्येरन्', 'वृध्येध्वम्', 'वृध्येमहि'],
    },

    'gam': { // go
        'lin_par': ['गच्छेत्', 'गच्छेः', 'गच्छेयम्', 'गच्छेताम्', 'गच्छेतम्', 'गच्छेव', 'गच्छेयुः', 'गच्छेत', 'गच्छेम'],
        'lin_atm': ['गच्छेत', 'गच्छेथाः', 'गच्छेय', 'गच्छेयाताम्', 'गच्छेयाथाम्', 'गच्छेवहि', 'गच्छेरन्', 'गच्छेध्वम्', 'गच्छेमहि'],
        'lin_pas': ['गम्येत', 'गम्येथाः', 'गम्येय', 'गम्येयाताम्', 'गम्येयाथाम्', 'गम्येवहि', 'गम्येरन्', 'गम्येध्वम्', 'गम्येमहि'],
    },

    'sad': { // sit
        'lin_par': ['सीदेत्', 'सीदेः', 'सीदेयम्', 'सीदेताम्', 'सीदेतम्', 'सीदेव', 'सीदेयुः', 'सीदेत', 'सीदेम'],
        'lin_pas': ['सद्येत', 'सद्येथाः', 'सद्येय', 'सद्येयाताम्', 'सद्येयाथाम्', 'सद्येवहि', 'सद्येरन्', 'सद्येध्वम्', 'सद्येमहि'],
    },

    // dfS - не определился словарь, оч. много вариантов, есть darSayati, но нет dfSati
    'sTA': { // stand
        'lin_par': ['तिष्ठेत्', 'तिष्ठेः', 'तिष्ठेयम्', 'तिष्ठेताम्', 'तिष्ठेतम्', 'तिष्ठेव', 'तिष्ठेयुः', 'तिष्ठेत', 'तिष्ठेम'],
        'lin_atm': ['तिष्ठेत', 'तिष्ठेथाः', 'तिष्ठेय', 'तिष्ठेयाताम्', 'तिष्ठेयाथाम्', 'तिष्ठेवहि', 'तिष्ठेरन्', 'तिष्ठेध्वम्', 'तिष्ठेमहि'],
        'lin_pas': ['स्थीयेत', 'स्थीयेथाः', 'स्थीयेय', 'स्थीयेयाताम्', 'स्थीयेयाथाम्', 'स्थीयेवहि', 'स्थीयेरन्', 'स्थीयेध्वम्', 'स्थीयेमहि'],
    },

    'pA': { // drink
        'lin_par': ['पिबेत्', 'पिबेः', 'पिबेयम्', 'पिबेताम्', 'पिबेतम्', 'पिबेव', 'पिबेयुः', 'पिबेत', 'पिबेम'],
        'lin_pas': ['पीयेत', 'पीयेथाः', 'पीयेय', 'पीयेयाताम्', 'पीयेयाथाम्', 'पीयेवहि', 'पीयेरन्', 'पीयेध्वम्', 'पीयेमहि'],
    },

    'iz': { // seek
        'lin_par': ['एषेत्', 'एषेः', 'एषेयम्', 'एषेताम्', 'एषेतम्', 'एषेव', 'एषेयुः', 'एषेत', 'एषेम'],
        'lin_atm': ['एषेत', 'एषेथाः', 'एषेय', 'एषेयाताम्', 'एषेयाथाम्', 'एषेवहि', 'एषेरन्', 'एषेध्वम्', 'एषेमहि'],
        'lin_pas': ['इष्येत', 'इष्येथाः', 'इष्येय', 'इष्येयाताम्', 'इष्येयाथाम्', 'इष्येवहि', 'इष्येरन्', 'इष्येध्वम्', 'इष्येमहि'],
    },

    'gE': { // sing
        'lin_par': ['गायेत्', 'गायेः', 'गायेयम्', 'गायेताम्', 'गायेतम्', 'गायेव', 'गायेयुः', 'गायेत', 'गायेम'],
        'lin_atm': ['गायेत', 'गायेथाः', 'गायेय', 'गायेयाताम्', 'गायेयाथाम्', 'गायेवहि', 'गायेरन्', 'गायेध्वम्', 'गायेमहि'],
        'lin_pas': ['गीयेत', 'गीयेथाः', 'गीयेय', 'गीयेयाताम्', 'गीयेयाथाम्', 'गीयेवहि', 'गीयेरन्', 'गीयेध्वम्', 'गीयेमहि'],
    },
}

// two
var ganaTwo = {
    'As': {
        'lin_par': ['आसीत', 'आसीथाः', 'आसीय', 'आसीयाताम्', 'आसीयाथाम्', 'आसीवहि', 'आसीरन्', 'आसीध्वम्', 'आसीमहि'],
        'lin_pas': ['आस्येत', 'आस्येथाः', 'आस्येय', 'आस्येयाताम्', 'आस्येयाथाम्', 'आस्येवहि', 'आस्येरन्', 'आस्येध्वम्', 'आस्येमहि'],
    },

    'ad': { // to eat
        'lin_par': ['अद्यात्', 'अद्याः', 'अद्याम्', 'अद्याताम्', 'अद्यातम्', 'अद्याव', 'अद्युः', 'अद्यात', 'अद्याम'],
        'lin_pas': ['अद्येत', 'अद्येथाः', 'अद्येय', 'अद्येयाताम्', 'अद्येयाथाम्', 'अद्येवहि', 'अद्येरन्', 'अद्येध्वम्', 'अद्येमहि'],
    },

    'as': {
        'lin_par': ['स्यात्', 'स्याः', 'स्याम्', 'स्याताम्', 'स्यातम्', 'स्याव', 'स्युः', 'स्यात', 'स्याम'],
    },

    'brU': {
        'lin_par': ['ब्रूयात्-ब्रुयात्', 'ब्रूयाः', 'ब्रूयाम्', 'ब्रूयाताम्', 'ब्रूयातम्', 'ब्रूयाव', 'ब्रूयुः', 'ब्रूयात', 'ब्रूयाम'],
        'lin_atm': ['ब्रुवीत', 'ब्रुवीथाः', 'ब्रुवीय', 'ब्रुवीयाताम्', 'ब्रुवीयाथाम्', 'ब्रुवीवहि', 'ब्रुवीरन्', 'ब्रुवीध्वम्', 'ब्रुवीमहि'],
        'lin_pas': ['ब्रूयेत', 'ब्रूयेथाः', 'ब्रूयेय', 'ब्रूयेयाताम्', 'ब्रूयेयाथाम्', 'ब्रूयेवहि', 'ब्रूयेरन्', 'ब्रूयेध्वम्', 'ब्रूयेमहि'],
    },

    'duh': {
        'lin_par': ['दुह्यात्', 'दुह्याः', 'दुह्याम्', 'दुह्याताम्', 'दुह्यातम्', 'दुह्याव', 'दुह्युः', 'दुह्यात', 'दुह्याम'],
        'lin_atm': ['दुहीत', 'दुहीथाः', 'दुहीय', 'दुहीयाताम्', 'दुहीयाथाम्', 'दुहीवहि', 'दुहीरन्', 'दुहीध्वम्', 'दुहीमहि'],
        'lin_pas': ['दुह्येत', 'दुह्येथाः', 'दुह्येय', 'दुह्येयाताम्', 'दुह्येयाथाम्', 'दुह्येवहि', 'दुह्येरन्', 'दुह्येध्वम्', 'दुह्येमहि'],
    },

    'han': {
        'lin_par': ['हन्यात्', 'हन्याः', 'हन्याम्', 'हन्याताम्', 'हन्यातम्', 'हन्याव', 'हन्युः', 'हन्यात', 'हन्याम'],
        'lin_atm': ['घ्नीत', 'घ्नीथाः', 'घ्नीय', 'घ्नीयाताम्', 'घ्नीयाथाम्', 'घ्नीवहि', 'घ्नीरन्', 'घ्नीध्वम्', 'घ्नीमहि'],
        'lin_pas': ['हन्येत', 'हन्येथाः', 'हन्येय', 'हन्येयाताम्', 'हन्येयाथाम्', 'हन्येवहि', 'हन्येरन्', 'हन्येध्वम्', 'हन्येमहि'],
    },

    'i': {
        'lin_par': ['इयात्', 'इयाः', 'इयाम्', 'इयाताम्', 'इयातम्', 'इयाव', 'इयुः', 'इयात', 'इयाम'],
        'lin_atm': ['ईत', 'ईथाः', 'ईय', 'ईयाताम्', 'ईयाथाम्', 'ईवहि', 'ईरन्', 'ईध्वम्', 'ईमहि'],
        'lin_pas': ['ईयेत', 'ईयेथाः', 'ईयेय', 'ईयेयाताम्', 'ईयेयाथाम्', 'ईयेवहि', 'ईयेरन्', 'ईयेध्वम्', 'ईयेमहि'],
    },

    'lih': {
        'lin_par': ['लिह्यात्', 'लिह्याः', 'लिह्याम्', 'लिह्याताम्', 'लिह्यातम्', 'लिह्याव', 'लिह्युः', 'लिह्यात', 'लिह्याम'],
        'lin_atm': ['लिहीत', 'लिहीथाः', 'लिहीय', 'लिहीयाताम्', 'लिहीयाथाम्', 'लिहीवहि', 'लिहीरन्', 'लिहीध्वम्', 'लिहीमहि'],
        'lin_pas': ['लिह्येत', 'लिह्येथाः', 'लिह्येय', 'लिह्येयाताम्', 'लिह्येयाथाम्', 'लिह्येवहि', 'लिह्येरन्', 'लिह्येध्वम्', 'लिह्येमहि'],
    },

    'nu': {
        'lin_par': ['नुयात्', 'नुयाः', 'नुयाम्', 'नुयाताम्', 'नुयातम्', 'नुयाव', 'नुयुः', 'नुयात', 'नुयाम'],
        'lin_atm': ['नुवीत', 'नुवीथाः', 'नुवीय', 'नुवीयाताम्', 'नुवीयाथाम्', 'नुवीवहि', 'नुवीरन्', 'नुवीध्वम्', 'नुवीमहि'],
        'lin_pas': ['नूयेत', 'नूयेथाः', 'नूयेय', 'नूयेयाताम्', 'नूयेयाथाम्', 'नूयेवहि', 'नूयेरन्', 'नूयेध्वम्', 'नूयेमहि'],
    },

    'pA': {
        'lin_par': ['पायात्', 'पायाः', 'पायाम्', 'पायाताम्', 'पायातम्', 'पायाव', 'पायुः', 'पायात', 'पायाम'],
    },

    'rud': { // cry
        'lin_par': ['रुद्यात्', 'रुद्याः', 'रुद्याम्', 'रुद्याताम्', 'रुद्यातम्', 'रुद्याव', 'रुद्युः', 'रुद्यात', 'रुद्याम'],
        'lin_pas': ['रुद्येत', 'रुद्येथाः', 'रुद्येय', 'रुद्येयाताम्', 'रुद्येयाथाम्', 'रुद्येवहि', 'रुद्येरन्', 'रुद्येध्वम्', 'रुद्येमहि'],
    },

    'svap': {
        'lin_par': ['स्वप्यात्', 'स्वप्याः', 'स्वप्याम्', 'स्वप्याताम्', 'स्वप्यातम्', 'स्वप्याव', 'स्वप्युः', 'स्वप्यात', 'स्वप्याम'],
        'lin_pas': ['सुप्येत', 'सुप्येथाः', 'सुप्येय', 'सुप्येयाताम्', 'सुप्येयाथाम्', 'सुप्येवहि', 'सुप्येरन्', 'सुप्येध्वम्', 'सुप्येमहि'],
    },

    'vac': { // speak
        'lin_par': ['वच्यात्', 'वच्याः', 'वच्याम्', 'वच्याताम्', 'वच्यातम्', 'वच्याव', 'वच्युः', 'वच्यात', 'वच्याम'],
        'lin_pas': ['उच्येत', 'उच्येथाः', 'उच्येय', 'उच्येयाताम्', 'उच्येयाथाम्', 'उच्येवहि', 'उच्येरन्', 'उच्येध्वम्', 'उच्येमहि'],
    },

    'vid': {
        'lin_par': ['विद्यात्', 'विद्याः', 'विद्याम्', 'विद्याताम्', 'विद्यातम्', 'विद्याव', 'विद्युः', 'विद्यात', 'विद्याम'],
        'lin_pas': ['विद्येत', 'विद्येथाः', 'विद्येय', 'विद्येयाताम्', 'विद्येयाथाम्', 'विद्येवहि', 'विद्येरन्', 'विद्येध्वम्', 'विद्येमहि'],
    },

    'yA': { // go
        'lin_par': ['यायात्', 'यायाः', 'यायाम्', 'यायाताम्', 'यायातम्', 'यायाव', 'यायुः', 'यायात', 'यायाम'],
        'lin_pas': ['ईयेत', 'ईयेथाः', 'ईयेय', 'ईयेयाताम्', 'ईयेयाथाम्', 'ईयेवहि', 'ईयेरन्', 'ईयेध्वम्', 'ईयेमहि'],
    },
}

// three
var ganaTree = {
    'hu': { // sacrifice
        'lin_par': ['जुहुयात्', 'जुहुयाः', 'जुहुयाम्', 'जुहुयाताम्', 'जुहुयातम्', 'जुहुयाव', 'जुहुयुः', 'जुहुयात', 'जुहुयाम'],
        'lin_pas': ['हूयेत', 'हूयेथाः', 'हूयेय', 'हूयेयाताम्', 'हूयेयाथाम्', 'हूयेवहि', 'हूयेरन्', 'हूयेध्वम्', 'हूयेमहि'],
    },

    'BI': { // fear
        'lin_par': ['बिभीयात्', 'बिभीयाः', 'बिभीयाम्', 'बिभीयाताम्', 'बिभीयातम्', 'बिभीयाव', 'बिभीयुः', 'बिभीयात', 'बिभीयाम'],
        'lin_pas': ['भीयेत', 'भीयेथाः', 'भीयेय', 'भीयेयाताम्', 'भीयेयाथाम्', 'भीयेवहि', 'भीयेरन्', 'भीयेध्वम्', 'भीयेमहि'],
    },

    'dA': { // give
        'lin_par': ['दद्यात्', 'दद्याः', 'दद्याम्', 'दद्याताम्', 'दद्यातम्', 'दद्याव', 'दद्युः', 'दद्यात', 'दद्याम'],
        'lin_atm': ['ददीत', 'ददीथाः', 'ददीय', 'ददीयाताम्', 'ददीयाथाम्', 'ददीवहि', 'ददीरन्', 'ददीध्वम्', 'ददीमहि'],
        'lin_pas': ['दीयेत', 'दीयेथाः', 'दीयेय', 'दीयेयाताम्', 'दीयेयाथाम्', 'दीयेवहि', 'दीयेरन्', 'दीयेध्वम्', 'दीयेमहि'],
    },

    'DA': { // place, put
        'lin_par': ['', '', '', '', '', '', '', '', ''],
        'lin_atm': ['', '', '', '', '', '', '', '', ''],
        'lin_pas': ['', '', '', '', '', '', '', '', ''],
    },

    'mA': { // measure
        'lin_atm': ['मिमीत', 'मिमीथाः', 'मिमीय', 'मिमीयाताम्', 'मिमीयाथाम्', 'मिमीवहि', 'मिमीरन्', 'मिमीध्वम्', 'मिमीमहि'],
        'lin_pas': ['मीयेत', 'मीयेथाः', 'मीयेय', 'मीयेयाताम्', 'मीयेयाथाम्', 'मीयेवहि', 'मीयेरन्', 'मीयेध्वम्', 'मीयेमहि'],
    },

    'hA': { // leave, abandon
        'lin_par': ['जह्यात्', 'जह्याः', 'जह्याम्', 'जह्याताम्', 'जह्यातम्', 'जह्याव', 'जह्युः', 'जह्यात', 'जह्याम'],
        'lin_pas': ['हीयेत', 'हीयेथाः', 'हीयेय', 'हीयेयाताम्', 'हीयेयाथाम्', 'हीयेवहि', 'हीयेरन्', 'हीयेध्वम्', 'हीयेमहि'],
    },

    'cit': { // to perceive
        'lin_par': ['चिचित्यात्', 'चिचित्याः', 'चिचित्याम्', 'चिचित्याताम्', 'चिचित्यातम्', 'चिचित्याव', 'चिचित्युः', 'चिचित्यात', 'चिचित्याम'],
        'lin_atm': ['चिचितीत', 'चिचितीथाः', 'चिचितीय', 'चिचितीयाताम्', 'चिचितीयाथाम्', 'चिचितीवहि', 'चिचितीरन्', 'चिचितीध्वम्', 'चिचितीमहि'],
        'lin_pas': ['चित्येत', 'चित्येथाः', 'चित्येय', 'चित्येयाताम्', 'चित्येयाथाम्', 'चित्येवहि', 'चित्येरन्', 'चित्येध्वम्', 'चित्येमहि'],
    },

    'Bf': { // carry, bear
        'lin_par': ['बिभृयात्', 'बिभृयाः', 'बिभृयाम्', 'बिभृयाताम्', 'बिभृयातम्', 'बिभृयाव', 'बिभृयुः', 'बिभृयात', 'बिभृयाम'],
        'lin_atm': ['बिभ्रीत', 'बिभ्रीथाः', 'बिभ्रीय', 'बिभ्रीयाताम्', 'बिभ्रीयाथाम्', 'बिभ्रीवहि', 'बिभ्रीरन्', 'बिभ्रीध्वम्', 'बिभ्रीमहि'],
        'lin_pas': ['भ्रियेत', 'भ्रियेथाः', 'भ्रियेय', 'भ्रियेयाताम्', 'भ्रियेयाथाम्', 'भ्रियेवहि', 'भ्रियेरन्', 'भ्रियेध्वम्', 'भ्रियेमहि'],
    },

    'pfc': { // mix
        'lin_par': ['पिपृच्यात्', 'पिपृच्याः', 'पिपृच्याम्', 'पिपृच्याताम्', 'पिपृच्यातम्', 'पिपृच्याव', 'पिपृच्युः', 'पिपृच्यात', 'पिपृच्याम'],
        'lin_pas': ['पृच्येत', 'पृच्येथाः', 'पृच्येय', 'पृच्येयाताम्', 'पृच्येयाथाम्', 'पृच्येवहि', 'पृच्येरन्', 'पृच्येध्वम्', 'पृच्येमहि'],
    },
}

// four
var ganaFour = {
    'div': { // play, shine // уже поправлено в словарях
        'lin_par': ['दिव्येत्', 'दिव्येः', 'दिव्येयम्', 'दिव्येताम्', 'दिव्येतम्', 'दिव्येव', 'दिव्येयुः', 'दिव्येत', 'दिव्येम'],
        'lin_atm': ['दिव्येत', 'दिव्येथाः', 'दिव्येय', 'दिव्येयाताम्', 'दिव्येयाथाम्', 'दिव्येवहि', 'दिव्येरन्', 'दिव्येध्वम्', 'दिव्येमहि'],
        'lin_pas': ['दिव्येत', 'दिव्येथाः', 'दिव्येय', 'दिव्येयाताम्', 'दिव्येयाथाम्', 'दिव्येवहि', 'दिव्येरन्', 'दिव्येध्वम्', 'दिव्येमहि'],
    },

    'naS': { // to be gone, go to nothing, dissapiar
        'lin_par': ['नश्येत्', 'नश्येः', 'नश्येयम्', 'नश्येताम्', 'नश्येतम्', 'नश्येव', 'नश्येयुः', 'नश्येत', 'नश्येम'],
        'lin_pas': ['नश्येत', 'नश्येथाः', 'नश्येय', 'नश्येयाताम्', 'नश्येयाथाम्', 'नश्येवहि', 'नश्येरन्', 'नश्येध्वम्', 'नश्येमहि'],
    },

    'kup': { // be angry
        'lin_par': ['कुप्येत्', 'कुप्येः', 'कुप्येयम्', 'कुप्येताम्', 'कुप्येतम्', 'कुप्येव', 'कुप्येयुः', 'कुप्येत', 'कुप्येम'],
        'lin_pas': ['कुप्येत', 'कुप्येथाः', 'कुप्येय', 'कुप्येयाताम्', 'कुप्येयाथाम्', 'कुप्येवहि', 'कुप्येरन्', 'कुप्येध्वम्', 'कुप्येमहि'],
    },

    'kruD': { // to become angry
        'lin_par': ['क्रुध्येत्', 'क्रुध्येः', 'क्रुध्येयम्', 'क्रुध्येताम्', 'क्रुध्येतम्', 'क्रुध्येव', 'क्रुध्येयुः', 'क्रुध्येत', 'क्रुध्येम'],
        'lin_atm': ['क्रुध्येत', 'क्रुध्येथाः', 'क्रुध्येय', 'क्रुध्येयाताम्', 'क्रुध्येयाथाम्', 'क्रुध्येवहि', 'क्रुध्येरन्', 'क्रुध्येध्वम्', 'क्रुध्येमहि'],
        'lin_pas': ['क्रुध्येत', 'क्रुध्येथाः', 'क्रुध्येय', 'क्रुध्येयाताम्', 'क्रुध्येयाथाम्', 'क्रुध्येवहि', 'क्रुध्येरन्', 'क्रुध्येध्वम्', 'क्रुध्येमहि'],
    },

    'man': { // think
        'lin_par': ['मन्येत्', 'मन्येः', 'मन्येयम्', 'मन्येताम्', 'मन्येतम्', 'मन्येव', 'मन्येयुः', 'मन्येत', 'मन्येम'],
        'lin_atm': ['मन्येत', 'मन्येथाः', 'मन्येय', 'मन्येयाताम्', 'मन्येयाथाम्', 'मन्येवहि', 'मन्येरन्', 'मन्येध्वम्', 'मन्येमहि'],
        'lin_pas': ['मन्येत', 'मन्येथाः', 'मन्येय', 'मन्येयाताम्', 'मन्येयाथाम्', 'मन्येवहि', 'मन्येरन्', 'मन्येध्वम्', 'मन्येमहि'],
    },

    'nft': { // dance
        'lin_par': ['नृत्येत्', 'नृत्येः', 'नृत्येयम्', 'नृत्येताम्', 'नृत्येतम्', 'नृत्येव', 'नृत्येयुः', 'नृत्येत', 'नृत्येम'],
        'lin_pas': ['नृत्येत', 'नृत्येथाः', 'नृत्येय', 'नृत्येयाताम्', 'नृत्येयाथाम्', 'नृत्येवहि', 'नृत्येरन्', 'नृत्येध्वम्', 'नृत्येमहि'],
    },
}

// five
var ganaFive = {
    'su': { // press
        'lin_par': ['सुनुयात्', 'सुनुयाः', 'सुनुयाम्', 'सुनुयाताम्', 'सुनुयातम्', 'सुनुयाव', 'सुनुयुः', 'सुनुयात', 'सुनुयाम'],
        'lin_atm': ['सुन्वीत', 'सुन्वीथाः', 'सुन्वीय', 'सुन्वीयाताम्', 'सुन्वीयाथाम्', 'सुन्वीवहि', 'सुन्वीरन्', 'सुन्वीध्वम्', 'सुन्वीमहि'],
        'lin_pas': ['सूयेत', 'सूयेथाः', 'सूयेय', 'सूयेयाताम्', 'सूयेयाथाम्', 'सूयेवहि', 'सूयेरन्', 'सूयेध्वम्', 'सूयेमहि'],
    },

    'Ap': { // obtain
        'lin_par': ['आप्नुयात्', 'आप्नुयाः', 'आप्नुयाम्', 'आप्नुयाताम्', 'आप्नुयातम्', 'आप्नुयाव', 'आप्नुयुः', 'आप्नुयात', 'आप्नुयाम'],
        'lin_pas': ['आप्येत', 'आप्येथाः', 'आप्येय', 'आप्येयाताम्', 'आप्येयाथाम्', 'आप्येवहि', 'आप्येरन्', 'आप्येध्वम्', 'आप्येमहि'],
    },

    'Sak': { // to be able
        'lin_par': ['शक्नुयात्', 'शक्नुयाः', 'शक्नुयाम्', 'शक्नुयाताम्', 'शक्नुयातम्', 'शक्नुयाव', 'शक्नुयुः', 'शक्नुयात', 'शक्नुयाम'],
        'lin_pas': ['शक्येत', 'शक्येथाः', 'शक्येय', 'शक्येयाताम्', 'शक्येयाथाम्', 'शक्येवहि', 'शक्येरन्', 'शक्येध्वम्', 'शक्येमहि'],
    },

    'ci': { // collect
        'lin_par': ['चिनुयात्', 'चिनुयाः', 'चिनुयाम्', 'चिनुयाताम्', 'चिनुयातम्', 'चिनुयाव', 'चिनुयुः', 'चिनुयात', 'चिनुयाम'],
        'lin_atm': ['चिन्वीत', 'चिन्वीथाः', 'चिन्वीय', 'चिन्वीयाताम्', 'चिन्वीयाथाम्', 'चिन्वीवहि', 'चिन्वीरन्', 'चिन्वीध्वम्', 'चिन्वीमहि'],
        'lin_pas': ['चीयेत', 'चीयेथाः', 'चीयेय', 'चीयेयाताम्', 'चीयेयाथाम्', 'चीयेवहि', 'चीयेरन्', 'चीयेध्वम्', 'चीयेमहि'],
    },

    'Sru': { // listen, learn
        'lin_par': ['शृणुयात्', 'शृणुयाः', 'शृणुयाम्', 'शृणुयाताम्', 'शृणुयातम्', 'शृणुयाव', 'शृणुयुः', 'शृणुयात', 'शृणुयाम'],
        'lin_pas': ['श्रूयेत', 'श्रूयेथाः', 'श्रूयेय', 'श्रूयेयाताम्', 'श्रूयेयाथाम्', 'श्रूयेवहि', 'श्रूयेरन्', 'श्रूयेध्वम्', 'श्रूयेमहि'],
    },

    'aS': { // eat, enjoy
        'lin_atm': ['अश्नुवीत', 'अश्नुवीथाः', 'अश्नुवीय', 'अश्नुवीयाताम्', 'अश्नुवीयाथाम्', 'अश्नुवीवहि', 'अश्नुवीरन्', 'अश्नुवीध्वम्', 'अश्नुवीमहि'],
        'lin_pas': ['अश्येत', 'अश्येथाः', 'अश्येय', 'अश्येयाताम्', 'अश्येयाथाम्', 'अश्येवहि', 'अश्येरन्', 'अश्येध्वम्', 'अश्येमहि'],
    },
}

// six
var ganaSix = {
   'tud': { // strike तुद्
       'lin_par': ['तुदेत्', 'तुदेः', 'तुदेयम्', 'तुदेताम्', 'तुदेतम्', 'तुदेव', 'तुदेयुः', 'तुदेत', 'तुदेम'],
       'lin_atm': ['तुदेत', 'तुदेथाः', 'तुदेय', 'तुदेयाताम्', 'तुदेयाथाम्', 'तुदेवहि', 'तुदेरन्', 'तुदेध्वम्', 'तुदेमहि'],
       'lin_pas': ['तुद्येत', 'तुद्येथाः', 'तुद्येय', 'तुद्येयाताम्', 'तुद्येयाथाम्', 'तुद्येवहि', 'तुद्येरन्', 'तुद्येध्वम्', 'तुद्येमहि'],
    },

    'pac': { // cook
        'lin_par': ['पचेत्', 'पचेः', 'पचेयम्', 'पचेताम्', 'पचेतम्', 'पचेव', 'पचेयुः', 'पचेत', 'पचेम'],
        'lin_atm': ['पचेत', 'पचेथाः', 'पचेय', 'पचेयाताम्', 'पचेयाथाम्', 'पचेवहि', 'पचेरन्', 'पचेध्वम्', 'पचेमहि'],
        'lin_pas': ['पच्येत', 'पच्येथाः', 'पच्येय', 'पच्येयाताम्', 'पच्येयाथाम्', 'पच्येवहि', 'पच्येरन्', 'पच्येध्वम्', 'पच्येमहि'],
    },

    'muc': { // release - मुच्
        'lin_par': ['मुञ्चेत्', 'मुञ्चेः', 'मुञ्चेयम्', 'मुञ्चेताम्', 'मुञ्चेतम्', 'मुञ्चेव', 'मुञ्चेत', 'मुञ्चेथाः', 'मुञ्चेय'],
        'lin_atm': ['मुञ्चेयाताम्', 'मुञ्चेयाथाम्', 'मुञ्चेवहि', 'मुञ्चेरन्', 'मुञ्चेध्वम्', 'मुञ्चेमहि', 'मुच्येत', 'मुच्येथाः', 'मुच्येय'],
        'lin_pas': ['मुच्येयाताम्', 'मुच्येयाथाम्', 'मुच्येवहि', 'मुच्येरन्', 'मुच्येध्वम्', 'मुच्येमहि', 'मुच्येरन्', 'मुच्येध्वम्', 'मुच्येमहि'],
    },

    'vid': { // find, learn - विद्
        'lin_par': ['विन्देत्', 'विन्देः', 'विन्देयम्', 'विन्देताम्', 'विन्देतम्', 'विन्देव', 'विन्देयुः', 'विन्देत', 'विन्देम'],
        'lin_atm': ['विन्देत', 'विन्देथाः', 'विन्देय', 'विन्देयाताम्', 'विन्देयाथाम्', 'विन्देवहि', 'विन्देरन्', 'विन्देध्वम्', 'विन्देमहि'],
        'lin_pas': ['विद्येत', 'विद्येथाः', 'विद्येय', 'विद्येयाताम्', 'विद्येयाथाम्', 'विद्येवहि', 'विद्येरन्', 'विद्येध्वम्', 'विद्येमहि'],
    },
}

// seven
var ganaSeven = {
    'ruD': { // obstruct
        'lin_par': ['रुन्ध्यात्', 'रुन्ध्याः', 'रुन्ध्याम्', 'रुन्ध्याताम्', 'रुन्ध्यातम्', 'रुन्ध्याव', 'रुन्ध्युः', 'रुन्ध्यात', 'रुन्ध्याम'],
        'lin_atm': ['रुन्धीत', 'रुन्धीथाः', 'रुन्धीय', 'रुन्धीयाताम्', 'रुन्धीयाथाम्', 'रुन्धीवहि', 'रुन्धीरन्', 'रुन्धीध्वम्', 'रुन्धीमहि'],
        'lin_pas': ['रुध्येत', 'रुध्येथाः', 'रुध्येय', 'रुध्येयाताम्', 'रुध्येयाथाम्', 'रुध्येवहि', 'रुध्येरन्', 'रुध्येध्वम्', 'रुध्येमहि'],
    },

    'yuj': { // join
        'lin_par': ['युञ्ज्यात्', 'युञ्ज्याः', 'युञ्ज्याम्', 'युञ्ज्याताम्', 'युञ्ज्यातम्', 'युञ्ज्याव', 'युञ्ज्युः', 'युञ्ज्यात', 'युञ्ज्याम'],
        'lin_atm': ['युञ्जीत', 'युञ्जीथाः', 'युञ्जीय', 'युञ्जीयाताम्', 'युञ्जीयाथाम्', 'युञ्जीवहि', 'युञ्जीरन्', 'युञ्जीध्वम्', 'युञ्जीमहि'],
        'lin_pas': ['युज्येत', 'युज्येथाः', 'युज्येय', 'युज्येयाताम्', 'युज्येयाथाम्', 'युज्येवहि', 'युज्येरन्', 'युज्येध्वम्', 'युज्येमहि'],
    },

    'Bid': { // destroy
        'lin_par': ['भिन्द्यात्', 'भिन्द्याः', 'भिन्द्याम्', 'भिन्द्याताम्', 'भिन्द्यातम्', 'भिन्द्याव', 'भिन्द्युः', 'भिन्द्यात', 'भिन्द्याम'],
        'lin_atm': ['भिन्दीत', 'भिन्दीथाः', 'भिन्दीय', 'भिन्दीयाताम्', 'भिन्दीयाथाम्', 'भिन्दीवहि', 'भिन्दीरन्', 'भिन्दीध्वम्', 'भिन्दीमहि'],
        'lin_pas': ['भिद्येत', 'भिद्येथाः', 'भिद्येय', 'भिद्येयाताम्', 'भिद्येयाथाम्', 'भिद्येवहि', 'भिद्येरन्', 'भिद्येध्वम्', 'भिद्येमहि'],
    },

    'piz': { // crush - पिष्
        'lin_par': ['पिंष्यात्', 'पिंष्याः', 'पिंष्याम्', 'पिंष्याताम्', 'पिंष्यातम्', 'पिंष्याव', 'पिंष्युः', 'पिंष्यात', 'पिंष्याम'],
        'lin_pas': ['पिष्येत', 'पिष्येथाः', 'पिष्येय', 'पिष्येयाताम्', 'पिष्येयाथाम्', 'पिष्येवहि', 'पिष्येरन्', 'पिष्येध्वम्', 'पिष्येमहि'],
    },

    'hiMs': { // kill
        'lin_par': ['हिंष्यात्', 'हिंष्याः', 'हिंष्याम्', 'हिंष्याताम्', 'हिंष्यातम्', 'हिंष्याव', 'हिंष्युः', 'हिंष्यात', 'हिंष्याम'],
        'lin_pas': ['हिंस्येत', 'हिंस्येथाः', 'हिंस्येय', 'हिंस्येयाताम्', 'हिंस्येयाथाम्', 'हिंस्येवहि', 'हिंस्येरन्', 'हिंस्येध्वम्', 'हिंस्येमहि'],
    },

    'ric': { // to empty - रिच्
        'lin_par': ['रिञ्च्यात्', 'रिञ्च्याः', 'रिञ्च्याम्', 'रिञ्च्याताम्', 'रिञ्च्यातम्', 'रिञ्च्याव', 'रिञ्च्युः', 'रिञ्च्यात', 'रिञ्च्याम'],
        'lin_atm': ['रिञ्चीत', 'रिञ्चीथाः', 'रिञ्चीय', 'रिञ्चीयाताम्', 'रिञ्चीयाथाम्', 'रिञ्चीवहि', 'रिञ्चीरन्', 'रिञ्चीध्वम्', 'रिञ्चीमहि'],
        'lin_pas': ['रिच्येत', 'रिच्येथाः', 'रिच्येय', 'रिच्येयाताम्', 'रिच्येयाथाम्', 'रिच्येवहि', 'रिच्येरन्', 'रिच्येध्वम्', 'रिच्येमहि'],
    },

    'Cid': { // cut
        'lin_par': ['छिन्द्यात्', 'छिन्द्याः', 'छिन्द्याम्', 'छिन्द्याताम्', 'छिन्द्यातम्', 'छिन्द्याव', 'छिन्द्युः', 'छिन्द्यात', 'छिन्द्याम'],
        'lin_atm': ['छिन्दीत', 'छिन्दीथाः', 'छिन्दीय', 'छिन्दीयाताम्', 'छिन्दीयाथाम्', 'छिन्दीवहि', 'छिन्दीरन्', 'छिन्दीध्वम्', 'छिन्दीमहि'],
        'lin_pas': ['छिद्येत', 'छिद्येथाः', 'छिद्येय', 'छिद्येयाताम्', 'छिद्येयाथाम्', 'छिद्येवहि', 'छिद्येरन्', 'छिद्येध्वम्', 'छिद्येमहि'],
    },

    'Buj': { // protect, A to eat, enjoy
        'lin_par': ['भुञ्ज्यात्', 'भुञ्ज्याः', 'भुञ्ज्याम्', 'भुञ्ज्याताम्', 'भुञ्ज्यातम्', 'भुञ्ज्याव', 'भुञ्ज्युः', 'भुञ्ज्यात', 'भुञ्ज्याम'],
        'lin_atm': ['भुञ्जीत', 'भुञ्जीथाः', 'भुञ्जीय', 'भुञ्जीयाताम्', 'भुञ्जीयाथाम्', 'भुञ्जीवहि', 'भुञ्जीरन्', 'भुञ्जीध्वम्', 'भुञ्जीमहि'],
        'lin_pas': ['भुज्येत', 'भुज्येथाः', 'भुज्येय', 'भुज्येयाताम्', 'भुज्येयाथाम्', 'भुज्येवहि', 'भुज्येरन्', 'भुज्येध्वम्', 'भुज्येमहि'],
    },

    'pfc': { // mix
        'lin_par': ['पृञ्च्यात्', 'पृञ्च्याः', 'पृञ्च्याम्', 'पृञ्च्याताम्', 'पृञ्च्यातम्', 'पृञ्च्याव', 'पृञ्च्युः', 'पृञ्च्यात', 'पृञ्च्याम'],
        'lin_pas': ['पृच्येत', 'पृच्येथाः', 'पृच्येय', 'पृच्येयाताम्', 'पृच्येयाथाम्', 'पृच्येवहि', 'पृच्येरन्', 'पृच्येध्वम्', 'पृच्येमहि'],
    },

    'tfh': { // crush
        'lin_par': ['तृंह्यात्', 'तृंह्याः', 'तृंह्याम्', 'तृंह्याताम्', 'तृंह्यातम्', 'तृंह्याव', 'तृंह्युः', 'तृंह्यात', 'तृंह्याम'],
        'lin_atm': ['तृंहीत', 'तृंहीथाः', 'तृंहीय', 'तृंहीयाताम्', 'तृंहीयाथाम्', 'तृंहीवहि', 'तृंहीरन्', 'तृंहीध्वम्', 'तृंहीमहि'],
        'lin_pas': ['तृह्येत', 'तृह्येथाः', 'तृह्येय', 'तृह्येयाताम्', 'तृह्येयाथाम्', 'तृह्येवहि', 'तृह्येरन्', 'तृह्येध्वम्', 'तृह्येमहि'],
    },
}

// eight
var ganaEight = {
    'tan': { // extend
        'lin_par': ['तनुयात्', 'तनुयाः', 'तनुयाम्', 'तनुयाताम्', 'तनुयातम्', 'तनुयाव', 'तनुयुः', 'तनुयात', 'तनुयाम'],
        'lin_atm': ['तन्वीत', 'तन्वीथाः', 'तन्वीय', 'तन्वीयाताम्', 'तन्वीयाथाम्', 'तन्वीवहि', 'तन्वीरन्', 'तन्वीध्वम्', 'तन्वीमहि'],
        'lin_pas': ['तन्येत', 'तन्येथाः', 'तन्येय', 'तन्येयाताम्', 'तन्येयाथाम्', 'तन्येवहि', 'तन्येरन्', 'तन्येध्वम्', 'तन्येमहि'],
    },

     'kf': { // do
         'lin_par': ['कुर्यात्', 'कुर्याः', 'कुर्याम्', 'कुर्याताम्', 'कुर्यातम्', 'कुर्याव', 'कुर्युः', 'कुर्यात', 'कुर्याम'],
         'lin_atm': ['कुर्वीत', 'कुर्वीथाः', 'कुर्वीय', 'कुर्वीयाताम्', 'कुर्वीयाथाम्', 'कुर्वीवहि', 'कुर्वीरन्', 'कुर्वीध्वम्', 'कुर्वीमहि'],
         'lin_pas': ['क्रियेत', 'क्रियेथाः', 'क्रियेय', 'क्रियेयाताम्', 'क्रियेयाथाम्', 'क्रियेवहि', 'क्रियेरन्', 'क्रियेध्वम्', 'क्रियेमहि'],
    },

    'man': { // man - to think, повторяет tan
        'lin_atm': ['मन्वीत', 'मन्वीथाः', 'मन्वीय', 'मन्वीयाताम्', 'मन्वीयाथाम्', 'मन्वीवहि', 'मन्वीरन्', 'मन्वीध्वम्', 'मन्वीमहि'],
        'lin_pas': ['मन्येत', 'मन्येथाः', 'मन्येय', 'मन्येयाताम्', 'मन्येयाथाम्', 'मन्येवहि', 'मन्येरन्', 'मन्येध्वम्', 'मन्येमहि'],
    },
}

// nine
var ganaNine = {
    'krI': { // buy
        'lin_par': ['क्रीणीयात्', 'क्रीणीयाः', 'क्रीणीयाम्', 'क्रीणीयाताम्', 'क्रीणीयातम्', 'क्रीणीयाव', 'क्रीणीयुः', 'क्रीणीयात', 'क्रीणीयाम'],
        'lin_atm': ['क्रीणीत', 'क्रीणीथाः', 'क्रीणीय', 'क्रीणीयाताम्', 'क्रीणीयाथाम्', 'क्रीणीवहि', 'क्रीणीरन्', 'क्रीणीध्वम्', 'क्रीणीमहि'],
        'lin_pas': ['क्रीयेत', 'क्रीयेथाः', 'क्रीयेय', 'क्रीयेयाताम्', 'क्रीयेयाथाम्', 'क्रीयेवहि', 'क्रीयेरन्', 'क्रीयेध्वम्', 'क्रीयेमहि'],
    },

    'pU': { // clarify
        'lin_par': ['पुनीयात्', 'पुनीयाः', 'पुनीयाम्', 'पुनीयाताम्', 'पुनीयातम्', 'पुनीयाव', 'पुनीयुः', 'पुनीयात', 'पुनीयाम'],
        'lin_atm': ['पुनीत', 'पुनीथाः', 'पुनीय', 'पुनीयाताम्', 'पुनीयाथाम्', 'पुनीवहि', 'पुनीरन्', 'पुनीध्वम्', 'पुनीमहि'],
        'lin_pas': ['पूयेत', 'पूयेथाः', 'पूयेय', 'पूयेयाताम्', 'पूयेयाथाम्', 'पूयेवहि', 'पूयेरन्', 'पूयेध्वम्', 'पूयेमहि'],
    },

    // gfh - нет значения MW
    'banD': { // bind
        'lin_par': ['बध्नीयात्', 'बध्नीयाः', 'बध्नीयाम्', 'बध्नीयाताम्', 'बध्नीयातम्', 'बध्नीयाव', 'बध्नीयुः', 'बध्नीयात', 'बध्नीयाम'],
        'lin_pas': ['बध्येत', 'बध्येथाः', 'बध्येय', 'बध्येयाताम्', 'बध्येयाथाम्', 'बध्येवहि', 'बध्येरन्', 'बध्येध्वम्', 'बध्येमहि'],
    },
}

// ten
var ganaTen = {

    'cur': { // to steal
        'lin_par': ['चोरयेत्', 'चोरयेः', 'चोरयेयम्', 'चोरयेताम्', 'चोरयेतम्', 'चोरयेव', 'चोरयेयुः', 'चोरयेत', 'चोरयेम'],
        'lin_atm': ['चोरयेत', 'चोरयेथाः', 'चोरयेय', 'चोरयेयाताम्', 'चोरयेयाथाम्', 'चोरयेवहि', 'चोरयेरन्', 'चोरयेध्वम्', 'चोरयेमहि'],
        'lin_pas': ['चोर्येत', 'चोर्येथाः', 'चोर्येय', 'चोर्येयाताम्', 'चोर्येयाथाम्', 'चोर्येवहि', 'चोर्येरन्', 'चोर्येध्वम्', 'चोर्येमहि'],
    },
    'cint': { // think
        'lin_par': ['चिन्तयेत्', 'चिन्तयेः', 'चिन्तयेयम्', 'चिन्तयेताम्', 'चिन्तयेतम्', 'चिन्तयेव', 'चिन्तयेयुः', 'चिन्तयेत', 'चिन्तयेम'],
        'lin_atm': ['चिन्तयेत', 'चिन्तयेथाः', 'चिन्तयेय', 'चिन्तयेयाताम्', 'चिन्तयेयाथाम्', 'चिन्तयेवहि', 'चिन्तयेरन्', 'चिन्तयेध्वम्', 'चिन्तयेमहि'],
        'lin_pas': ['चिन्त्येत', 'चिन्त्येथाः', 'चिन्त्येय', 'चिन्त्येयाताम्', 'चिन्त्येयाथाम्', 'चिन्त्येवहि', 'चिन्त्येरन्', 'चिन्त्येध्वम्', 'चिन्त्येमहि'],
    },
    // '': { //
    //     'lin_par': ['', '', '', '', '', '', '', '', ''],
    //     'lin_atm': ['', '', '', '', '', '', '', '', ''],
    //     'lin_pas': ['', '', '', '', '', '', '', '', ''],
    // },

}

describe('viDilin', function() {
    utils.fireTest(ganaOne, 'one');
});

describe('viDilin', function() {
    utils.fireTest(ganaTwo, 'two');
});

describe('viDilin', function() {
    utils.fireTest(ganaTree, 'three');
});

describe('viDilin', function() {
    utils.fireTest(ganaFour, 'four');
});

describe('viDilin', function() {
    utils.fireTest(ganaFive, 'five');
});

describe('viDilin', function() {
    utils.fireTest(ganaSix, 'six');
});

describe('viDilin', function() {
    utils.fireTest(ganaSeven, 'seven');
});

describe('viDilin', function() {
    utils.fireTest(ganaEight, 'eight');
});

describe('viDilin', function() {
    utils.fireTest(ganaNine, 'nine');
});

describe('viDilin', function() {
    utils.fireTest(ganaTen, 'ten');
});
