var utils = require('./utils');
var desc = {};
desc.pos = 'part';
desc.gana = 1410;
desc.la = 'lat';
desc.pada = 'par';
desc.gend = 'masc';

var tests = {

    'gam': { // go g.1
        'sg': ['गच्छन्', 'गच्छन्', 'गच्छन्तम्', 'गच्छता', 'गच्छते', 'गच्छतः', 'गच्छतः', 'गच्छति'],
        'du': ['गच्छन्तौ', 'गच्छन्तौ', 'गच्छन्तौ', 'गच्छद्भ्याम्', 'गच्छद्भ्याम्', 'गच्छद्भ्याम्', 'गच्छतोः', 'गच्छतोः'],
        'pl': ['गच्छन्तः', 'गच्छन्तः', 'गच्छतः', 'गच्छद्भिः', 'गच्छद्भ्यः', 'गच्छद्भ्यः', 'गच्छताम्', 'गच्छत्सु'],
    },
    'rud': { // cry g.2
        'sg': ['रुदन्', 'रुदन्', 'रुदन्तम्', 'रुदता', 'रुदते', 'रुदतः', 'रुदतः', 'रुदति'],
        'du': ['रुदन्तौ', 'रुदन्तौ', 'रुदन्तौ', 'रुदद्भ्याम्', 'रुदद्भ्याम्', 'रुदद्भ्याम्', 'रुदतोः', 'रुदतोः'],
        'pl': ['रुदन्तः', 'रुदन्तः', 'रुदतः', 'रुदद्भिः', 'रुदद्भ्यः', 'रुदद्भ्यः', 'रुदताम्', 'रुदत्सु'],
    },

    'su': { // press, g.5
        'sg': ['सुन्वन्', 'सुन्वन्', 'सुन्वन्तम्', 'सुन्वता', 'सुन्वते', 'सुन्वतः', 'सुन्वतः', 'सुन्वति'],
        'du': ['सुन्वन्तौ', 'सुन्वन्तौ', 'सुन्वन्तौ', 'सुन्वद्भ्याम्', 'सुन्वद्भ्याम्', 'सुन्वद्भ्याम्', 'सुन्वतोः', 'सुन्वतोः'],
        'pl': ['सुन्वन्तः', 'सुन्वन्तः', 'सुन्वतः', 'सुन्वद्भिः', 'सुन्वद्भ्यः', 'सुन्वद्भ्यः', 'सुन्वताम्', 'सुन्वत्सु'],
    },
    'ruD': { // obstract, g.7
        'sg': ['रुन्धन्', 'रुन्धन्', 'रुन्धन्तम्', 'रुन्धता', 'रुन्धते', 'रुन्धतः', 'रुन्धतः', 'रुन्धति'],
        'du': ['रुन्धन्तौ', 'रुन्धन्तौ', 'रुन्धन्तौ', 'रुन्धद्भ्याम्', 'रुन्धद्भ्याम्', 'रुन्धद्भ्याम्', 'रुन्धतोः', 'रुन्धतोः'],
        'pl': ['रुन्धन्तः', 'रुन्धन्तः', 'रुन्धतः', 'रुन्धद्भिः', 'रुन्धद्भ्यः', 'रुन्धद्भ्यः', 'रुन्धताम्', 'रुन्धत्सु'],
    },

    'tud': { // g.6 strike
        'sg': ['तुदन्', 'तुदन्', 'तुदन्तम्', 'तुदता', 'तुदते', 'तुदतः', 'तुदतः', 'तुदति'],
        'du': ['तुदन्तौ', 'तुदन्तौ', 'तुदन्तौ', 'तुदद्भ्याम्', 'तुदद्भ्याम्', 'तुदद्भ्याम्', 'तुदतोः', 'तुदतोः'],
        'pl': ['तुदन्तः', 'तुदन्तः', 'तुदतः', 'तुदद्भिः', 'तुदद्भ्यः', 'तुदद्भ्यः', 'तुदताम्', 'तुदत्सु'],
    },
    'Bid': { // g.7 destroy
        'sg': ['भिन्दन्', 'भिन्दन्', 'भिन्दन्तम्', 'भिन्दता', 'भिन्दते', 'भिन्दतः', 'भिन्दतः', 'भिन्दति'],
        'du': ['भिन्दन्तौ', 'भिन्दन्तौ', 'भिन्दन्तौ', 'भिन्दद्भ्याम्', 'भिन्दद्भ्याम्', 'भिन्दद्भ्याम्', 'भिन्दतोः', 'भिन्दतोः'],
        'pl': ['भिन्दन्तः', 'भिन्दन्तः', 'भिन्दतः', 'भिन्दद्भिः', 'भिन्दद्भ्यः', 'भिन्दद्भ्यः', 'भिन्दताम्', 'भिन्दत्सु'],
    },

    // 'tan': { // g.8 // FIXME: доделать g.8 в ganas, иначе и тут не получится
    //     'sg': ['तन्वन्', 'तन्वन्', 'तन्वन्तम्', 'तन्वता', 'तन्वते', 'तन्वतः', 'तन्वतः', 'तन्वति'],
    //     'du': ['तन्वन्तौ', 'तन्वन्तौ', 'तन्वन्तौ', 'तन्वद्भ्याम्', 'तन्वद्भ्याम्', 'तन्वद्भ्याम्', 'तन्वतोः', 'तन्वतोः'],
    //     'pl': ['तन्वन्तः', 'तन्वन्तः', 'तन्वतः', 'तन्वद्भिः', 'तन्वद्भ्यः', 'तन्वद्भ्यः', 'तन्वताम्', 'तन्वत्सु'],
    // },
    'krI': { // g.9 buy
        'sg': ['क्रीणन्', 'क्रीणन्', 'क्रीणन्तम्', 'क्रीणता', 'क्रीणते', 'क्रीणतः', 'क्रीणतः', 'क्रीणति'],
        'du': ['क्रीणन्तौ', 'क्रीणन्तौ', 'क्रीणन्तौ', 'क्रीणद्भ्याम्', 'क्रीणद्भ्याम्', 'क्रीणद्भ्याम्', 'क्रीणतोः', 'क्रीणतोः'],
        'pl': ['क्रीणन्तः', 'क्रीणन्तः', 'क्रीणतः', 'क्रीणद्भिः', 'क्रीणद्भ्यः', 'क्रीणद्भ्यः', 'क्रीणताम्', 'क्रीणत्सु'],
    },
    'cur': { // g.10
        'sg': ['चोरयन्', 'चोरयन्', 'चोरयन्तम्', 'चोरयता', 'चोरयते', 'चोरयतः', 'चोरयतः', 'चोरयति'],
        'du': ['चोरयन्तौ', 'चोरयन्तौ', 'चोरयन्तौ', 'चोरयद्भ्याम्', 'चोरयद्भ्याम्', 'चोरयद्भ्याम्', 'चोरयतोः', 'चोरयतोः'],
        'pl': ['चोरयन्तः', 'चोरयन्तः', 'चोरयतः', 'चोरयद्भिः', 'चोरयद्भ्यः', 'चोरयद्भ्यः', 'चोरयताम्', 'चोरयत्सु'],
    },

    // g.3
    'hu': { // sacrifice - FIXME: inria commented, brown ok. WTF?
        'sg': ['जुह्वन्', 'जुह्वन्', 'जुह्वन्तम्', 'जुह्वता', 'जुह्वते', 'जुह्वतः', 'जुह्वतः', 'जुह्वति'],
        'du': ['जुह्वन्तौ', 'जुह्वन्तौ', 'जुह्वन्तौ', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वतोः', 'जुह्वतोः'],
        'pl': ['जुह्वन्तः', 'जुह्वन्तः', 'जुह्वतः', 'जुह्वद्भिः', 'जुह्वद्भ्यः', 'जुह्वद्भ्यः', 'जुह्वताम्', 'जुह्वत्सु'],
        //'sg': ['जुह्वत्', 'जुह्वत्', 'जुह्वतम्', 'जुह्वता', 'जुह्वते', 'जुह्वतः', 'जुह्वतः', 'जुह्वति'],
        // 'du': ['जुह्वतौ', 'जुह्वतौ', 'जुह्वतौ', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वतोः', 'जुह्वतोः'],
        // 'pl': ['जुह्वतः', 'जुह्वतः', 'जुह्वतः', 'जुह्वद्भिः', 'जुह्वद्भ्यः', 'जुह्वद्भ्यः', 'जुह्वताम्', 'जुह्वत्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

var descName = ['part', desc.la, desc.pada, desc.gend].join('_');
describe(descName, function() {
    utils.firePart(tests, desc);
});
