var utils = require('./utils');
var desc = {};
desc.pos = 'part';
desc.gana = 1410;
desc.la = 'lat';
desc.pada = 'par';
desc.gend = 'fem';

var tests = {

    'gam': { // go
        'sg': ['गच्छन्ती', 'गच्छन्ति', 'गच्छन्तीम्', 'गच्छन्त्या', 'गच्छन्त्यै', 'गच्छन्त्याः', 'गच्छन्त्याः', 'गच्छन्त्याम्'],
        'du': ['गच्छन्त्यौ', 'गच्छन्त्यौ', 'गच्छन्त्यौ', 'गच्छन्तीभ्याम्', 'गच्छन्तीभ्याम्', 'गच्छन्तीभ्याम्', 'गच्छन्त्योः', 'गच्छन्त्योः'],
        'pl': ['गच्छन्त्यः', 'गच्छन्त्यः', 'गच्छन्तीः', 'गच्छन्तीभिः', 'गच्छन्तीभ्यः', 'गच्छन्तीभ्यः', 'गच्छन्तीनाम्', 'गच्छन्तीषु'],
    },
    'rud': { // cry
        'sg': ['रुदती', 'रुदति', 'रुदतीम्', 'रुदत्या', 'रुदत्यै', 'रुदत्याः', 'रुदत्याः', 'रुदत्याम्'],
        'du': ['रुदत्यौ', 'रुदत्यौ', 'रुदत्यौ', 'रुदतीभ्याम्', 'रुदतीभ्याम्', 'रुदतीभ्याम्', 'रुदत्योः', 'रुदत्योः'],
        'pl': ['रुदत्यः', 'रुदत्यः', 'रुदतीः', 'रुदतीभिः', 'रुदतीभ्यः', 'रुदतीभ्यः', 'रुदतीनाम्', 'रुदतीषु'],
    },

    'su': { //
        'sg': ['सुन्वती', 'सुन्वति', 'सुन्वतीम्', 'सुन्वत्या', 'सुन्वत्यै', 'सुन्वत्याः', 'सुन्वत्याः', 'सुन्वत्याम्'],
        'du': ['सुन्वत्यौ', 'सुन्वत्यौ', 'सुन्वत्यौ', 'सुन्वतीभ्याम्', 'सुन्वतीभ्याम्', 'सुन्वतीभ्याम्', 'सुन्वत्योः', 'सुन्वत्योः'],
        'pl': ['सुन्वत्यः', 'सुन्वत्यः', 'सुन्वतीः', 'सुन्वतीभिः', 'सुन्वतीभ्यः', 'सुन्वतीभ्यः', 'सुन्वतीनाम्', 'सुन्वतीषु'],
    },
    'ruD': { //
        'sg': ['रुन्धती', 'रुन्धति', 'रुन्धतीम्', 'रुन्धत्या', 'रुन्धत्यै', 'रुन्धत्याः', 'रुन्धत्याः', 'रुन्धत्याम्'],
        'du': ['रुन्धत्यौ', 'रुन्धत्यौ', 'रुन्धत्यौ', 'रुन्धतीभ्याम्', 'रुन्धतीभ्याम्', 'रुन्धतीभ्याम्', 'रुन्धत्योः', 'रुन्धत्योः'],
        'pl': ['रुन्धत्यः', 'रुन्धत्यः', 'रुन्धतीः', 'रुन्धतीभिः', 'रुन्धतीभ्यः', 'रुन्धतीभ्यः', 'रुन्धतीनाम्', 'रुन्धतीषु'],
    },

    'tud': { // g.6
        'sg': ['तुदन्ती', 'तुदन्ति', 'तुदन्तीम्', 'तुदन्त्या', 'तुदन्त्यै', 'तुदन्त्याः', 'तुदन्त्याः', 'तुदन्त्याम्'],
        'du': ['तुदन्त्यौ', 'तुदन्त्यौ', 'तुदन्त्यौ', 'तुदन्तीभ्याम्', 'तुदन्तीभ्याम्', 'तुदन्तीभ्याम्', 'तुदन्त्योः', 'तुदन्त्योः'],
        'pl': ['तुदन्त्यः', 'तुदन्त्यः', 'तुदन्तीः', 'तुदन्तीभिः', 'तुदन्तीभ्यः', 'तुदन्तीभ्यः', 'तुदन्तीनाम्', 'तुदन्तीषु'],
    },
    'Bid': { //
        'sg': ['भिन्दती', 'भिन्दति', 'भिन्दतीम्', 'भिन्दत्या', 'भिन्दत्यै', 'भिन्दत्याः', 'भिन्दत्याः', 'भिन्दत्याम्'],
        'du': ['भिन्दत्यौ', 'भिन्दत्यौ', 'भिन्दत्यौ', 'भिन्दतीभ्याम्', 'भिन्दतीभ्याम्', 'भिन्दतीभ्याम्', 'भिन्दत्योः', 'भिन्दत्योः'],
        'pl': ['भिन्दत्यः', 'भिन्दत्यः', 'भिन्दतीः', 'भिन्दतीभिः', 'भिन्दतीभ्यः', 'भिन्दतीभ्यः', 'भिन्दतीनाम्', 'भिन्दतीषु'],
    },

    // 'tan': { // g.8
    //     'sg': ['तन्वती', 'तन्वति', 'तन्वतीम्', 'तन्वत्या', 'तन्वत्यै', 'तन्वत्याः', 'तन्वत्याः', 'तन्वत्याम्'],
    //     'du': ['तन्वत्यौ', 'तन्वत्यौ', 'तन्वत्यौ', 'तन्वतीभ्याम्', 'तन्वतीभ्याम्', 'तन्वतीभ्याम्', 'तन्वत्योः', 'तन्वत्योः'],
    //     'pl': ['तन्वत्यः', 'तन्वत्यः', 'तन्वतीः', 'तन्वतीभिः', 'तन्वतीभ्यः', 'तन्वतीभ्यः', 'तन्वतीनाम्', 'तन्वतीषु'],
    // },
    'krI': { // g.9
        'sg': ['क्रीणती', 'क्रीणति', 'क्रीणतीम्', 'क्रीणत्या', 'क्रीणत्यै', 'क्रीणत्याः', 'क्रीणत्याः', 'क्रीणत्याम्'],
        'du': ['क्रीणत्यौ', 'क्रीणत्यौ', 'क्रीणत्यौ', 'क्रीणतीभ्याम्', 'क्रीणतीभ्याम्', 'क्रीणतीभ्याम्', 'क्रीणत्योः', 'क्रीणत्योः'],
        'pl': ['क्रीणत्यः', 'क्रीणत्यः', 'क्रीणतीः', 'क्रीणतीभिः', 'क्रीणतीभ्यः', 'क्रीणतीभ्यः', 'क्रीणतीनाम्', 'क्रीणतीषु'],
    },
    'cur': { // g.10
        'sg': ['चोरयन्ती', 'चोरयन्ति', 'चोरयन्तीम्', 'चोरयन्त्या', 'चोरयन्त्यै', 'चोरयन्त्याः', 'चोरयन्त्याः', 'चोरयन्त्याम्'],
        'du': ['चोरयन्त्यौ', 'चोरयन्त्यौ', 'चोरयन्त्यौ', 'चोरयन्तीभ्याम्', 'चोरयन्तीभ्याम्', 'चोरयन्तीभ्याम्', 'चोरयन्त्योः', 'चोरयन्त्योः'],
        'pl': ['चोरयन्त्यः', 'चोरयन्त्यः', 'चोरयन्तीः', 'चोरयन्तीभिः', 'चोरयन्तीभ्यः', 'चोरयन्तीभ्यः', 'चोरयन्तीनाम्', 'चोरयन्तीषु'],
    },

    // g.3
    'hu': { // FIXME: inria ok, brown commented
        'sg': ['जुह्वती', 'जुह्वति', 'जुह्वतीम्', 'जुह्वत्या', 'जुह्वत्यै', 'जुह्वत्याः', 'जुह्वत्याः', 'जुह्वत्याम्'],
        'du': ['जुह्वत्यौ', 'जुह्वत्यौ', 'जुह्वत्यौ', 'जुह्वतीभ्याम्', 'जुह्वतीभ्याम्', 'जुह्वतीभ्याम्', 'जुह्वत्योः', 'जुह्वत्योः'],
        'pl': ['जुह्वत्यः', 'जुह्वत्यः', 'जुह्वतीः', 'जुह्वतीभिः', 'जुह्वतीभ्यः', 'जुह्वतीभ्यः', 'जुह्वतीनाम्', 'जुह्वतीषु'],
        // 'sg': ['जुह्वत्', 'जुह्वत्', 'जुह्वतम्', 'जुह्वता', 'जुह्वते', 'जुह्वतः', 'जुह्वतः', 'जुह्वति'],
        // 'du': ['जुह्वतौ', 'जुह्वतौ', 'जुह्वतौ', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वतोः', 'जुह्वतोः'],
        // 'pl': ['जुह्वतः', 'जुह्वतः', 'जुह्वतः', 'जुह्वद्भिः', 'जुह्वद्भ्यः', 'जुह्वद्भ्यः', 'जुह्वताम्', 'जुह्वत्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

var descName = ['part', desc.la, desc.pada, desc.gend].join('_');
describe(descName, function() {
    utils.firePart(tests, desc);
});
