var utils = require('./utils');
var desc = {};
desc.pos = 'part';
desc.gana = 1410;
desc.la = 'lat';
desc.pada = 'par';
desc.gend = 'neut';

var tests = {

    'gam': { // go
        'sg': ['गच्छत्', 'गच्छत्', 'गच्छत्', 'गच्छता', 'गच्छते', 'गच्छतः', 'गच्छतः', 'गच्छति'],
        'du': ['गच्छन्ती-गच्छती', 'गच्छन्ती-गच्छती', 'गच्छन्ती-गच्छती', 'गच्छद्भ्याम्', 'गच्छद्भ्याम्', 'गच्छद्भ्याम्', 'गच्छतोः', 'गच्छतोः'],
        'pl': ['गच्छन्ति', 'गच्छन्ति', 'गच्छन्ति', 'गच्छद्भिः', 'गच्छद्भ्यः', 'गच्छद्भ्यः', 'गच्छताम्', 'गच्छत्सु'],
    },
    'rud': { // cry
        'sg': ['रुदत्', 'रुदत्', 'रुदत्', 'रुदता', 'रुदते', 'रुदतः', 'रुदतः', 'रुदति'],
        'du': ['रुदन्ती-रुदती', 'रुदन्ती-रुदती', 'रुदन्ती-रुदती', 'रुदद्भ्याम्', 'रुदद्भ्याम्', 'रुदद्भ्याम्', 'रुदतोः', 'रुदतोः'],
        'pl': ['रुदन्ति', 'रुदन्ति', 'रुदन्ति', 'रुदद्भिः', 'रुदद्भ्यः', 'रुदद्भ्यः', 'रुदताम्', 'रुदत्सु'],
    },

    'su': { //
        'sg': ['सुन्वत्', 'सुन्वत्', 'सुन्वत्', 'सुन्वता', 'सुन्वते', 'सुन्वतः', 'सुन्वतः', 'सुन्वति'],
        'du': ['सुन्वन्ती-सुन्वती', 'सुन्वन्ती-सुन्वती', 'सुन्वन्ती-सुन्वती', 'सुन्वद्भ्याम्', 'सुन्वद्भ्याम्', 'सुन्वद्भ्याम्', 'सुन्वतोः', 'सुन्वतोः'],
        'pl': ['सुन्वन्ति', 'सुन्वन्ति', 'सुन्वन्ति', 'सुन्वद्भिः', 'सुन्वद्भ्यः', 'सुन्वद्भ्यः', 'सुन्वताम्', 'सुन्वत्सु'],
    },
    'ruD': { //
        'sg': ['रुन्धत्', 'रुन्धत्', 'रुन्धत्', 'रुन्धता', 'रुन्धते', 'रुन्धतः', 'रुन्धतः', 'रुन्धति'],
        'du': ['रुन्धन्ती-रुन्धती', 'रुन्धन्ती-रुन्धती', 'रुन्धन्ती-रुन्धती', 'रुन्धद्भ्याम्', 'रुन्धद्भ्याम्', 'रुन्धद्भ्याम्', 'रुन्धतोः', 'रुन्धतोः'],
        'pl': ['रुन्धन्ति', 'रुन्धन्ति', 'रुन्धन्ति', 'रुन्धद्भिः', 'रुन्धद्भ्यः', 'रुन्धद्भ्यः', 'रुन्धताम्', 'रुन्धत्सु'],
    },

    'tud': { // g.6
        'sg': ['तुदत्', 'तुदत्', 'तुदत्', 'तुदता', 'तुदते', 'तुदतः', 'तुदतः', 'तुदति'],
        'du': ['तुदन्ती-तुदती', 'तुदन्ती-तुदती', 'तुदन्ती-तुदती', 'तुदद्भ्याम्', 'तुदद्भ्याम्', 'तुदद्भ्याम्', 'तुदतोः', 'तुदतोः'],
        'pl': ['तुदन्ति', 'तुदन्ति', 'तुदन्ति', 'तुदद्भिः', 'तुदद्भ्यः', 'तुदद्भ्यः', 'तुदताम्', 'तुदत्सु'],
    },
    'Bid': { // g.7
        'sg': ['भिन्दत्', 'भिन्दत्', 'भिन्दत्', 'भिन्दता', 'भिन्दते', 'भिन्दतः', 'भिन्दतः', 'भिन्दति'],
        'du': ['भिन्दन्ती-भिन्दती', 'भिन्दन्ती-भिन्दती', 'भिन्दन्ती-भिन्दती', 'भिन्दद्भ्याम्', 'भिन्दद्भ्याम्', 'भिन्दद्भ्याम्', 'भिन्दतोः', 'भिन्दतोः'],
        'pl': ['भिन्दन्ति', 'भिन्दन्ति', 'भिन्दन्ति', 'भिन्दद्भिः', 'भिन्दद्भ्यः', 'भिन्दद्भ्यः', 'भिन्दताम्', 'भिन्दत्सु'],
    },

    // 'tan': { // g.8
    //     'sg': ['तन्वत्', 'तन्वत्', 'तन्वत्', 'तन्वता', 'तन्वते', 'तन्वतः', 'तन्वतः', 'तन्वति'],
    //     'du': ['तन्वन्ती-तन्वती', 'तन्वन्ती-तन्वती', 'तन्वन्ती-तन्वती', 'तन्वद्भ्याम्', 'तन्वद्भ्याम्', 'तन्वद्भ्याम्', 'तन्वतोः', 'तन्वतोः'],
    //     'pl': ['तन्वन्ति', 'तन्वन्ति', 'तन्वन्ति', 'तन्वद्भिः', 'तन्वद्भ्यः', 'तन्वद्भ्यः', 'तन्वताम्', 'तन्वत्सु'],
    // },
    'krI': { // g.9
        'sg': ['क्रीणत्', 'क्रीणत्', 'क्रीणत्', 'क्रीणता', 'क्रीणते', 'क्रीणतः', 'क्रीणतः', 'क्रीणति'],
        'du': ['क्रीणन्ती-क्रीणती', 'क्रीणन्ती-क्रीणती', 'क्रीणन्ती', 'क्रीणद्भ्याम्', 'क्रीणद्भ्याम्', 'क्रीणद्भ्याम्', 'क्रीणतोः', 'क्रीणतोः'],
        'pl': ['क्रीणन्ति', 'क्रीणन्ति', 'क्रीणन्ति', 'क्रीणद्भिः', 'क्रीणद्भ्यः', 'क्रीणद्भ्यः', 'क्रीणताम्', 'क्रीणत्सु'],
    },
    'cur': { // g.10
        'sg': ['चोरयत्', 'चोरयत्', 'चोरयत्', 'चोरयता', 'चोरयते', 'चोरयतः', 'चोरयतः', 'चोरयति'],
        'du': ['चोरयन्ती-चोरयती', 'चोरयन्ती-चोरयती', 'चोरयन्ती-चोरयती', 'चोरयद्भ्याम्', 'चोरयद्भ्याम्', 'चोरयद्भ्याम्', 'चोरयतोः', 'चोरयतोः'],
        'pl': ['चोरयन्ति', 'चोरयन्ति', 'चोरयन्ति', 'चोरयद्भिः', 'चोरयद्भ्यः', 'चोरयद्भ्यः', 'चोरयताम्', 'चोरयत्सु'],
    },

    // g.3
    'hu': { // FIXME: neut_sg_acc_juhvatam ?
        'sg': ['जुह्वत्', 'जुह्वत्', 'जुह्वतम्', 'जुह्वता', 'जुह्वते', 'जुह्वतः', 'जुह्वतः', 'जुह्वति'],
        'du': ['जुह्वती', 'जुह्वती', 'जुह्वती', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वद्भ्याम्', 'जुह्वतोः', 'जुह्वतोः'],
        'pl': ['जुह्वन्ति-जुह्वति', 'जुह्वन्ति-जुह्वति', 'जुह्वन्ति-जुह्वति', 'जुह्वद्भिः', 'जुह्वद्भ्यः', 'जुह्वद्भ्यः', 'जुह्वताम्', 'जुह्वत्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}

var descName = ['part', desc.la, desc.pada, desc.gend].join('_');
describe(descName, function() {
    utils.firePart(tests, desc);
});
