var utils = require('./utils');
var desc = 'p_p_p-full';

var tests = {
    'smf': { //
        'sg': ['स्मृतः', 'स्मृत', 'स्मृतम्', 'स्मृतेन', 'स्मृताय', 'स्मृतात्-स्मृततः', 'स्मृतस्य', 'स्मृते'],
        'du': ['स्मृतौ', 'स्मृतौ', 'स्मृतौ', 'स्मृताभ्याम्', 'स्मृताभ्याम्', 'स्मृताभ्याम्', 'स्मृतयोः', 'स्मृतयोः'],
        'pl': ['स्मृताः', 'स्मृताः', 'स्मृतान्', 'स्मृतैः', 'स्मृतेभ्यः', 'स्मृतेभ्यः', 'स्मृतानाम्', 'स्मृतेषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(desc, function() {
    utils.fireNoun(tests, desc);
});
