//

var utils = require('../utils');
var conj = 'redup';

var tests = {
    // w.783 a
    // first - vowel and ending with a single consonant
    // ===============================
    'ad': { // eat
        'lit_par': ['आद', 'आदिथ', 'आद', 'आदतुः', 'आदथुः', 'आदिव', 'आदुः', 'आद', 'आदिम'],
    },
    // e. For the peculiar reduplication ān, belonging to certain roots with initial vowels, see below, 788.
    // 788. A small number of roots with initial a or ṛ (ar) show the anomalous reduplication ān in the perfect.
    // √añj √aç √ṛdh √ṛc √arh
    'arh': { // to deserve, cl.1
        'lit_par': ['आनर्ह', 'आनर्हिथ', 'आनर्ह', 'आनर्हतुः', 'आनर्हथुः', 'आनर्हिव', 'आनर्हुः', 'आनर्ह', 'आनर्हिम'],
        'lit_atm': ['आनर्हे', 'आनर्हिषे', 'आनर्हे', 'आनर्हाते', 'आनर्हाथे', 'आनर्हिवहे', 'आनर्हिरे', 'आनर्हिध्वे', 'आनर्हिमहे'],
    },
    // 'An': { //
    //     'lit_par': ['', '', '', '', '', '', '', '', ''],
    //     'lit_atm': ['', '', '', '', '', '', '', '', ''],
    // },
    'iz': { // seek
        'lit_par': ['इयेष', 'इयेषिथ', 'इयेष', 'ईषतुः', 'ईषथुः', 'ईषिव', 'ईषुः', 'ईष', 'ईषिम'],
        'lit_atm': ['ईषे', 'ईषिषे', 'ईषे', 'ईषाते', 'ईषाथे', 'ईषिवहे', 'ईषिरे', 'ईषिध्वे', 'ईषिमहे'],
    },
    'inD': { // kindle, light - cl.7
        'lit_par': ['इन्द्धाम्', 'इन्त्स्व', 'इनधै', 'इन्धाताम्', 'इन्धाथाम्', 'इनधावहै', 'इन्धताम्', 'इन्द्ध्वम्', 'इनधामहै'],
        //'lit_atm': ['इध्यताम्', 'इध्यस्व', 'इध्यै', 'इध्येताम्', 'इध्येथाम्', 'इध्यावहै', 'इध्यन्ताम्', 'इध्यध्वम्', 'इध्यामहै'], // TODO: where is -n- ?
    },
    'i': { // to go FIXME:
        'lit_par': ['इयाय', 'इयेथ-इययिथ', 'इयाय-इयय', 'ईयतुः', 'ईयथुः', 'ईय्व', 'ईयुः', 'ईय', 'ईय्म'],
        'lit_atm': ['ईये', 'ईय्से', 'ईये', 'ईयाते', 'ईयाथे', 'ईय्वहे', 'ईयिरे', 'ईय्ध्वे', 'ईय्महे'],
    },
    'uc': { // cl.4 FIXME: strong
        'lit_par': ['उवोच', 'उवोचिथ', 'उवोच', 'ऊचतुः', 'ऊचथुः', 'ऊचिव', 'ऊचुः', 'ऊच', 'ऊचिम'],
    },
    'und': { // cl.1, (7) to flow
        'lit_par': ['उवोन्द', 'उवोन्दिथ', 'उवोन्द', 'ऊन्दतुः', 'ऊन्दथुः', 'ऊन्दिव', 'ऊन्दुः', 'ऊन्द', 'ऊन्दिम'],
    },
    // c. Roots which begin with vowels long by nature or by position do not in general make a perfect-system, but use instead a periphrastic formation,
    // d. To this rule, however, √āp constitutes an exception
    'Ap': { // obtain
        'lit_par': ['आप', 'आपिथ', 'आप', 'आपतुः', 'आपथुः', 'आपिव', 'आपुः', 'आप', 'आपिम'],
    },
    'as': { // to be cl.2
        'lit_par': ['आस', 'आसिथ', 'आस', 'आसतुः', 'आसथुः', 'आसिव', 'आसुः', 'आस', 'आसिम'],
    },

    // '': { //
    //     'lit_par': ['', '', '', '', '', '', '', '', ''],
    //     'lit_atm': ['', '', '', '', '', '', '', '', ''],
    // },

    'uc': { // to be fond of
        'lit_par': ['उवोच', 'उवोचिथ', 'उवोच', 'ऊचतुः', 'ऊचथुः', 'ऊचिव', 'ऊचुः', 'ऊच', 'ऊचिम'],
    },
    'vac': { // speak // w.784 vac, vap, vad, vaç, vas, vah; and vā
        'lit_par': ['उवाच', 'उवचिथ-उवक्थ', 'उवाच-उवच', 'ऊचतुः', 'ऊचथुः', 'ऊचिव', 'ऊचुः', 'ऊच', 'ऊचिम'],
    },
    'vas': { // live
        'lit_par': ['उवास', 'उवस्थ-उवसिथ', 'उवास-उवस', 'ऊसतुः', 'ऊसथुः', 'ऊसिव', 'ऊसुः', 'ऊस', 'ऊसिम'],
    },
    // FIXME: небольшое число глаголов по типу uc-vac
    // // 785. a. A number of roots having ya after a first initial consonant
    // // vyac, vyath, vyadh, vyā, jyā, pyā, syand; and, in the Veda, also tyaj, with cyu and dyu
    // 'yaj': { // worship
    //     'lit_par': ['इयाज', 'इयष्ठ-इयजिथ', 'इयाज-इयज', 'ईजतुः', 'ईजथुः', 'ईजिव', 'ईजुः', 'ईज', 'ईजिम'],
    //     'lit_atm': ['ईजे', 'ईजिषे', 'ईजे', 'ईजाते', 'ईजाथे', 'ईजिवहे', 'ईजिरे', 'ईजिध्वे', 'ईजिमहे'],
    // },
    // 'vyac': { // contain, cl.6
    //     'lit_par': ['वव्याच', 'वव्यचिथ', 'वव्याच-वव्यच', 'वव्यचतुः', 'वव्यचथुः', 'वव्यचिव', 'वव्यचुः', 'वव्यच', 'वव्यचिम'],
    //     'lit_atm': ['वव्यचे', 'वव्यचिषे', 'वव्यचे', 'वव्यचाते', 'वव्यचाथे', 'वव्यचिवहे', 'वव्यचिरे', 'वव्यचिध्वे', 'वव्यचिमहे'],
    // },
    // // b. A single root with va is treated in the same way: namely svap, which forms suṣvap
    // 'svap': { // to sleep cl.2
    //     'lit_par': ['सुष्वाप', 'सुष्वपिथ', 'सुष्वाप-सुष्वप', 'सुषुपतुः', 'सुषुपथुः', 'सुषुपिव', 'सुषुपुः', 'सुषुप', 'सुषुपिम'],
    // },

    //786. A considerable number of roots have in the Veda a long vowel in their reduplication.
    // roots reduplicating with ā: kan, kḷp, gṛdh, tṛp, tṛṣ, dṛh, dhṛ, dhṛṣ, nam, mah, mṛj, mṛç, ran, radh, rabh, vañc, van, vaç, vas clothe, vāç, vṛj, vṛt, vṛdh, vṛṣ, çad prevail, sah, skambh.
    // b. Of roots reduplicating with ī: the so-called roots (676) dīdhī and dīdī,
    // c. Of roots reduplicating with ū: tu, jū, and çū (or çvā).


    // 787. roots beginning with the palatal mutes and aspiration show a reversion
    //  √ci forms ciki; √cit forms cikit; √ji forms jigi; √hi forms jighi; √han forms jaghan
    // root dā protect is said by the grammarians to form digi

    // '': { //
    //     'lit_par': ['', '', '', '', '', '', '', '', ''],
    //     'lit_atm': ['', '', '', '', '', '', '', '', ''],
    // },
    // Exceptions  bhū be,  bhṛ bear, ṣṭhīv spew f
    // 790. Absence of reduplication - vid know
    //

    // '': { //
    //     'lit_par': ['', '', '', '', '', '', '', '', ''],
    //     'lit_atm': ['', '', '', '', '', '', '', '', ''],
    // },

    'hu': { // to sacrifice
        //'lit_par': ['जुहाव', 'जुहोथ-जुहविथ', 'जुहाव-जुहव', 'जुहुवतुः', 'जुहुवथुः', 'जुहुव', 'जुहुवुः', 'जुहुव', 'जुहुम'],
        'lit_par': ['जुहाव', 'जुहोथ', 'जुहाव', 'जुहुवतुः', 'जुहुवथुः', 'जुहुव', 'जुहुवुः', 'जुहुव', 'जुहुम'], // второе значение убрал временно
    },
    'ji': { // to win
        'lit_par': ['जिगाय', 'जिगेथ-जिगयिथ', 'जिगाय-जिगय', 'जिग्यतुः', 'जिग्यथुः', 'जिग्यिव', 'जिग्युः', 'जिग्य', 'जिग्यिम'],
    },
    'buD': { // to know, cl.1,4
        'lat_par': ['बोधति', 'बोधसि', 'बोधामि', 'बोधतः', 'बोधथः', 'बोधावः', 'बोधन्ति', 'बोधथ', 'बोधामः'],
        'lat_atm': ['बुध्यते', 'बुध्यसे', 'बुध्ये', 'बुध्येते', 'बुध्येथे', 'बुध्यावहे', 'बुध्यन्ते', 'बुध्यध्वे', 'बुध्यामहे'],
        'lit_par': ['बुबोध', 'बुबोधिथ', 'बुबोध', 'बुबुधतुः', 'बुबुधथुः', 'बुबुधिव', 'बुबुधुः', 'बुबुध', 'बुबुधिम'],
        'lit_atm': ['बुबुधे', 'बुबुधिषे', 'बुबुधे', 'बुबुधाते', 'बुबुधाथे', 'बुबुधिवहे', 'बुबुधिरे', 'बुबुधिध्वे', 'बुबुधिमहे'],
    },

    'kan': { // to agree to - redup with A
        'lat_par': ['कनति', 'कनसि', 'कनामि', 'कनतः', 'कनथः', 'कनावः', 'कनन्ति', 'कनथ', 'कनामः'],
        'lit_par': ['चाकान', 'चाकनिथ', 'चाकान-चाकन', 'चाकनतुः', 'चाकनथुः', 'चाकनिव', 'चाकनुः', 'चाकन', 'चाकनिम'],
    },
    // http://all-about-sanskrit.blogspot.ru/2013/06/sanskrit-grammar-perfect-tense-part-1.html
    'han': { // kill
        'lit_par': ['जघान', 'जघन्थ-जघनिथ', 'जघान-जघन', 'जघ्नतुः', 'जघ्नथुः', 'जघ्निव', 'जघ्नुः', 'जघ्न', 'जघ्निम'],
        'lit_atm': ['जघ्ने', 'जघ्निषे', 'जघ्ने', 'जघ्नाते', 'जघ्नाथे', 'जघ्निवहे', 'जघ्निरे', 'जघ्निध्वे', 'जघ्निमहे'],
    },

    'su': { // press out
        'lit_par': ['सुषाव', 'सुषोथ-सुषविथ', 'सुषाव-सुषव', 'सुषुवतुः', 'सुषुवथुः', 'सुषुव', 'सुषुवुः', 'सुषुव', 'सुषुम'],
        'lit_atm': ['सुषुवे', 'सुषुषे', 'सुषुवे', 'सुषुवाते', 'सुषुवाथे', 'सुषुवहे', 'सुषुविरे', 'सुषुध्वे', 'सुषुमहे'],
    },
    'nI': { // lead - I long
        'lit_par': ['निनाय', 'निनेथ-निनयिथ', 'निनाय-निनय', 'निन्यतुः', 'निन्यथुः', 'निन्यिव', 'निन्युः', 'निन्य', 'निन्यिम'],
        'lit_atm': ['निन्ये', 'निन्यिषे', 'निन्ये', 'निन्याते', 'निन्याथे', 'निन्यिवहे', 'निन्यिरे', 'निन्यिध्वे', 'निन्यिमहे'],
    },
    'BI': { // fear
        'lit_par': ['बिभाय', 'बिभेथ-बिभयिथ', 'बिभाय-बिभय', 'बिभ्यतुः', 'बिभ्यथुः', 'बिभ्यिव', 'बिभ्युः', 'बिभ्य', 'बिभ्यिम'],
        'lit_atm': ['बिभ्ये', 'बिभ्यिषे', 'बिभ्ये', 'बिभ्याते', 'बिभ्याथे', 'बिभ्यिवहे', 'बिभ्यिरे', 'बिभ्यिध्वे', 'बिभ्यिमहे'],
    },

    // the root is consonant-vowel-consonant (त्+अ+प् =तप्) and the medial vowel is अ pat=>pet
    // medial a before a single final consonant + having e as its vowel
    'pat': { // to fall down
        'lit_par': ['पपात', 'पेतिथ-पपत्थ', 'पपात-पपत', 'पेततुः', 'पेतथुः', 'पेतिव', 'पेतुः', 'पेत', 'पेतिम'],
    },

    'Sak': { // was able
        'lit_par': ['शशाक', 'शेकिथ-शशक्थ', 'शशाक-शशक', 'शेकतुः', 'शेकथुः', 'शेकिव', 'शेकुः', 'शेक', 'शेकिम'],
    },
    // 288. an - TODO:
    'gam': { // go
        'lit_par': ['जगाम', 'जगमिथ-जगन्थ', 'जगाम-जगम', 'जग्मतुः', 'जग्मथुः', 'जग्मिव', 'जग्मुः', 'जग्म', 'जग्मिम'],
        'lit_atm': ['जग्मे', 'जग्मिषे', 'जग्मे', 'जग्माते', 'जग्माथे', 'जग्मिवहे', 'जग्मिरे', 'जग्मिध्वे', 'जग्मिमहे'],
    },

    // Roots ending in a long आ
    'yA': { // go
        'lit_par': ['ययौ', 'ययिथ-ययाथ', 'ययौ', 'ययतुः', 'ययथुः', 'ययिव', 'ययुः', 'यय', 'ययिम'],
    },
    'dA': { //
        'lit_par': ['ददौ', 'ददिथ-ददाथ', 'ददौ', 'ददतुः', 'ददथुः', 'ददिव', 'ददुः', 'दद', 'ददिम'],
        'lit_atm': ['ददे', 'ददिषे', 'ददे', 'ददाते', 'ददाथे', 'ददिवहे', 'ददिरे', 'ददिध्वे', 'ददिमहे'],
    },

    'pA': { // drink
        'lit_par': ['पपौ', 'पपिथ-पपाथ', 'पपौ', 'पपतुः', 'पपथुः', 'पपिव', 'पपुः', 'पप', 'पपिम'],
    },
    'DA': { // drink
        'lit_par': ['दधौ', 'दधिथ-दधाथ', 'दधौ', 'दधतुः', 'दधथुः', 'दधिव', 'दधुः', 'दध', 'दधिम'],
        'lit_atm': ['दधे', 'दधिषे', 'दधे', 'दधाते', 'दधाथे', 'दधिवहे', 'दधिरे', 'दधिध्वे', 'दधिमहे'],
    },

    // ṛ, ṝ, and ḷ will all become a
    'f': { // move // FIXME: f не работает
        'lit_par': ['आर', 'आर्थ-आरिथ', 'आर', 'अरतुः', 'अरथुः', 'अरिव', 'अरुः', 'अर', 'अरिम'],
    },
    'pf': { // to bring over
        //'lat_par': ['पिपर्ति', 'पिपर्षि', 'पिपर्मि', 'पिपृतः', 'पिपृथः', 'पिपृवः', 'पिप्रति', 'पिपृथ', 'पिपृमः'],
        // 'lat_pas': ['प्रियते', 'प्रियसे', 'प्रिये', 'प्रियेते', 'प्रियेथे', 'प्रियावहे', 'प्रियन्ते', 'प्रियध्वे', 'प्रियामहे'],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
        'lit_par': ['पपार', 'पपर्थ-पपरिथ', 'पपार-पपर', 'पप्रतुः', 'पप्रथुः', 'पपृव', 'पप्रुः', 'पप्र', 'पपृम'],
    },
    'kf': { //
        'lit_par': ['चकार', 'चकर्थ-चकरिथ', 'चकार-चकर', 'चक्रतुः', 'चक्रथुः', 'चकृव', 'चक्रुः', 'चक्र', 'चकृम'],
        'lit_atm': ['चक्रे', 'चकृषे', 'चक्रे', 'चक्राते', 'चक्राथे', 'चकृवहे', 'चक्रिरे', 'चकृध्वे', 'चकृमहे'],
    },
    'Bf': { // bear
        'lit_par': ['बभार', 'बभर्थ', 'बभार-बभर', 'बभ्रतुः', 'बभ्रथुः', 'बभृव', 'बभ्रुः', 'बभ्र', 'बभृम'],
        'lit_atm': ['बभ्रे', 'बभृषे', 'बभ्रे', 'बभ्राते', 'बभ्राथे', 'बभृवहे', 'बभ्रिरे', 'बभृध्वे', 'बभृमहे'],
    },
    'tF': { // pass across FIXME:
        'lit_par': ['ततार', 'ततरिथ', 'ततार-ततर', 'ततरतुः', 'ततरथुः', 'ततरिव', 'ततरुः', 'ततर', 'ततरिम'],
    },
    'kxp': { // to be fit for - the whole class on -e ending
        'lit_par': ['चकॢपे', 'चकॢपिषे', 'चकॢपे', 'चकॢपाते', 'चकॢपाथे', 'चकॢपिवहे', 'चकॢपिरे', 'चकॢपिध्वे', 'चकॢपिमहे'],
    },

    'gE': { // sing
        'lit_par': ['जगौ', 'जगिथ-जगाथ', 'जगौ', 'जगतुः', 'जगथुः', 'जगिव', 'जगुः', 'जग', 'जगिम'],
        'lit_atm': ['जगे', 'जगिषे', 'जगे', 'जगाते', 'जगाथे', 'जगिवहे', 'जगिरे', 'जगिध्वे', 'जगिमहे'],
    },
    'dfS': { // see, cl.1
        'lit_par': ['ददर्श', 'ददर्शिथ', 'ददर्श', 'ददृशतुः', 'ददृशथुः', 'ददृशिव', 'ददृशुः', 'ददृश', 'ददृशिम'],
    },
    '': { //
        'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        'lit_par': ['', '', '', '', '', '', '', '', ''],
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
    '': { //
        // 'lat_par': ['', '', '', '', '', '', '', '', ''],
        // 'lat_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lat_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lan_par': ['', '', '', '', '', '', '', '', ''],
        // 'lan_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lan_pas': ['', '', '', '', '', '', '', '', ''],
    },
}

describe(conj, function() {
    utils.fireTest(tests, conj);
});
