var utils = require('../utils');
var desc = 'verb'; // upasarga

var tests = [
    ["अति-", "अतिक्रामति-क्रम्"],
    ["अनु-", "अनुसरति-सृ"],
    ["अप-", "अपनयति-नी"],
    ["अभि-", "अभिगच्छति-गम्"],
    ["अव-", "अवतरति-तॄ"],
    ["उत्-", "उत्पतति-पत्"],

    ["उप-", "उपतिष्टति-स्था"], // fail
    ["नि-", "निपतति-पत्"],
    ["निर्-", "निर्गच्छति-गम्"],
    ["परा-", "पराभवति-भू"],

    ["परि-", "परिणयति-नी"], // fail

    ["प्र-", "प्रहसति-हस्"],
    ["वि-", "विस्मरति-स्मृ"],

    ["समा-", "समागच्छति-गम्"],



]

describe(desc, function() {
    utils.upasarga(desc, tests);
});
