var utils = require('../utils');
var desc = 'upa'; // upasarga

var tests = [
    ["अति-", "अतिशयः-शय", "अतिरेकः-रेक"],

    ["अधि-", "अधिपति-पति", "अध्यक्षः-अक्ष"],
    ["अधि-", "अध्ययनः-अयन", "अध्यापनः-आपन"],
    ["अनु-", "अनुक्रमः-क्रम", "अनुतापः-ताप", "अनुजः-ज"],
    ["अनु-", "अनुकरणः-करण", "अनुमोदनः-मोदन"],
    ["अप-", "अपकर्षः-कर्ष", "अपमानः-मान"],
    ["अप-", "अपकारः-कार", "अपजयः-जय"],

    ["अपि-", "अपिधानः-धान"],
    ["अभि-", "अभिनन्दनः-नन्दन", "अभिलापः-लाप"], // अभिनंदन ?? не проходит есст. из-за точки FIXME: нужна общая обработка всегда

    ["अभि-", "अभिमुखः-मुख", "अभिनयः-नय"],
    ["अभि-", "अभ्युत्थानः-उत्थान", "अभ्युदयः-उदय"], // अध्युत्थानः
    ["अव-", "अवगणनाः-गणना", "अवतरणः-तरण"],
    ["अव-", "अवकृपाः-कृपा", "अवगुणः-गुण"],
    ["आ-", "आकण्ठः-कण्ठ", "आजन्मः-जन्म"], // आकंठ - то же самое
    ["आ-", "आरक्तः-रक्त"],
    ["आ-", "आगमनः-गमन", "आदानः-दान"],
    ["आ-", "आक्रमणः-क्रमण", "आकलनः-कलन"],
    ["उत्-", "उत्कर्षः-कर्ष", "उत्तीर्णः-तीर्ण", "उद्भिन्नः-भिन्न"],
    ["उप-", "उपाध्यक्षः-अध्यक्ष", "उपदिशाः-दिशा"], // FIXME: a - [a,A]
    ["उप-", "उपग्रहः-ग्रह", "उपवेदः-वेद", "उपनेत्रः-नेत्र"],

    // DUR-DUS
    ["दुर्-", "दुराशाः-आशा", "दुरुक्तिः-उक्ति"],
    ["दुस्-", "दुश्चिन्त्यः-चिन्त्य", "दुष्कृतः-कृत", "दुस्तीर्थः-तीर्थ", "दुःशकः-शक"], // dus-

    ["नि-", "निमग्नः-मग्न", "निबन्धः-बन्ध"], // то же निबंधः
    ["नि-", "निकामः-काम", "निचिरः-चिर"], // निजीर

    ["निर्-", "निरञ्जनः-अञ्जन", "निरादानः-आदान"],
    ["निस्-", "निस्तानः-तान", "निश्चलः-चल", "निःशेषः-शेष", "निष्कामः-काम"], // nis- निस्तान

    ["परा-", "पराजयः-जय", "पराभवः-भव"],
    ["परि-", "परिपाकः-पाक", "परिपूर्णः-पूर्ण", "परिमितः-मित", "परिश्रमः-श्रम", "परिवारः-वार"],
    ["प्र-", "प्रकोपः-कोप", "प्रबलः-बल", "प्रपीतः-पीत"],

    ["प्रति-", "प्रतिकूलः-कूल", "प्रतिच्छायाः-छाया"],
    ["प्रति-", "प्रतिदिनः-दिन", "प्रतिवर्षः-वर्ष", "प्रत्येकः-एक"],

    ["वि-", "विख्यातः-ख्यात", "विनतिः-नति", "विवादः-वाद"],
    ["वि-", "विफलः-फल", "विधवाः-धव", "विभक्तिः-भक्ति"],

    ["सम्-", "संस्कृतः-कृत", "संस्कारः-कार", "संगीतः-गीत"],
    ["सम्-", "संयमः-यम", "संयोगः-योग", "संकीर्णः-कीर्ण"],

    ["सम्-", "संतुष्टः-तुष्ट"],



    ["सु-", "सुभाषितः-भाषित", "सुकृतः-कृत", "सुग्रासः-ग्रास"],
    ["सु-", "सुगमः-गम", "सुकरः-कर", "स्वल्पः-अल्प"], // NB: <===== su - sva
    ["सु-", "सुबोधितः-बोधित", "सुशिक्षितः-शिक्षित"]
]

describe(desc, function() {
    utils.upasarga(desc, tests);
});
