var u = require('../utils');
var desc = {gend: 'masc', var: 'u'};

// total 72

var tests = {
    'guru': { // guru
        'sg': ['गुरुः', 'गुरो', 'गुरुम्', 'गुरुणा', 'गुरवे', 'गुरोः', 'गुरोः', 'गुरौ'],
        'du': ['गुरू', 'गुरू', 'गुरू', 'गुरुभ्याम्', 'गुरुभ्याम्', 'गुरुभ्याम्', 'गुर्वोः', 'गुर्वोः'],
        'pl': ['गुरवः', 'गुरवः', 'गुरून्', 'गुरुभिः', 'गुरुभ्यः', 'गुरुभ्यः', 'गुरूणाम्', 'गुरुषु'],
    },
    'taru': { // tree
        'sg': ['तरुः', 'तरो', 'तरुम्', 'तरुणा', 'तरवे', 'तरोः', 'तरोः', 'तरौ'],
        'du': ['तरू', 'तरू', 'तरू', 'तरुभ्याम्', 'तरुभ्याम्', 'तरुभ्याम्', 'तर्वोः', 'तर्वोः'],
        'pl': ['तरवः', 'तरवः', 'तरून्', 'तरुभिः', 'तरुभ्यः', 'तरुभ्यः', 'तरूणाम्', 'तरुषु'],
    },
    'paSu': { // animal
        'sg': ['पशुः', 'पशो', 'पशुम्', 'पशुना', 'पशवे', 'पशोः', 'पशोः', 'पशौ'],
        'du': ['पशू', 'पशू', 'पशू', 'पशुभ्याम्', 'पशुभ्याम्', 'पशुभ्याम्', 'पश्वोः', 'पश्वोः'],
        'pl': ['पशवः', 'पशवः', 'पशून्', 'पशुभिः', 'पशुभ्यः', 'पशुभ्यः', 'पशूनाम्', 'पशुषु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
