var u = require('../utils');
var desc = {gend: 'masc', var: 'an'};


var tests = {
    'rAjan': { // king
        'sg': ['राजा', 'राजन्', 'राजानम्', 'राज्ञा', 'राज्ञे', 'राज्ञः', 'राज्ञः', 'राजनि-राज्ञि'],
        'du': ['राजानौ', 'राजानौ', 'राजानौ', 'राजभ्याम्', 'राजभ्याम्', 'राजभ्याम्', 'राज्ञोः', 'राज्ञोः'],
        'pl': ['राजानः', 'राजानः', 'राज्ञः', 'राजभिः', 'राजभ्यः', 'राजभ्यः', 'राज्ञाम्', 'राजसु'],
    },
    'Atman': { // soul
        'sg': ['आत्मा', 'आत्मन्', 'आत्मानम्', 'आत्मना', 'आत्मने', 'आत्मनः', 'आत्मनः', 'आत्मनि'],
        'du': ['आत्मानौ', 'आत्मानौ', 'आत्मानौ', 'आत्मभ्याम्', 'आत्मभ्याम्', 'आत्मभ्याम्', 'आत्मनोः', 'आत्मनोः'],
        'pl': ['आत्मानः', 'आत्मानः', 'आत्मनः', 'आत्मभिः', 'आत्मभ्यः', 'आत्मभ्यः', 'आत्मनाम्', 'आत्मसु'],
    },


    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
