var u = require('../utils');
var desc = {gend: 'fem', var: 'O'};

// totals 48

var tests = {
    'nO': { // ship
        'sg': ['नौः', 'नौः', 'नावम्', 'नावा', 'नावे', 'नावः', 'नावः', 'नावि'],
        'du': ['नावौ', 'नावौ', 'नावौ', 'नौभ्याम्', 'नौभ्याम्', 'नौभ्याम्', 'नावोः', 'नावोः'],
        'pl': ['नावः', 'नावः', 'नावः', 'नौभिः', 'नौभ्यः', 'नौभ्यः', 'नावाम्', 'नौषु'],
    },
    'glO': { // round lump, the moon // FIXME: тут все правильно, но нужно продублировать тест и парадригму в masc
        'sg': ['ग्लौः', 'ग्लौः', 'ग्लावम्', 'ग्लावा', 'ग्लावे', 'ग्लावः', 'ग्लावः', 'ग्लावि'],
        'du': ['ग्लावौ', 'ग्लावौ', 'ग्लावौ', 'ग्लौभ्याम्', 'ग्लौभ्याम्', 'ग्लौभ्याम्', 'ग्लावोः', 'ग्लावोः'],
        'pl': ['ग्लावः', 'ग्लावः', 'ग्लावः', 'ग्लौभिः', 'ग्लौभ्यः', 'ग्लौभ्यः', 'ग्लावाम्', 'ग्लौषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
