var u = require('../utils');
var desc = {gend: 'masc', var: 'E'};

// 24

var tests = {
    'rE': { // relm, property, goods
        'sg': ['राः', 'राः', 'रायम्', 'राया', 'राये', 'रायः', 'रायः', 'रायि'],
        'du': ['रायौ', 'रायौ', 'रायौ', 'राभ्याम्', 'राभ्याम्', 'राभ्याम्', 'रायोः', 'रायोः'],
        'pl': ['रायः', 'रायः', 'रायः', 'राभिः', 'राभ्यः', 'राभ्यः', 'रायाम्', 'रासु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
