var u = require('../utils');
var desc = {gend: 'masc', var: 'at'};


var tests = {
    'Bagavat': { // divine
        'sg': ['भगवान्', 'भगवन्', 'भगवन्तम्', 'भगवता', 'भगवते', 'भगवतः', 'भगवतः', 'भगवति'],
        'du': ['भगवन्तौ', 'भगवन्तौ', 'भगवन्तौ', 'भगवद्भ्याम्', 'भगवद्भ्याम्', 'भगवद्भ्याम्', 'भगवतोः', 'भगवतोः'],
        'pl': ['भगवन्तः', 'भगवन्तः', 'भगवतः', 'भगवद्भिः', 'भगवद्भ्यः', 'भगवद्भ्यः', 'भगवताम्', 'भगवत्सु'],
    },

    'asumat': { // life m.
        'sg': ['असुमान्', 'असुमन्', 'असुमन्तम्', 'असुमता', 'असुमते', 'असुमतः', 'असुमतः', 'असुमति'],
        'du': ['असुमन्तौ', 'असुमन्तौ', 'असुमन्तौ', 'असुमद्भ्याम्', 'असुमद्भ्याम्', 'असुमद्भ्याम्', 'असुमतोः', 'असुमतोः'],
        'pl': ['असुमन्तः', 'असुमन्तः', 'असुमतः', 'असुमद्भिः', 'असुमद्भ्यः', 'असुमद्भ्यः', 'असुमताम्', 'असुमत्सु'],
    },
    // 'dyumat': { // adj. masc. - light, clear // FIXME: это работает, комм чтобы не создавать файл для neut
    //     'sg': ['द्युमान्', 'द्युमन्', 'द्युमन्तम्', 'द्युमता', 'द्युमते', 'द्युमतः', 'द्युमतः', 'द्युमति'],
    //     'du': ['द्युमन्तौ', 'द्युमन्तौ', 'द्युमन्तौ', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमतोः', 'द्युमतोः'],
    //     'pl': ['द्युमन्तः', 'द्युमन्तः', 'द्युमतः', 'द्युमद्भिः', 'द्युमद्भ्यः', 'द्युमद्भ्यः', 'द्युमताम्', 'द्युमत्सु'],
    // },

    'dyumat': { // neut. - eye
        'sg': ['द्युमत्', 'द्युमत्', 'द्युमत्', 'द्युमता', 'द्युमते', 'द्युमतः', 'द्युमतः', 'द्युमति'],
        'du': ['द्युमती', 'द्युमती', 'द्युमती', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमद्भ्याम्', 'द्युमतोः', 'द्युमतोः'],
        'pl': ['द्युमन्ति', 'द्युमन्ति', 'द्युमन्ति', 'द्युमद्भिः', 'द्युमद्भ्यः', 'द्युमद्भ्यः', 'द्युमताम्', 'द्युमत्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
