var u = require('../utils');
var desc = {gend: 'neut', var: 'cons'};

// total

var tests = {
    'trivft': { // threefold - neut - adj
        'sg': ['त्रिवृत्', 'त्रिवृत्', 'त्रिवृत्', 'त्रिवृता', 'त्रिवृते', 'त्रिवृतः', 'त्रिवृतः', 'त्रिवृति'],
        'du': ['त्रिवृती', 'त्रिवृती', 'त्रिवृती', 'त्रिवृद्भ्याम्', 'त्रिवृद्भ्याम्', 'त्रिवृद्भ्याम्', 'त्रिवृतोः', 'त्रिवृतोः'],
        'pl': ['त्रिवृन्ति', 'त्रिवृन्ति', 'त्रिवृन्ति', 'त्रिवृद्भिः', 'त्रिवृद्भ्यः', 'त्रिवृद्भ्यः', 'त्रिवृताम्', 'त्रिवृत्सु'],
    },
    'hfd': { // heart // FIXME: ошибки,
        'sg': ['', '', '', 'हृदा', 'ह्र्दे', 'ह्र्दः', 'ह्र्दः', 'ह्र्दि'],
        'du': ['', '', '', 'हृद्भ्याम्', 'ह्र्द्भ्याम्', 'ह्र्द्भ्याम्', 'ह्र्दोः', 'ह्र्दोः'],
        'pl': ['', '', 'हृदः', 'ह्र्द्भिः', 'ह्र्द्भ्यः', 'ह्र्द्भ्यः', 'ह्र्दाम्', 'ह्र्त्सु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
