var u = require('../utils');
var desc = {gend: 'masc', var: 'ri'};

// total 48

var tests = {
    'pitf': { // father
        'sg': ['पिता', 'पितः', 'पितरम्', 'पित्रा', 'पित्रे', 'पितुः', 'पितुः', 'पितरि'],
        'du': ['पितरौ', 'पितरौ', 'पितरौ', 'पितृभ्याम्', 'पितृभ्याम्', 'पितृभ्याम्', 'पित्रोः', 'पित्रोः'],
        'pl': ['पितरः', 'पितरः', 'पितॄन्', 'पितृभिः', 'पितृभ्यः', 'पितृभ्यः', 'पितॄणाम्', 'पितृषु'],
    },
    'kartf': { // subject of a sentence
        'sg': ['कर्ता', 'कर्तः', 'कर्तारम्', 'कर्त्रा', 'कर्त्रे', 'कर्तुः', 'कर्तुः', 'कर्तरि'],
        'du': ['कर्तारौ', 'कर्तारौ', 'कर्तारौ', 'कर्तृभ्याम्', 'कर्तृभ्याम्', 'कर्तृभ्याम्', 'कर्त्रोः', 'कर्त्रोः'],
        'pl': ['कर्तारः', 'कर्तारः', 'कर्तॄन्', 'कर्तृभिः', 'कर्तृभ्यः', 'कर्तृभ्यः', 'कर्तॄणाम्', 'कर्तृषु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
