var u = require('../utils');
var desc = {gend: 'fem', var: 'A'};

// 96
/*
  проверяю наличие в словаре слов на A. д.б. еще обработка суффикса A, и поиск слова на a краткую
*/

var tests = {
    'vidyA': { // any knowledge
        'sg': ['विद्या', 'विद्ये', 'विद्याम्', 'विद्यया', 'विद्यायै', 'विद्यायाः', 'विद्यायाः', 'विद्यायाम्'],
        'du': ['विद्ये', 'विद्ये', 'विद्ये', 'विद्याभ्याम्', 'विद्याभ्याम्', 'विद्याभ्याम्', 'विद्ययोः', 'विद्ययोः'],
        'pl': ['विद्याः', 'विद्याः', 'विद्याः', 'विद्याभिः', 'विद्याभ्यः', 'विद्याभ्यः', 'विद्यानाम्', 'विद्यासु'],
    },
    'senA': { // army - B. derivative stem
        'sg': ['सेना', 'सेने', 'सेनाम्', 'सेनया', 'सेनायै', 'सेनायाः', 'सेनायाः', 'सेनायाम्'],
        'du': ['सेने', 'सेने', 'सेने', 'सेनाभ्याम्', 'सेनाभ्याम्', 'सेनाभ्याम्', 'सेनयोः', 'सेनयोः'],
        'pl': ['सेनाः', 'सेनाः', 'सेनाः', 'सेनाभिः', 'सेनाभ्यः', 'सेनाभ्यः', 'सेनानाम्', 'सेनासु'],
    },
    'jA': { // progeny - A. root stem
        'sg': ['जा', 'जे', 'जाम्', 'जया', 'जायै', 'जायाः', 'जायाः', 'जायाम्'],
        'du': ['जे', 'जे', 'जे', 'जाभ्याम्', 'जाभ्याम्', 'जाभ्याम्', 'जयोः', 'जयोः'],
        'pl': ['जाः', 'जाः', 'जाः', 'जाभिः', 'जाभ्यः', 'जाभ्यः', 'जानाम्', 'जासु'],
    },
    'kaTA': { // speech
        'sg': ['कथा', 'कथे', 'कथाम्', 'कथया', 'कथायै', 'कथायाः', 'कथायाः', 'कथायाम्'],
        'du': ['कथे', 'कथे', 'कथे', 'कथाभ्याम्', 'कथाभ्याम्', 'कथाभ्याम्', 'कथयोः', 'कथयोः'],
        'pl': ['कथाः', 'कथाः', 'कथाः', 'कथाभिः', 'कथाभ्यः', 'कथाभ्यः', 'कथानाम्', 'कथासु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
