var u = require('../utils');
var desc = {gend: 'neut', var: 'f'};

// total

var tests = {

    // непонятно - не доделано?

    // DESC: тесты kridanta-tric, suff -tra, gend-neut
    // f3- M-x kridanta-noun f4, курсор в первую колонку
    // '__ak': { //
    //     'sg': ['अकितृ', 'अकितृ', 'अकित्रा', 'अकित्रे', 'अकितृणः', 'अकितृणः', 'अकितृणि', 'अकितृ'],
    //     'du': ['अकितृणी', 'अकितृणी', 'अकितृभ्याम्', 'अकितृभ्याम्', 'अकितृभ्याम्', 'अकित्रोः', 'अकित्रोः', 'अकितृणी'],
    //     'pl': ['बहुवचनम्', 'अकितॄणि', 'अकितॄणि', 'अकितृभिः', 'अकितृभ्यः', 'अकितृभ्यः', 'अकितॄणाम्', 'अकितृषु'],
    // },


    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
