var u = require('../utils');
var desc = {gend: 'masc', var: 's'};

// total 24

var tests = {
    'mAs': { // month - m.
        'sg': ['माः', 'माः', 'मासम्', 'मासा', 'मासे', 'मासः', 'मासः', 'मासि'],
        'du': ['मासौ', 'मासौ', 'मासौ', 'मार्भ्याम्', 'मार्भ्याम्', 'मार्भ्याम्', 'मासोः', 'मासोः'],
        'pl': ['मासः', 'मासः', 'मासः', 'मार्भिः', 'मार्भ्यः', 'मार्भ्यः', 'मासाम्', 'माःसु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
