var u = require('../utils');
var desc = {gend: 'fem', var: 'U'};

// total 77

var tests = {
    'BU': { // earth - A. root
        'sg': ['भूः', 'भूः', 'भुवम्', 'भुवा', 'भुवे-भुवै', 'भुवः-भुवाः', 'भुवः-भुवाः', 'भुवि-भुवाम्'],
        'du': ['भुवौ', 'भुवौ', 'भुवौ', 'भूभ्याम्', 'भूभ्याम्', 'भूभ्याम्', 'भुवोः', 'भुवोः'],
        'pl': ['भुवः', 'भुवः', 'भुवः', 'भूभिः', 'भूभ्यः', 'भूभ्यः', 'भुवाम्-भूनाम्', 'भूषु'],
    },
    'vaDU': { // woman
        'sg': ['वधूः', 'वधु', 'वधूम्', 'वध्वा', 'वध्वै', 'वध्वाः', 'वध्वाः', 'वध्वाम्'],
        'du': ['वध्वौ', 'वध्वौ', 'वध्वौ', 'वधूभ्याम्', 'वधूभ्याम्', 'वधूभ्याम्', 'वध्वोः', 'वध्वोः'],
        'pl': ['वध्वः', 'वध्वः', 'वधूः', 'वधूभिः', 'वधूभ्यः', 'वधूभ्यः', 'वधूनाम्', 'वधूषु'],
    },
    'camU': { // army
        'sg': ['चमूः', 'चमु', 'चमूम्', 'चम्वा', 'चम्वै', 'चम्वाः', 'चम्वाः', 'चम्वाम्'],
        'du': ['चम्वौ', 'चम्वौ', 'चम्वौ', 'चमूभ्याम्', 'चमूभ्याम्', 'चमूभ्याम्', 'चम्वोः', 'चम्वोः'],
        'pl': ['चम्वः', 'चम्वः', 'चमूः', 'चमूभिः', 'चमूभ्यः', 'चमूभ्यः', 'चमूनाम्', 'चमूषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
