var u = require('../utils');
var desc = {gend: 'fem', var: 'cons'};

// total 111

var tests = {
    // Root, W.383 FEM
    'fc': { // verse - f. - root
        'sg': ['ऋक्', 'ऋक्', 'ऋचम्', 'ऋचा', 'ऋचे', 'ऋचः', 'ऋचः', 'ऋचि'],
        'du': ['ऋचौ', 'ऋचौ', 'ऋचौ', 'ऋग्भ्याम्', 'ऋग्भ्याम्', 'ऋग्भ्याम्', 'ऋचोः', 'ऋचोः'],
        'pl': ['ऋचः', 'ऋचः', 'ऋचः', 'ऋग्भिः', 'ऋग्भ्यः', 'ऋग्भ्यः', 'ऋचाम्', 'ऋक्षु'],
    },
    'diS': { // direction
        'sg': ['दिक्', 'दिक्', 'दिशम्', 'दिशा', 'दिशे', 'दिशः', 'दिशः', 'दिशि'],
        'du': ['दिशौ', 'दिशौ', 'दिशौ', 'दिग्भ्याम्', 'दिग्भ्याम्', 'दिग्भ्याम्', 'दिशोः', 'दिशोः'],
        'pl': ['दिशः', 'दिशः', 'दिशः', 'दिग्भिः', 'दिग्भ्यः', 'दिग्भ्यः', 'दिशाम्', 'दिक्षु'],
    },
    // 'vAc': { // speech - f.
    //     'sg': ['वाक्', 'वाक्', 'वाचम्', 'वाचा', 'वाचे', 'वाचः', 'वाचः', 'वाचि'],
    //     'du': ['वाचौ', 'वाचौ', 'वाचौ', 'वाग्भ्याम्', 'वाग्भ्याम्', 'वाग्भ्याम्', 'वाचोः', 'वाचोः'],
    //     'pl': ['वाचः', 'वाचः', 'वाचः', 'वाग्भिः', 'वाग्भ्यः', 'वाग्भ्यः', 'वाचाम्', 'वाक्षु'],
    // },
    'ap': { // water - f. ( or m. ? )
        'sg': ['अप्', 'अप्', 'अपम्', 'अपा', 'अपे', 'अपः', 'अपः', 'अपि'],
        'du': ['अपौ', 'अपौ', 'अपौ', 'अब्भ्याम्', 'अब्भ्याम्', 'अब्भ्याम्', 'अपोः', 'अपोः'],
        'pl': ['अपः', 'अपः', 'अपः', 'अब्भिः', 'अब्भ्यः', 'अब्भ्यः', 'अपाम्', 'अप्सु'],
    },

    'stuB': { // praise, f.
        'sg': ['स्तुप्', 'स्तुप्', 'स्तुभम्', 'स्तुभा', 'स्तुभे', 'स्तुभः', 'स्तुभः', 'स्तुभि'],
        'du': ['स्तुभौ', 'स्तुभौ', 'स्तुभौ', 'स्तुब्भ्याम्', 'स्तुब्भ्याम्', 'स्तुब्भ्याम्', 'स्तुभोः', 'स्तुभोः'],
        'pl': ['स्तुभः', 'स्तुभः', 'स्तुभः', 'स्तुब्भिः', 'स्तुब्भ्यः', 'स्तुब्भ्यः', 'स्तुभाम्', 'स्तुप्सु'],
    },
    'druh': { // harm - f. // FIXME: много ошибок // द्
        'sg': ['ध्रुट्-ध्रुक्', 'ध्रुट्-ध्रुक्', 'द्रुहम्', 'द्रुहा', 'द्रुहे', 'द्रुहः', 'द्रुहः', 'द्रुहि'],
        'du': ['द्रुहौ', 'द्रुहौ', 'द्रुहौ', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'ध्रुड्भ्याम्-ध्रुग्भ्याम्', 'द्रुहोः', 'द्रुहोः'],
        'pl': ['द्रुहः', 'द्रुहः', 'द्रुहः', 'ध्रुड्भिः-ध्रुग्भिः', 'ध्रुड्भ्यः-ध्रुग्भ्यः', 'ध्रुड्भ्यः-ध्रुग्भ्यः', 'द्रुहाम्', 'ध्रुट्सु-ध्रुक्षु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
