var u = require('../utils');
var desc = {gend: 'fem', var: 'I'};

// total 101

var tests = {
    'DI': { // thought - A. root
        'sg': ['धीः', 'धीः', 'धियम्', 'धिया', 'धिये-धियै', 'धियः-धियाः', 'धियः-धियाः', 'धियि-धियाम्'],
        'du': ['धियौ', 'धियौ', 'धियौ', 'धीभ्याम्', 'धीभ्याम्', 'धीभ्याम्', 'धियोः', 'धियोः'],
        'pl': ['धियः', 'धियः', 'धियः', 'धीभिः', 'धीभ्यः', 'धीभ्यः', 'धियाम्-धीनाम्', 'धीषु'],
    },
    'vApI': { // pool - B. derivative
        'sg': ['वापी', 'वापि', 'वापीम्', 'वाप्या', 'वाप्यै', 'वाप्याः', 'वाप्याः', 'वाप्याम्'],
        'du': ['वाप्यौ', 'वाप्यौ', 'वाप्यौ', 'वापीभ्याम्', 'वापीभ्याम्', 'वापीभ्याम्', 'वाप्योः', 'वाप्योः'],
        'pl': ['वाप्यः', 'वाप्यः', 'वापीः', 'वापीभिः', 'वापीभ्यः', 'वापीभ्यः', 'वापीनाम्', 'वापीषु'],
    },
    'nadI': { // river
        'sg': ['नदी', 'नदि', 'नदीम्', 'नद्या', 'नद्यै', 'नद्याः', 'नद्याः', 'नद्याम्'],
        'du': ['नद्यौ', 'नद्यौ', 'नद्यौ', 'नदीभ्याम्', 'नदीभ्याम्', 'नदीभ्याम्', 'नद्योः', 'नद्योः'],
        'pl': ['नद्यः', 'नद्यः', 'नदीः', 'नदीभिः', 'नदीभ्यः', 'नदीभ्यः', 'नदीनाम्', 'नदीषु'],
    },
    'devI': { // goddess
        'sg': ['देवी', 'देवि', 'देवीम्', 'देव्या', 'देव्यै', 'देव्याः', 'देव्याः', 'देव्याम्'],
        'du': ['देव्यौ', 'देव्यौ', 'देव्यौ', 'देवीभ्याम्', 'देवीभ्याम्', 'देवीभ्याम्', 'देव्योः', 'देव्योः'],
        'pl': ['देव्यः', 'देव्यः', 'देवीः', 'देवीभिः', 'देवीभ्यः', 'देवीभ्यः', 'देवीनाम्', 'देवीषु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
