var u = require('../utils');
var desc = {gend: 'fem', var: 'r'};

// total 24

var tests = {
    'gir': { // song
        // FIXME - удлиннение гласной в r-fem
        'sg': ['गीः', 'गीः', 'गिरम्', 'गिरा', 'गिरे', 'गिरः', 'गिरः', 'गिरि'],
        'du': ['गिरौ', 'गिरौ', 'गिरौ', 'गीर्भ्याम्', 'गीर्भ्याम्', 'गीर्भ्याम्', 'गिरोः', 'गिरोः'],
        'pl': ['गिरः', 'गिरः', 'गिरः', 'गीर्भिः', 'गीर्भ्यः', 'गीर्भ्यः', 'गिराम्', 'गीर्षु'],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
