var u = require('../utils');
var desc = {gend: 'masc', var: 'us'};

// total 24

var tests = {
    'janus': { // birth, creation
        'sg': ['जनुः', 'जनुः', 'जनुषम्', 'जनुषा', 'जनुषे', 'जनुषः', 'जनुषः', 'जनुषि'],
        'du': ['जनुषौ', 'जनुषौ', 'जनुषौ', 'जनुर्भ्याम्', 'जनुर्भ्याम्', 'जनुर्भ्याम्', 'जनुषोः', 'जनुषोः'],
        'pl': ['जनुषः', 'जनुषः', 'जनुषः', 'जनुर्भिः', 'जनुर्भ्यः', 'जनुर्भ्यः', 'जनुषाम्', 'जनुःषु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(u.title(desc), function() {
    u.fireNoun(tests, desc);
});
