var utils = require('../utils');
var desc = 'only-tric-f'; // ri
//  kridanta-tric, masc
// зачем я проверю f ? убрать нахрен?

var tests = {
    'ak': { //
        'sg': ['अकिता', 'अकितः', 'अकितारम्', 'अकित्रा', 'अकित्रे', 'अकितुः', 'अकितुः', 'अकितरि'],
        'du': ['अकितारौ', 'अकितारौ', 'अकितारौ', 'अकितृभ्याम्', 'अकितृभ्याम्', 'अकितृभ्याम्', 'अकित्रोः', 'अकित्रोः'],
        'pl': ['अकितारः', 'अकितारः', 'अकितॄन्', 'अकितृभिः', 'अकितृभ्यः', 'अकितृभ्यः', 'अकितॄणाम्', 'अकितृषु'],
    },

    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
    '': { //
        'sg': ['', '', '', '', '', '', '', ''],
        'du': ['', '', '', '', '', '', '', ''],
        'pl': ['', '', '', '', '', '', '', ''],
    },
}

describe(desc, function() {
    utils.fireNoun(tests, desc, true);
});
