//
var utils = require('../utils');
var gana = 'one';

var ganaOne = {
    // FIXME: сюда попадает SiriSirA, убрать со стемом, // FIXME: _lit_ baBU, исключение, в Terms, в Veda также sU w.789
    'BU': { // be
        'lat_par': ['भवति', ], //'भवसि', 'भवामि', 'भवतः', 'भवथः', 'भवावः', 'भवन्ति', 'भवथ', 'भवामः'],
        'lat_pas': ['भूयते', ], // 'भूयसे', 'भूये', 'भूयेते', 'भूयेथे', 'भूयावहे', 'भूयन्ते', 'भूयध्वे', 'भूयामहे'],
        'lan_par': ['अभवत्', ], //'अभवः', 'अभवम्', 'अभवताम्', 'अभवतम्', 'अभवाव', 'अभवन्', 'अभवत', 'अभवाम'],
        'lan_pas': ['अभूयत', ], //'अभूयथाः', 'अभूये', 'अभूयेताम्', 'अभूयेथाम्', 'अभूयावहि', 'अभूयन्त', 'अभूयध्वम्', 'अभूयामहि'],
        'lot_par': ['भवतु', ], // 'भव', 'भवानि', 'भवताम्', 'भवतम्', 'भवाव', 'भवन्तु', 'भवत', 'भवाम'],
        'lot_pas': ['भूयताम्', ], // 'भूयस्व', 'भूयै', 'भूयेताम्', 'भूयेथाम्', 'भूयावहै', 'भूयन्ताम्', 'भूयध्वम्', 'भूयामहै'],
        // 'lit_par': ['बभूव', ], // 'बभूविथ-बभूथ', 'बभूव', 'बभूवतुः', 'बभूवथुः', 'बभूविव', 'बभूवुः', 'बभूव', 'बभूविम'],
    },

}

var ganaTwo = {
    'ad': { // to eat
        'lat_par': ['अत्ति', ], //'अत्सि', 'अद्मि', 'अत्तः', 'अत्थः', 'अद्वः', 'अदन्ति', 'अत्थ', 'अद्मः'],
        'lat_pas': ['अद्यते', ], //'अद्यसे', 'अद्ये', 'अद्येते', 'अद्येथे', 'अद्यावहे', 'अद्यन्ते', 'अद्यध्वे', 'अद्यामहे'],
        'lan_par': ['आदत्', ], // 'आदः', 'आदम्', 'आत्ताम्', 'आत्तम्', 'आद्व', 'आदन्', 'आत्त', 'आद्म'],
        'lan_pas': ['आद्यत', ], // 'आद्यथाः', 'आद्ये', 'आद्येताम्', 'आद्येथाम्', 'आद्यावहि', 'आद्यन्त', 'आद्यध्वम्', 'आद्यामहि'],
        'lot_par': ['अत्तु', ], // 'अद्धि', 'अदानि', 'अत्ताम्', 'अत्तम्', 'अदाव', 'अदन्तु', 'अत्त', 'अदाम'],
        'lot_pas': ['अद्यताम्', ], // 'अद्यस्व', 'अद्यै', 'अद्येताम्', 'अद्येथाम्', 'अद्यावहै', 'अद्यन्ताम्', 'अद्यध्वम्', 'अद्यामहै'],
        // 'lit_par': ['आद', ], // 'आदिथ', 'आद', 'आदतुः', 'आदथुः', 'आदिव', 'आदुः', 'आद', 'आदिम'],
    },
}

var ganaFour = {
    'kup': { // be angry
        'lat_par': ['कुप्यति', ], // 'कुप्यसि', 'कुप्यामि', 'कुप्यतः', 'कुप्यथः', 'कुप्यावः', 'कुप्यन्ति', 'कुप्यथ', 'कुप्यामः'],
        'lat_pas': ['कुप्यते', ], // 'कुप्यसे', 'कुप्ये', 'कुप्येते', 'कुप्येथे', 'कुप्यावहे', 'कुप्यन्ते', 'कुप्यध्वे', 'कुप्यामहे'],
        'lan_par': ['अकुप्यत्', ], // 'अकुप्यः', 'अकुप्यम्', 'अकुप्यताम्', 'अकुप्यतम्', 'अकुप्याव', 'अकुप्यन्', 'अकुप्यत', 'अकुप्याम'],
        'lan_pas': ['अकुप्यत', ], // 'अकुप्यथाः', 'अकुप्ये', 'अकुप्येताम्', 'अकुप्येथाम्', 'अकुप्यावहि', 'अकुप्यन्त', 'अकुप्यध्वम्', 'अकुप्यामहि'],
        'lot_par': ['कुप्यतु', ], // 'कुप्य', 'कुप्यानि', 'कुप्यताम्', 'कुप्यतम्', 'कुप्याव', 'कुप्यन्तु', 'कुप्यत', 'कुप्याम'],
        'lot_pas': ['कुप्यताम्', ], // 'कुप्यस्व', 'कुप्यै', 'कुप्येताम्', 'कुप्येथाम्', 'कुप्यावहै', 'कुप्यन्ताम्', 'कुप्यध्वम्', 'कुप्यामहै'],
        // 'lit_par': ['चुकोप', ], // 'चुकोपिथ', 'चुकोप', 'चुकुपतुः', 'चुकुपथुः', 'चुकुपिव', 'चुकुपुः', 'चुकुप', 'चुकुपिम'],
    },
}

var ganaFive = {
    'su': { // press
        'lat_par': ['सुनोति', ], // 'सुनोषि', 'सुनोमि', 'सुनुतः', 'सुनुथः', 'सुन्वः-सुनुवः', 'सुन्वन्ति', 'सुनुथ', 'सुन्मः-सुनुमः'],
        'lat_atm': ['सुनुते', ], // 'सुनुषे', 'सुन्वे', 'सुन्वाते', 'सुन्वाथे', 'सुन्वहे-सुनुवहे', 'सुन्वते', 'सुनुध्वे', 'सुन्महे-सुनुमहे'],
        'lat_pas': ['सूयते', ], // 'सूयसे', 'सूये', 'सूयेते', 'सूयेथे', 'सूयावहे', 'सूयन्ते', 'सूयध्वे', 'सूयामहे'],
        'lan_par': ['असुनोत्', ], // 'असुनोः', 'असुनवम्', 'असुनुताम्', 'असुनुतम्', 'असुन्व-असुनुव', 'असुन्वन्', 'असुनुत', 'असुन्म-असुनुम'],
        'lan_atm': ['असुनुत', ], // 'असुनुथाः', 'असुन्वि', 'असुन्वाताम्', 'असुन्वाथाम्', 'असुन्वहि-असुनुवहि', 'असुन्वत', 'असुनुध्वम्', 'असुन्महि-असुनुमहि'],
        'lan_pas': ['असूयत', ], // 'असूयथाः', 'असूये', 'असूयेताम्', 'असूयेथाम्', 'असूयावहि', 'असूयन्त', 'असूयध्वम्', 'असूयामहि'],
        'lot_par': ['सुनोतु', ], // 'सुनु', 'सुनवानि', 'सुनुताम्', 'सुनुतम्', 'सुनवाव', 'सुन्वन्तु', 'सुनुत', 'सुनवाम'],
        'lot_atm': ['सुनुताम्', ], // 'सुनुष्व', 'सुनवै', 'सुन्वाताम्', 'सुन्वाथाम्', 'सुनवावहै', 'सुन्वताम्', 'सुनुध्वम्', 'सुनवामहै'],
        'lot_pas': ['सूयताम्', ], // 'सूयस्व', 'सूयै', 'सूयेताम्', 'सूयेथाम्', 'सूयावहै', 'सूयन्ताम्', 'सूयध्वम्', 'सूयामहै'],
        // 'lin_par': ['सुनुयात्', ], // 'सुनुयाः', 'सुनुयाम्', 'सुनुयाताम्', 'सुनुयातम्', 'सुनुयाव', 'सुनुयुः', 'सुनुयात', 'सुनुयाम'],
        // 'lin_atm': ['सुन्वीत', ], // 'सुन्वीथाः', 'सुन्वीय', 'सुन्वीयाताम्', 'सुन्वीयाथाम्', 'सुन्वीवहि', 'सुन्वीरन्', 'सुन्वीध्वम्', 'सुन्वीमहि'],
        // 'lin_pas': ['सूयेत', ], // 'सूयेथाः', 'सूयेय', 'सूयेयाताम्', 'सूयेयाथाम्', 'सूयेवहि', 'सूयेरन्', 'सूयेध्वम्', 'सूयेमहि'],
    },
}

var ganaSix = {
    'tud': { // strike तुद्
        'lat_par': ['तुदति', ], // 'तुदसि', 'तुदामि', 'तुदतः', 'तुदथः', 'तुदावः', 'तुदन्ति', 'तुदथ', 'तुदामः'],
        'lat_atm': ['तुदते', ], // 'तुदसे', 'तुदे', 'तुदेते', 'तुदेथे', 'तुदावहे', 'तुदन्ते', 'तुदध्वे', 'तुदामहे'],
        'lat_pas': ['तुद्यते', ], // 'तुद्यसे', 'तुद्ये', 'तुद्येते', 'तुद्येथे', 'तुद्यावहे', 'तुद्यन्ते', 'तुद्यध्वे', 'तुद्यामहे'],
        'lan_par': ['अतुदत्', ], // 'अतुदः', 'अतुदम्', 'अतुदताम्', 'अतुदतम्', 'अतुदाव', 'अतुदन्', 'अतुदत', 'अतुदाम'],
        'lan_atm': ['अतुदत', ], // 'अतुदथाः', 'अतुदे', 'अतुदेताम्', 'अतुदेथाम्', 'अतुदावहि', 'अतुदन्त', 'अतुदध्वम्', 'अतुदामहि'],
        'lan_pas': ['अतुद्यत', ], // 'अतुद्यथाः', 'अतुद्ये', 'अतुद्येताम्', 'अतुद्येथाम्', 'अतुद्यावहि', 'अतुद्यन्त', 'अतुद्यध्वम्', 'अतुद्यामहि'],
        'lot_par': ['तुदतु', ], // 'तुद', 'तुदानि', 'तुदताम्', 'तुदतम्', 'तुदाव', 'तुदन्तु', 'तुदत', 'तुदाम'],
        'lot_atm': ['तुदताम्', ], // 'तुदस्व', 'तुदै', 'तुदेताम्', 'तुदेथाम्', 'तुदावहै', 'तुदन्ताम्', 'तुदध्वम्', 'तुदामहै'],
        'lot_pas': ['तुद्यताम्', ], // 'तुद्यस्व', 'तुद्यै', 'तुद्येताम्', 'तुद्येथाम्', 'तुद्यावहै', 'तुद्यन्ताम्', 'तुद्यध्वम्', 'तुद्यामहै'],
        'lit_par': ['तुतोद', ], // 'तुतोदिथ', 'तुतोद', 'तुतुदतुः', 'तुतुदथुः', 'तुतुदिव', 'तुतुदुः', 'तुतुद', 'तुतुदिम'],
        'lit_atm': ['तुतुदे', ], // 'तुतुदिषे', 'तुतुदे', 'तुतुदाते', 'तुतुदाथे', 'तुतुदिवहे', 'तुतुदिरे', 'तुतुदिध्वे', 'तुतुदिमहे'],
    },
}

var ganaSeven = {
    'ruD': { // obstruct
        'lat_par': ['रुणद्धि', ], // 'रुणत्सि', 'रुणध्मि', 'रुन्द्धः', 'रुन्द्धः', 'रुन्ध्वः', 'रुन्धन्ति', 'रुन्द्ध', 'रुन्ध्मः'],
        'lat_atm': ['रुन्द्धे', ], // 'रुन्त्से', 'रुन्धे', 'रुन्धाते', 'रुन्धाथे', 'रुन्ध्वहे', 'रुन्धते', 'रुन्द्ध्वे', 'रुन्ध्महे'],
        'lat_pas': ['रुध्यते', ], // 'रुध्यसे', 'रुध्ये', 'रुध्येते', 'रुध्येथे', 'रुध्यावहे', 'रुध्यन्ते', 'रुध्यध्वे', 'रुध्यामहे'],
        'lan_par': ['अरुणत्', ], // 'अरुणः', 'अरुणधम्', 'अरुन्द्धाम्', 'अरुन्द्धम्', 'अरुन्ध्व', 'अरुन्धन्', 'अरुन्द्ध', 'अरुन्ध्म'],
        'lan_atm': ['अरुन्द्ध', ], // 'अरुन्द्धाः', 'अरुन्धि', 'अरुन्धाताम्', 'अरुन्धाथाम्', 'अरुन्ध्वहि', 'अरुन्धत', 'अरुन्द्ध्वम्', 'अरुन्ध्महि'],
        'lan_pas': ['अरुध्यत', ], // 'अरुध्यथाः', 'अरुध्ये', 'अरुध्येताम्', 'अरुध्येथाम्', 'अरुध्यावहि', 'अरुध्यन्त', 'अरुध्यध्वम्', 'अरुध्यामहि'],
        'lot_par': ['रुणद्धु', ], // 'रुन्द्धि', 'रुणधानि', 'रुन्द्धाम्', 'रुन्द्धम्', 'रुणधाव', 'रुन्धन्तु', 'रुन्द्ध', 'रुणधाम'],
        'lot_atm': ['रुन्द्धाम्', ], // 'रुन्त्स्व', 'रुणधै', 'रुन्धाताम्', 'रुन्धाथाम्', 'रुणधावहै', 'रुन्धताम्', 'रुन्द्ध्वम्', 'रुणधामहै'],
        'lot_pas': ['रुध्यताम्', ], // 'रुध्यस्व', 'रुध्यै', 'रुध्येताम्', 'रुध्येथाम्', 'रुध्यावहै', 'रुध्यन्ताम्', 'रुध्यध्वम्', 'रुध्यामहै'],
        'lit_par': ['रुरोध', ], // 'रुरोधिथ', 'रुरोध', 'रुरुधतुः', 'रुरुधथुः', 'रुरुधिव', 'रुरुधुः', 'रुरुध', 'रुरुधिम'],
        'lit_atm': ['रुरुधे', ], // 'रुरुधिषे', 'रुरुधे', 'रुरुधाते', 'रुरुधाथे', 'रुरुधिवहे', 'रुरुधिरे', 'रुरुधिध्वे', 'रुरुधिमहे'],
    },
}

var ganaEight = {
    'tan': { // extend
        'lat_par': ['तनोति', ], // 'तनोषि', 'तनोमि', 'तनुतः', 'तनुथः', 'तन्वः-तनुवः', 'तन्वन्ति', 'तनुथ', 'तन्मः-तनुमः'],
        'lat_atm': ['तनुते', ], // 'तनुषे', 'तन्वे', 'तन्वाते', 'तन्वाथे', 'तन्वहे-तनुवहे', 'तन्वते', 'तनुध्वे', 'तन्महे-तनुमहे'],
        'lat_pas': ['तन्यते', ], // 'तन्यसे', 'तन्ये', 'तन्येते', 'तन्येथे', 'तन्यावहे', 'तन्यन्ते', 'तन्यध्वे', 'तन्यामहे'],
        'lan_par': ['अतनोत्', ], // 'अतनोः', 'अतनवम्', 'अतनुताम्', 'अतनुतम्', 'अतन्व-अतनुव', 'अतन्वन्', 'अतनुत', 'अतन्म-अतनुम'],
        'lan_atm': ['अतनुत', ], // 'अतनुथाः', 'अतन्वि', 'अतन्वाताम्', 'अतन्वाथाम्', 'अतन्वहि-अतनुवहि', 'अतन्वत', 'अतनुध्वम्', 'अतन्महि-अतनुमहि'],
        'lan_pas': ['अतन्यत', ], // 'अतन्यथाः', 'अतन्ये', 'अतन्येताम्', 'अतन्येथाम्', 'अतन्यावहि', 'अतन्यन्त', 'अतन्यध्वम्', 'अतन्यामहि'],
        // 'lot_par': ['', '', '', '', '', '', '', '', ''],
        // 'lot_atm': ['', '', '', '', '', '', '', '', ''],
        // 'lot_pas': ['', '', '', '', '', '', '', '', ''],
        // 'lit_par': ['ततान', ], // 'तेनिथ-ततन्थ', 'ततान-ततन', 'तेनतुः', 'तेनथुः', 'तेनिव', 'तेनुः', 'तेन', 'तेनिम'],
        // 'lit_atm': ['तेने', ], // 'तेनिषे', 'तेने', 'तेनाते', 'तेनाथे', 'तेनिवहे', 'तेनिरे', 'तेनिध्वे', 'तेनिमहे'],
    },
}

var ganaNine = {
    'krI': { // buy
        'lat_par': ['क्रीणाति', ], // 'क्रीणासि', 'क्रीणामि', 'क्रीणीतः', 'क्रीणीथः', 'क्रीणीवः', 'क्रीणन्ति', 'क्रीणीथ', 'क्रीणीमः'],
        'lat_atm': ['क्रीणीते', ], // 'क्रीणीषे', 'क्रीणे', 'क्रीणाते', 'क्रीणाथे', 'क्रीणीवहे', 'क्रीणते', 'क्रीणीध्वे', 'क्रीणीमहे'],
        'lat_pas': ['क्रीयते', ], // 'क्रीयसे', 'क्रीये', 'क्रीयेते', 'क्रीयेथे', 'क्रीयावहे', 'क्रीयन्ते', 'क्रीयध्वे', 'क्रीयामहे'],
        'lan_par': ['अक्रीणात्', ], // 'अक्रीणाः', 'अक्रीणाम्', 'अक्रीणीताम्', 'अक्रीणीतम्', 'अक्रीणीव', 'अक्रीणन्', 'अक्रीणीत', 'अक्रीणीम'],
        'lan_atm': ['अक्रीणीत', ], // 'अक्रीणीथाः', 'अक्रीणि', 'अक्रीणाताम्', 'अक्रीणाथाम्', 'अक्रीणीवहि', 'अक्रीणत', 'अक्रीणीध्वम्', 'अक्रीणीमहि'],
        'lan_pas': ['अक्रीयत', ], // 'अक्रीयथाः', 'अक्रीये', 'अक्रीयेताम्', 'अक्रीयेथाम्', 'अक्रीयावहि', 'अक्रीयन्त', 'अक्रीयध्वम्', 'अक्रीयामहि'],
        'lot_par': ['क्रीणातु', ], // 'क्रीणीहि', 'क्रीणानि', 'क्रीणीताम्', 'क्रीणीतम्', 'क्रीणाव', 'क्रीणन्तु', 'क्रीणीत', 'क्रीणाम'],
        'lot_atm': ['क्रीणीताम्', ], // 'क्रीणीष्व', 'क्रीणै', 'क्रीणाताम्', 'क्रीणाथाम्', 'क्रीणावहै', 'क्रीणताम्', 'क्रीणीध्वम्', 'क्रीणामहै'],
        'lot_pas': ['क्रीयताम्', ], // 'क्रीयस्व', 'क्रीयै', 'क्रीयेताम्', 'क्रीयेथाम्', 'क्रीयावहै', 'क्रीयन्ताम्', 'क्रीयध्वम्', 'क्रीयामहै'],
        'lit_par': ['चिक्राय', ], // 'चिक्रेथ-चिक्रयिथ', 'चिक्राय-चिक्रय', 'चिक्रियतुः', 'चिक्रियथुः', 'चिक्रियिव', 'चिक्रियुः', 'चिक्रिय', 'चिक्रियिम'],
        'lit_atm': ['चिक्रिये', ], // 'चिक्रियिषे', 'चिक्रिये', 'चिक्रियाते', 'चिक्रियाथे', 'चिक्रियिवहे', 'चिक्रियिरे', 'चिक्रियिध्वे', 'चिक्रियिमहे'],
    },
}

var ganaTen = {
    'cur': { // to steal // FIXME: _pass
        'lat_par': ['चोरयति', ], // 'चोरयसि', 'चोरयामि', 'चोरयतः', 'चोरयथः', 'चोरयावः', 'चोरयन्ति', 'चोरयथ', 'चोरयामः'],
        'lat_atm': ['चोरयते', ], // 'चोरयसे', 'चोरये', 'चोरयेते', 'चोरयेथे', 'चोरयावहे', 'चोरयन्ते', 'चोरयध्वे', 'चोरयामहे'],
        'lat_pas': ['चोर्यते', ], // 'चोर्यसे', 'चोर्ये', 'चोर्येते', 'चोर्येथे', 'चोर्यावहे', 'चोर्यन्ते', 'चोर्यध्वे', 'चोर्यामहे'],
        'lan_par': ['अचोरयत्', ], // 'अचोरयः', 'अचोरयम्', 'अचोरयताम्', 'अचोरयतम्', 'अचोरयाव', 'अचोरयन्', 'अचोरयत', 'अचोरयाम'],
        'lan_atm': ['अचोरयत', ], // 'अचोरयथाः', 'अचोरये', 'अचोरयेताम्', 'अचोरयेथाम्', 'अचोरयावहि', 'अचोरयन्त', 'अचोरयध्वम्', 'अचोरयामहि'],
        'lan_pas': ['अचोर्यत', ], // 'अचोर्यथाः', 'अचोर्ये', 'अचोर्येताम्', 'अचोर्येथाम्', 'अचोर्यावहि', 'अचोर्यन्त', 'अचोर्यध्वम्', 'अचोर्यामहि'],
        'lot_par': ['चोरयतु', ], // 'चोरय', 'चोरयाणि', 'चोरयताम्', 'चोरयतम्', 'चोरयाव', 'चोरयन्तु', 'चोरयत', 'चोरयाम'],
        'lot_atm': ['चोरयताम्', ], // 'चोरयस्व', 'चोरयै', 'चोरयेताम्', 'चोरयेथाम्', 'चोरयावहै', 'चोरयन्ताम्', 'चोरयध्वम्', 'चोरयामहै'],
        'lot_pas': ['चोर्यताम्', ], // 'चोर्यस्व', 'चोर्यै', 'चोर्येताम्', 'चोर्येथाम्', 'चोर्यावहै', 'चोर्यन्ताम्', 'चोर्यध्वम्', 'चोर्यामहै'],
        // 'lit_par': ['', '', '', '', '', '', '', '', ''], // почему-то на inria.fr нет lit
        // 'lit_atm': ['', '', '', '', '', '', '', '', ''],
    },
}

var descNaman = {gend: 'masc', var: 'a'};
var naman = {
    'kAma': { // love
        'sg': ['कामः', ], // 'काम', 'कामम्', 'कामेन', 'कामाय', 'कामात्', 'कामस्य', 'कामे'], // abl. कामतः
        'du': ['कामौ', ], // 'कामौ', 'कामौ', 'कामाभ्याम्', 'कामाभ्याम्', 'कामाभ्याम्', 'कामयोः', 'कामयोः'],
        'pl': ['कामाः', ], // 'कामाः', 'कामान्', 'कामैः', 'कामेभ्यः', 'कामेभ्यः', 'कामानाम्', 'कामेषु'],
    },
}


// ========



var upaNaman = [
    ["अति-", "अतिशयः-शय", "अतिरेकः-रेक"],
];

var upaVerb = [
    ["उत्-", "उत्पतति-पत्"],
];

var kritKta = [
    ['akz', 'अक्ष्', 'अष्टः'],
];

var kritLyut = [
    [ 'paW', 'पठ्', 'पठनम्' ],
];

var tavyat = [
    ['अद्', 'eat', 'अत्तव्य', 'eaten', 'अत्तव्यः', 'अत्तव्या', 'अत्तव्यम्'],
];

var tvAc = [
    ['भू', 'been', '', '', 'भूत्वा'],
];

var avyayaAll = [
    ['इष्', 'wish', 'एषितुम्', 'एषम्', 'एषित्वा/एषित्त्वा'],
];


describe('all-krit-kta', function() {
    utils.kritKta(kritKta, 'kta');
});

describe('all-krit-lyut', function() {
    utils.kritKta(kritLyut, 'lyut');
});

describe('all-krit-tavyat', function() {
    utils.kridantaArray(tavyat, 'tavyat');
});

describe('all-krit-tvAc', function() {
    utils.kridantaAvyaya(tvAc, 'tvAc');
});

describe('all-krit-avyaya', function() {
    utils.kridantaAvyaya(avyayaAll, 'avyaya');
});


describe('all-upaNaman', function() {
    utils.upasarga('upa', upaNaman);
});

describe('all-upaVerb', function() {
    utils.upasarga('upaVerb', upaVerb);
});

describe('all-naman-masc', function() {
    utils.fireNoun(naman, descNaman);
});



// ============ VERBS ===============

describe('verb-ganaOne', function() {
    utils.fireTest(ganaOne, 'one');
});

describe('verb-two', function() {
    utils.fireTest(ganaTwo, 'two');
});

describe('verb-four', function() {
    utils.fireTest(ganaFour, 'four');
});

describe('verb-five', function() {
    utils.fireTest(ganaFive, 'five');
});

describe('verb-six', function() {
    utils.fireTest(ganaSix, 'six');
});

describe('verb-seven', function() {
    utils.fireTest(ganaSeven, 'seven');
});

describe('verb-eight', function() {
    utils.fireTest(ganaEight, 'eight');
});

describe('verb-nine', function() {
    utils.fireTest(ganaNine, 'nine');
});

describe('verb-ten', function() {
    utils.fireTest(ganaTen, 'ten');
});
